TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Thu Nov 03 12:48:44 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Main_Base.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("Processor_Initialization")

Main_Base.asm                                                        PAGE   28

    1417                            .dwattr $C$DW$139, DW_AT_const_value(0x02)
    1418                            .dwattr $C$DW$139, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1419                            .dwattr $C$DW$139, DW_AT_decl_line(0x7e)
    1420                            .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    1421                    
    1422                    $C$DW$140       .dwtag  DW_TAG_enumerator
    1423                            .dwattr $C$DW$140, DW_AT_name("eSetValueWithOverwrite")
    1424                            .dwattr $C$DW$140, DW_AT_const_value(0x03)
    1425                            .dwattr $C$DW$140, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1426                            .dwattr $C$DW$140, DW_AT_decl_line(0x7f)
    1427                            .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    1428                    
    1429                    $C$DW$141       .dwtag  DW_TAG_enumerator
    1430                            .dwattr $C$DW$141, DW_AT_name("eSetValueWithoutOverwrite")
    1431                            .dwattr $C$DW$141, DW_AT_const_value(0x04)
    1432                            .dwattr $C$DW$141, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1433                            .dwattr $C$DW$141, DW_AT_decl_line(0x80)
    1434                            .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    1435                    
    1436                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1437                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x7b)
    1438                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
    1439                            .dwendtag $C$DW$T$86
    1440                    
    1441                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    1442                            .dwattr $C$DW$T$87, DW_AT_name("eNotifyAction")
    1443                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1444                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1445                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1446                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x81)
    1447                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    1448                    
    1449                    
    1450                    $C$DW$T$88      .dwtag  DW_TAG_enumeration_type
    1451                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
    1452                    $C$DW$142       .dwtag  DW_TAG_enumerator
    1453                            .dwattr $C$DW$142, DW_AT_name("eAbortSleep")
    1454                            .dwattr $C$DW$142, DW_AT_const_value(0x00)
    1455                            .dwattr $C$DW$142, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1456                            .dwattr $C$DW$142, DW_AT_decl_line(0xb5)
    1457                            .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    1458                    
    1459                    $C$DW$143       .dwtag  DW_TAG_enumerator
    1460                            .dwattr $C$DW$143, DW_AT_name("eStandardSleep")
    1461                            .dwattr $C$DW$143, DW_AT_const_value(0x01)
    1462                            .dwattr $C$DW$143, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1463                            .dwattr $C$DW$143, DW_AT_decl_line(0xb6)
    1464                            .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    1465                    
    1466                    $C$DW$144       .dwtag  DW_TAG_enumerator
    1467                            .dwattr $C$DW$144, DW_AT_name("eNoTasksWaitingTimeout")
    1468                            .dwattr $C$DW$144, DW_AT_const_value(0x02)
    1469                            .dwattr $C$DW$144, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1470                            .dwattr $C$DW$144, DW_AT_decl_line(0xb7)
    1471                            .dwattr $C$DW$144, DW_AT_decl_column(0x02)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   29

    1472                    
    1473                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1474                            .dwattr $C$DW$T$88, DW_AT_decl_line(0xb4)
    1475                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x01)
    1476                            .dwendtag $C$DW$T$88
    1477                    
    1478                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    1479                            .dwattr $C$DW$T$89, DW_AT_name("eSleepModeStatus")
    1480                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1481                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1482                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1483                            .dwattr $C$DW$T$89, DW_AT_decl_line(0xb8)
    1484                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    1485                    
    1486                    
    1487                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1488                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1489                    $C$DW$145       .dwtag  DW_TAG_member
    1490                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1491                            .dwattr $C$DW$145, DW_AT_name("ui8Addr")
    1492                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("ui8Addr")
    1493                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1495                            .dwattr $C$DW$145, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1496                            .dwattr $C$DW$145, DW_AT_decl_line(0x4c)
    1497                            .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    1498                    
    1499                    $C$DW$146       .dwtag  DW_TAG_member
    1500                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    1501                            .dwattr $C$DW$146, DW_AT_name("pui8WriteData")
    1502                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("pui8WriteData")
    1503                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1504                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1505                            .dwattr $C$DW$146, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1506                            .dwattr $C$DW$146, DW_AT_decl_line(0x51)
    1507                            .dwattr $C$DW$146, DW_AT_decl_column(0x14)
    1508                    
    1509                    $C$DW$147       .dwtag  DW_TAG_member
    1510                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    1511                            .dwattr $C$DW$147, DW_AT_name("ui16WriteCount")
    1512                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("ui16WriteCount")
    1513                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1514                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1515                            .dwattr $C$DW$147, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1516                            .dwattr $C$DW$147, DW_AT_decl_line(0x56)
    1517                            .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    1518                    
    1519                    $C$DW$148       .dwtag  DW_TAG_member
    1520                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$22)
    1521                            .dwattr $C$DW$148, DW_AT_name("ui16WriteBatchSize")
    1522                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1523                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1524                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1525                            .dwattr $C$DW$148, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1526                            .dwattr $C$DW$148, DW_AT_decl_line(0x5b)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   30

    1527                            .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    1528                    
    1529                    $C$DW$149       .dwtag  DW_TAG_member
    1530                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$23)
    1531                            .dwattr $C$DW$149, DW_AT_name("pui8ReadData")
    1532                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("pui8ReadData")
    1533                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1534                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1535                            .dwattr $C$DW$149, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1536                            .dwattr $C$DW$149, DW_AT_decl_line(0x60)
    1537                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    1538                    
    1539                    $C$DW$150       .dwtag  DW_TAG_member
    1540                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$22)
    1541                            .dwattr $C$DW$150, DW_AT_name("ui16ReadCount")
    1542                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("ui16ReadCount")
    1543                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1544                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1545                            .dwattr $C$DW$150, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1546                            .dwattr $C$DW$150, DW_AT_decl_line(0x65)
    1547                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    1548                    
    1549                    $C$DW$151       .dwtag  DW_TAG_member
    1550                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$22)
    1551                            .dwattr $C$DW$151, DW_AT_name("ui16ReadBatchSize")
    1552                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1553                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1554                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1555                            .dwattr $C$DW$151, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1556                            .dwattr $C$DW$151, DW_AT_decl_line(0x6a)
    1557                            .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    1558                    
    1559                    $C$DW$152       .dwtag  DW_TAG_member
    1560                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$28)
    1561                            .dwattr $C$DW$152, DW_AT_name("pfnCallback")
    1562                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("pfnCallback")
    1563                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1564                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1565                            .dwattr $C$DW$152, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1566                            .dwattr $C$DW$152, DW_AT_decl_line(0x6f)
    1567                            .dwattr $C$DW$152, DW_AT_decl_column(0x16)
    1568                    
    1569                    $C$DW$153       .dwtag  DW_TAG_member
    1570                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$3)
    1571                            .dwattr $C$DW$153, DW_AT_name("pvCallbackData")
    1572                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("pvCallbackData")
    1573                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1574                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1575                            .dwattr $C$DW$153, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1576                            .dwattr $C$DW$153, DW_AT_decl_line(0x74)
    1577                            .dwattr $C$DW$153, DW_AT_decl_column(0x0b)
    1578                    
    1579                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1580                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1581                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   31

    1582                            .dwendtag $C$DW$T$29
    1583                    
    1584                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1585                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1586                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1587                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1588                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1589                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1590                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1591                    
    1592                    
    1593                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1594                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1595                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1596                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1597                    $C$DW$154       .dwtag  DW_TAG_subrange_type
    1598                            .dwattr $C$DW$154, DW_AT_upper_bound(0x09)
    1599                    
    1600                            .dwendtag $C$DW$T$31
    1601                    
    1602                    
    1603                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1604                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1605                    $C$DW$155       .dwtag  DW_TAG_member
    1606                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$24)
    1607                            .dwattr $C$DW$155, DW_AT_name("ui32Base")
    1608                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("ui32Base")
    1609                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1610                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1611                            .dwattr $C$DW$155, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1612                            .dwattr $C$DW$155, DW_AT_decl_line(0x82)
    1613                            .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    1614                    
    1615                    $C$DW$156       .dwtag  DW_TAG_member
    1616                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1617                            .dwattr $C$DW$156, DW_AT_name("ui8Int")
    1618                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("ui8Int")
    1619                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1620                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1621                            .dwattr $C$DW$156, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1622                            .dwattr $C$DW$156, DW_AT_decl_line(0x87)
    1623                            .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    1624                    
    1625                    $C$DW$157       .dwtag  DW_TAG_member
    1626                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1627                            .dwattr $C$DW$157, DW_AT_name("ui8TxDMA")
    1628                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("ui8TxDMA")
    1629                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1630                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1631                            .dwattr $C$DW$157, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1632                            .dwattr $C$DW$157, DW_AT_decl_line(0x8c)
    1633                            .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    1634                    
    1635                    $C$DW$158       .dwtag  DW_TAG_member
    1636                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   32

    1637                            .dwattr $C$DW$158, DW_AT_name("ui8RxDMA")
    1638                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("ui8RxDMA")
    1639                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1640                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1641                            .dwattr $C$DW$158, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1642                            .dwattr $C$DW$158, DW_AT_decl_line(0x91)
    1643                            .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    1644                    
    1645                    $C$DW$159       .dwtag  DW_TAG_member
    1646                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1647                            .dwattr $C$DW$159, DW_AT_name("ui8State")
    1648                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("ui8State")
    1649                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1650                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1651                            .dwattr $C$DW$159, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1652                            .dwattr $C$DW$159, DW_AT_decl_line(0x96)
    1653                            .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    1654                    
    1655                    $C$DW$160       .dwtag  DW_TAG_member
    1656                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1657                            .dwattr $C$DW$160, DW_AT_name("ui8ReadPtr")
    1658                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("ui8ReadPtr")
    1659                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1660                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1661                            .dwattr $C$DW$160, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1662                            .dwattr $C$DW$160, DW_AT_decl_line(0x9c)
    1663                            .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    1664                    
    1665                    $C$DW$161       .dwtag  DW_TAG_member
    1666                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1667                            .dwattr $C$DW$161, DW_AT_name("ui8WritePtr")
    1668                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("ui8WritePtr")
    1669                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1670                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1671                            .dwattr $C$DW$161, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1672                            .dwattr $C$DW$161, DW_AT_decl_line(0xa2)
    1673                            .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    1674                    
    1675                    $C$DW$162       .dwtag  DW_TAG_member
    1676                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    1677                            .dwattr $C$DW$162, DW_AT_name("ui16Index")
    1678                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("ui16Index")
    1679                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1680                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1681                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1682                            .dwattr $C$DW$162, DW_AT_decl_line(0xa7)
    1683                            .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    1684                    
    1685                    $C$DW$163       .dwtag  DW_TAG_member
    1686                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    1687                            .dwattr $C$DW$163, DW_AT_name("pCommands")
    1688                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("pCommands")
    1689                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1690                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1691                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   33

    1692                            .dwattr $C$DW$163, DW_AT_decl_line(0xac)
    1693                            .dwattr $C$DW$163, DW_AT_decl_column(0x12)
    1694                    
    1695                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1696                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    1697                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1698                            .dwendtag $C$DW$T$32
    1699                    
    1700                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    1701                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    1702                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1703                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1704                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1705                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    1706                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    1707                    
    1708                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1709                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1710                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1711                    
    1712                    
    1713                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1714                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    1715                    $C$DW$164       .dwtag  DW_TAG_member
    1716                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$34)
    1717                            .dwattr $C$DW$164, DW_AT_name("psI2CInst")
    1718                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("psI2CInst")
    1719                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1721                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1722                            .dwattr $C$DW$164, DW_AT_decl_line(0xf0)
    1723                            .dwattr $C$DW$164, DW_AT_decl_column(0x14)
    1724                    
    1725                    $C$DW$165       .dwtag  DW_TAG_member
    1726                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$35)
    1727                            .dwattr $C$DW$165, DW_AT_name("pui8Buffer")
    1728                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("pui8Buffer")
    1729                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1730                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1731                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1732                            .dwattr $C$DW$165, DW_AT_decl_line(0xf5)
    1733                            .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    1734                    
    1735                    $C$DW$166       .dwtag  DW_TAG_member
    1736                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1737                            .dwattr $C$DW$166, DW_AT_name("ui8State")
    1738                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("ui8State")
    1739                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1740                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1741                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1742                            .dwattr $C$DW$166, DW_AT_decl_line(0xfa)
    1743                            .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    1744                    
    1745                    $C$DW$167       .dwtag  DW_TAG_member
    1746                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   34

    1747                            .dwattr $C$DW$167, DW_AT_name("ui8Addr")
    1748                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("ui8Addr")
    1749                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1750                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1751                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1752                            .dwattr $C$DW$167, DW_AT_decl_line(0xff)
    1753                            .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    1754                    
    1755                    $C$DW$168       .dwtag  DW_TAG_member
    1756                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    1757                            .dwattr $C$DW$168, DW_AT_name("ui16Mask")
    1758                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("ui16Mask")
    1759                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1760                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1761                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1762                            .dwattr $C$DW$168, DW_AT_decl_line(0x104)
    1763                            .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    1764                    
    1765                    $C$DW$169       .dwtag  DW_TAG_member
    1766                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    1767                            .dwattr $C$DW$169, DW_AT_name("ui16Value")
    1768                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("ui16Value")
    1769                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1770                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1771                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1772                            .dwattr $C$DW$169, DW_AT_decl_line(0x109)
    1773                            .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    1774                    
    1775                    $C$DW$170       .dwtag  DW_TAG_member
    1776                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$28)
    1777                            .dwattr $C$DW$170, DW_AT_name("pfnCallback")
    1778                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("pfnCallback")
    1779                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1780                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1781                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1782                            .dwattr $C$DW$170, DW_AT_decl_line(0x10f)
    1783                            .dwattr $C$DW$170, DW_AT_decl_column(0x16)
    1784                    
    1785                    $C$DW$171       .dwtag  DW_TAG_member
    1786                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$3)
    1787                            .dwattr $C$DW$171, DW_AT_name("pvCallbackData")
    1788                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("pvCallbackData")
    1789                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1790                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1791                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1792                            .dwattr $C$DW$171, DW_AT_decl_line(0x114)
    1793                            .dwattr $C$DW$171, DW_AT_decl_column(0x0b)
    1794                    
    1795                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1796                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    1797                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    1798                            .dwendtag $C$DW$T$36
    1799                    
    1800                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    1801                            .dwattr $C$DW$T$90, DW_AT_name("tI2CMReadModifyWrite16")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   35

    1802                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$36)
    1803                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1804                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1805                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x116)
    1806                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    1807                    
    1808                    $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    1809                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    1810                            .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    1811                    
    1812                    
    1813                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1814                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    1815                    $C$DW$172       .dwtag  DW_TAG_member
    1816                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$34)
    1817                            .dwattr $C$DW$172, DW_AT_name("psI2CInst")
    1818                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("psI2CInst")
    1819                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1821                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1822                            .dwattr $C$DW$172, DW_AT_decl_line(0xbc)
    1823                            .dwattr $C$DW$172, DW_AT_decl_column(0x14)
    1824                    
    1825                    $C$DW$173       .dwtag  DW_TAG_member
    1826                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$35)
    1827                            .dwattr $C$DW$173, DW_AT_name("pui8Buffer")
    1828                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("pui8Buffer")
    1829                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1830                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1831                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1832                            .dwattr $C$DW$173, DW_AT_decl_line(0xc1)
    1833                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    1834                    
    1835                    $C$DW$174       .dwtag  DW_TAG_member
    1836                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1837                            .dwattr $C$DW$174, DW_AT_name("ui8State")
    1838                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui8State")
    1839                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1840                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1841                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1842                            .dwattr $C$DW$174, DW_AT_decl_line(0xc6)
    1843                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    1844                    
    1845                    $C$DW$175       .dwtag  DW_TAG_member
    1846                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1847                            .dwattr $C$DW$175, DW_AT_name("ui8Addr")
    1848                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ui8Addr")
    1849                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1850                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1851                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1852                            .dwattr $C$DW$175, DW_AT_decl_line(0xcb)
    1853                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    1854                    
    1855                    $C$DW$176       .dwtag  DW_TAG_member
    1856                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   36

    1857                            .dwattr $C$DW$176, DW_AT_name("ui8Mask")
    1858                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("ui8Mask")
    1859                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1860                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1861                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1862                            .dwattr $C$DW$176, DW_AT_decl_line(0xd0)
    1863                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    1864                    
    1865                    $C$DW$177       .dwtag  DW_TAG_member
    1866                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1867                            .dwattr $C$DW$177, DW_AT_name("ui8Value")
    1868                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("ui8Value")
    1869                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1870                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1871                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1872                            .dwattr $C$DW$177, DW_AT_decl_line(0xd5)
    1873                            .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    1874                    
    1875                    $C$DW$178       .dwtag  DW_TAG_member
    1876                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$28)
    1877                            .dwattr $C$DW$178, DW_AT_name("pfnCallback")
    1878                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("pfnCallback")
    1879                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1880                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1881                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1882                            .dwattr $C$DW$178, DW_AT_decl_line(0xdb)
    1883                            .dwattr $C$DW$178, DW_AT_decl_column(0x16)
    1884                    
    1885                    $C$DW$179       .dwtag  DW_TAG_member
    1886                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$3)
    1887                            .dwattr $C$DW$179, DW_AT_name("pvCallbackData")
    1888                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("pvCallbackData")
    1889                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1890                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1891                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1892                            .dwattr $C$DW$179, DW_AT_decl_line(0xe0)
    1893                            .dwattr $C$DW$179, DW_AT_decl_column(0x0b)
    1894                    
    1895                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1896                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xb7)
    1897                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    1898                            .dwendtag $C$DW$T$37
    1899                    
    1900                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    1901                            .dwattr $C$DW$T$50, DW_AT_name("tI2CMReadModifyWrite8")
    1902                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$37)
    1903                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1904                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1905                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe2)
    1906                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    1907                    
    1908                    
    1909                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1910                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1911                    $C$DW$180       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   37

    1912                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$34)
    1913                            .dwattr $C$DW$180, DW_AT_name("psI2CInst")
    1914                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("psI2CInst")
    1915                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1917                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1918                            .dwattr $C$DW$180, DW_AT_decl_line(0x123)
    1919                            .dwattr $C$DW$180, DW_AT_decl_column(0x14)
    1920                    
    1921                    $C$DW$181       .dwtag  DW_TAG_member
    1922                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$38)
    1923                            .dwattr $C$DW$181, DW_AT_name("pui8Buffer")
    1924                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("pui8Buffer")
    1925                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1926                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1927                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1928                            .dwattr $C$DW$181, DW_AT_decl_line(0x128)
    1929                            .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    1930                    
    1931                    $C$DW$182       .dwtag  DW_TAG_member
    1932                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    1933                            .dwattr $C$DW$182, DW_AT_name("ui16Count")
    1934                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui16Count")
    1935                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1936                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1937                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1938                            .dwattr $C$DW$182, DW_AT_decl_line(0x12d)
    1939                            .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    1940                    
    1941                    $C$DW$183       .dwtag  DW_TAG_member
    1942                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    1943                            .dwattr $C$DW$183, DW_AT_name("pui8Data")
    1944                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("pui8Data")
    1945                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1946                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1947                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1948                            .dwattr $C$DW$183, DW_AT_decl_line(0x132)
    1949                            .dwattr $C$DW$183, DW_AT_decl_column(0x14)
    1950                    
    1951                    $C$DW$184       .dwtag  DW_TAG_member
    1952                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$28)
    1953                            .dwattr $C$DW$184, DW_AT_name("pfnCallback")
    1954                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("pfnCallback")
    1955                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1956                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1957                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1958                            .dwattr $C$DW$184, DW_AT_decl_line(0x137)
    1959                            .dwattr $C$DW$184, DW_AT_decl_column(0x16)
    1960                    
    1961                    $C$DW$185       .dwtag  DW_TAG_member
    1962                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$3)
    1963                            .dwattr $C$DW$185, DW_AT_name("pvCallbackData")
    1964                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("pvCallbackData")
    1965                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1966                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   38

    1967                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1968                            .dwattr $C$DW$185, DW_AT_decl_line(0x13c)
    1969                            .dwattr $C$DW$185, DW_AT_decl_column(0x0b)
    1970                    
    1971                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1972                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x11e)
    1973                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    1974                            .dwendtag $C$DW$T$39
    1975                    
    1976                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    1977                            .dwattr $C$DW$T$49, DW_AT_name("tI2CMWrite8")
    1978                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$39)
    1979                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1980                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1981                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x13e)
    1982                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    1983                    
    1984                    
    1985                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1986                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    1987                    $C$DW$186       .dwtag  DW_TAG_member
    1988                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$34)
    1989                            .dwattr $C$DW$186, DW_AT_name("psI2CInst")
    1990                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("psI2CInst")
    1991                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1993                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1994                            .dwattr $C$DW$186, DW_AT_decl_line(0x14c)
    1995                            .dwattr $C$DW$186, DW_AT_decl_column(0x14)
    1996                    
    1997                    $C$DW$187       .dwtag  DW_TAG_member
    1998                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$23)
    1999                            .dwattr $C$DW$187, DW_AT_name("pui8Data")
    2000                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("pui8Data")
    2001                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2002                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2003                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2004                            .dwattr $C$DW$187, DW_AT_decl_line(0x151)
    2005                            .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    2006                    
    2007                    $C$DW$188       .dwtag  DW_TAG_member
    2008                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    2009                            .dwattr $C$DW$188, DW_AT_name("ui16Count")
    2010                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ui16Count")
    2011                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2012                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2013                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2014                            .dwattr $C$DW$188, DW_AT_decl_line(0x156)
    2015                            .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    2016                    
    2017                    $C$DW$189       .dwtag  DW_TAG_member
    2018                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$28)
    2019                            .dwattr $C$DW$189, DW_AT_name("pfnCallback")
    2020                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("pfnCallback")
    2021                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   39

    2022                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2023                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2024                            .dwattr $C$DW$189, DW_AT_decl_line(0x15b)
    2025                            .dwattr $C$DW$189, DW_AT_decl_column(0x16)
    2026                    
    2027                    $C$DW$190       .dwtag  DW_TAG_member
    2028                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$3)
    2029                            .dwattr $C$DW$190, DW_AT_name("pvCallbackData")
    2030                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("pvCallbackData")
    2031                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2032                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2033                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2034                            .dwattr $C$DW$190, DW_AT_decl_line(0x160)
    2035                            .dwattr $C$DW$190, DW_AT_decl_column(0x0b)
    2036                    
    2037                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2038                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x147)
    2039                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    2040                            .dwendtag $C$DW$T$40
    2041                    
    2042                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    2043                            .dwattr $C$DW$T$92, DW_AT_name("tI2CMRead16BE")
    2044                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$40)
    2045                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2046                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2047                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x162)
    2048                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    2049                    
    2050                    
    2051                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2052                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    2053                    $C$DW$191       .dwtag  DW_TAG_member
    2054                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$34)
    2055                            .dwattr $C$DW$191, DW_AT_name("psI2CInst")
    2056                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("psI2CInst")
    2057                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2059                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2060                            .dwattr $C$DW$191, DW_AT_decl_line(0x170)
    2061                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2062                    
    2063                    $C$DW$192       .dwtag  DW_TAG_member
    2064                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$38)
    2065                            .dwattr $C$DW$192, DW_AT_name("pui8Buffer")
    2066                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pui8Buffer")
    2067                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2068                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2069                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2070                            .dwattr $C$DW$192, DW_AT_decl_line(0x175)
    2071                            .dwattr $C$DW$192, DW_AT_decl_column(0x0d)
    2072                    
    2073                    $C$DW$193       .dwtag  DW_TAG_member
    2074                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2075                            .dwattr $C$DW$193, DW_AT_name("ui16Count")
    2076                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("ui16Count")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   40

    2077                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2078                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2079                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2080                            .dwattr $C$DW$193, DW_AT_decl_line(0x17a)
    2081                            .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    2082                    
    2083                    $C$DW$194       .dwtag  DW_TAG_member
    2084                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    2085                            .dwattr $C$DW$194, DW_AT_name("pui8Data")
    2086                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("pui8Data")
    2087                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2088                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2089                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2090                            .dwattr $C$DW$194, DW_AT_decl_line(0x17f)
    2091                            .dwattr $C$DW$194, DW_AT_decl_column(0x14)
    2092                    
    2093                    $C$DW$195       .dwtag  DW_TAG_member
    2094                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$28)
    2095                            .dwattr $C$DW$195, DW_AT_name("pfnCallback")
    2096                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("pfnCallback")
    2097                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2098                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2099                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2100                            .dwattr $C$DW$195, DW_AT_decl_line(0x184)
    2101                            .dwattr $C$DW$195, DW_AT_decl_column(0x16)
    2102                    
    2103                    $C$DW$196       .dwtag  DW_TAG_member
    2104                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$3)
    2105                            .dwattr $C$DW$196, DW_AT_name("pvCallbackData")
    2106                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("pvCallbackData")
    2107                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2108                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2109                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2110                            .dwattr $C$DW$196, DW_AT_decl_line(0x189)
    2111                            .dwattr $C$DW$196, DW_AT_decl_column(0x0b)
    2112                    
    2113                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2114                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x16b)
    2115                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2116                            .dwendtag $C$DW$T$41
    2117                    
    2118                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    2119                            .dwattr $C$DW$T$93, DW_AT_name("tI2CMWrite16BE")
    2120                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$41)
    2121                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2122                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2123                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x18b)
    2124                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2125                    
    2126                    
    2127                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2128                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x2c)
    2129                    $C$DW$197       .dwtag  DW_TAG_member
    2130                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$34)
    2131                            .dwattr $C$DW$197, DW_AT_name("psI2CInst")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   41

    2132                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("psI2CInst")
    2133                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2134                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2135                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2136                            .dwattr $C$DW$197, DW_AT_decl_line(0x32)
    2137                            .dwattr $C$DW$197, DW_AT_decl_column(0x14)
    2138                    
    2139                    $C$DW$198       .dwtag  DW_TAG_member
    2140                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2141                            .dwattr $C$DW$198, DW_AT_name("ui8Addr")
    2142                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("ui8Addr")
    2143                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2144                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2145                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2146                            .dwattr $C$DW$198, DW_AT_decl_line(0x37)
    2147                            .dwattr $C$DW$198, DW_AT_decl_column(0x0d)
    2148                    
    2149                    $C$DW$199       .dwtag  DW_TAG_member
    2150                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2151                            .dwattr $C$DW$199, DW_AT_name("ui8State")
    2152                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("ui8State")
    2153                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2154                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2155                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2156                            .dwattr $C$DW$199, DW_AT_decl_line(0x3c)
    2157                            .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    2158                    
    2159                    $C$DW$200       .dwtag  DW_TAG_member
    2160                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$42)
    2161                            .dwattr $C$DW$200, DW_AT_name("pui8Data")
    2162                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("pui8Data")
    2163                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2164                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2165                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2166                            .dwattr $C$DW$200, DW_AT_decl_line(0x41)
    2167                            .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    2168                    
    2169                    $C$DW$201       .dwtag  DW_TAG_member
    2170                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$28)
    2171                            .dwattr $C$DW$201, DW_AT_name("pfnCallback")
    2172                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("pfnCallback")
    2173                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2174                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2175                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2176                            .dwattr $C$DW$201, DW_AT_decl_line(0x47)
    2177                            .dwattr $C$DW$201, DW_AT_decl_column(0x16)
    2178                    
    2179                    $C$DW$202       .dwtag  DW_TAG_member
    2180                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$3)
    2181                            .dwattr $C$DW$202, DW_AT_name("pvCallbackData")
    2182                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("pvCallbackData")
    2183                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2184                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2185                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2186                            .dwattr $C$DW$202, DW_AT_decl_line(0x4c)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   42

    2187                            .dwattr $C$DW$202, DW_AT_decl_column(0x0b)
    2188                    
    2189                    $C$DW$203       .dwtag  DW_TAG_member
    2190                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$51)
    2191                            .dwattr $C$DW$203, DW_AT_name("uCommand")
    2192                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("uCommand")
    2193                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2194                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2195                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2196                            .dwattr $C$DW$203, DW_AT_decl_line(0x64)
    2197                            .dwattr $C$DW$203, DW_AT_decl_column(0x05)
    2198                    
    2199                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2200                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2d)
    2201                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    2202                            .dwendtag $C$DW$T$43
    2203                    
    2204                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    2205                            .dwattr $C$DW$T$44, DW_AT_name("tAK8975")
    2206                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2207                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2208                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2209                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x66)
    2210                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2211                    
    2212                    
    2213                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2214                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x6c)
    2215                    $C$DW$204       .dwtag  DW_TAG_member
    2216                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$34)
    2217                            .dwattr $C$DW$204, DW_AT_name("psI2CInst")
    2218                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("psI2CInst")
    2219                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2221                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2222                            .dwattr $C$DW$204, DW_AT_decl_line(0x33)
    2223                            .dwattr $C$DW$204, DW_AT_decl_column(0x14)
    2224                    
    2225                    $C$DW$205       .dwtag  DW_TAG_member
    2226                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$44)
    2227                            .dwattr $C$DW$205, DW_AT_name("sAK8975Inst")
    2228                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("sAK8975Inst")
    2229                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2230                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2231                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2232                            .dwattr $C$DW$205, DW_AT_decl_line(0x38)
    2233                            .dwattr $C$DW$205, DW_AT_decl_column(0x0d)
    2234                    
    2235                    $C$DW$206       .dwtag  DW_TAG_member
    2236                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2237                            .dwattr $C$DW$206, DW_AT_name("ui8Addr")
    2238                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("ui8Addr")
    2239                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2240                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2241                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   43

    2242                            .dwattr $C$DW$206, DW_AT_decl_line(0x3d)
    2243                            .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    2244                    
    2245                    $C$DW$207       .dwtag  DW_TAG_member
    2246                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2247                            .dwattr $C$DW$207, DW_AT_name("ui8State")
    2248                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("ui8State")
    2249                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2250                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2251                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2252                            .dwattr $C$DW$207, DW_AT_decl_line(0x42)
    2253                            .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    2254                    
    2255                    $C$DW$208       .dwtag  DW_TAG_member
    2256                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2257                            .dwattr $C$DW$208, DW_AT_name("ui8AccelAfsSel")
    2258                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2259                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2260                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2261                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2262                            .dwattr $C$DW$208, DW_AT_decl_line(0x47)
    2263                            .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    2264                    
    2265                    $C$DW$209       .dwtag  DW_TAG_member
    2266                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2267                            .dwattr $C$DW$209, DW_AT_name("ui8NewAccelAfsSel")
    2268                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2269                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2270                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2271                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2272                            .dwattr $C$DW$209, DW_AT_decl_line(0x4d)
    2273                            .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    2274                    
    2275                    $C$DW$210       .dwtag  DW_TAG_member
    2276                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2277                            .dwattr $C$DW$210, DW_AT_name("ui8GyroFsSel")
    2278                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2279                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2280                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2281                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2282                            .dwattr $C$DW$210, DW_AT_decl_line(0x52)
    2283                            .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    2284                    
    2285                    $C$DW$211       .dwtag  DW_TAG_member
    2286                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2287                            .dwattr $C$DW$211, DW_AT_name("ui8NewGyroFsSel")
    2288                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2289                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2290                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2291                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2292                            .dwattr $C$DW$211, DW_AT_decl_line(0x58)
    2293                            .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    2294                    
    2295                    $C$DW$212       .dwtag  DW_TAG_member
    2296                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$45)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   44

    2297                            .dwattr $C$DW$212, DW_AT_name("pui8Data")
    2298                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("pui8Data")
    2299                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2300                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2301                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2302                            .dwattr $C$DW$212, DW_AT_decl_line(0x5d)
    2303                            .dwattr $C$DW$212, DW_AT_decl_column(0x0d)
    2304                    
    2305                    $C$DW$213       .dwtag  DW_TAG_member
    2306                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$28)
    2307                            .dwattr $C$DW$213, DW_AT_name("pfnCallback")
    2308                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("pfnCallback")
    2309                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2310                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2311                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2312                            .dwattr $C$DW$213, DW_AT_decl_line(0x63)
    2313                            .dwattr $C$DW$213, DW_AT_decl_column(0x16)
    2314                    
    2315                    $C$DW$214       .dwtag  DW_TAG_member
    2316                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$3)
    2317                            .dwattr $C$DW$214, DW_AT_name("pvCallbackData")
    2318                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("pvCallbackData")
    2319                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2320                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2321                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2322                            .dwattr $C$DW$214, DW_AT_decl_line(0x68)
    2323                            .dwattr $C$DW$214, DW_AT_decl_column(0x0b)
    2324                    
    2325                    $C$DW$215       .dwtag  DW_TAG_member
    2326                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$53)
    2327                            .dwattr $C$DW$215, DW_AT_name("uCommand")
    2328                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("uCommand")
    2329                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2330                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2331                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2332                            .dwattr $C$DW$215, DW_AT_decl_line(0x80)
    2333                            .dwattr $C$DW$215, DW_AT_decl_column(0x05)
    2334                    
    2335                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2336                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2e)
    2337                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    2338                            .dwendtag $C$DW$T$46
    2339                    
    2340                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    2341                            .dwattr $C$DW$T$94, DW_AT_name("tMPU9150")
    2342                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$46)
    2343                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2344                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2345                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x82)
    2346                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    2347                    
    2348                    
    2349                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2350                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x18)
    2351                    $C$DW$216       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   45

    2352                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$10)
    2353                            .dwattr $C$DW$216, DW_AT_name("fd")
    2354                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("fd")
    2355                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2357                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2358                            .dwattr $C$DW$216, DW_AT_decl_line(0x5c)
    2359                            .dwattr $C$DW$216, DW_AT_decl_column(0x0b)
    2360                    
    2361                    $C$DW$217       .dwtag  DW_TAG_member
    2362                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$47)
    2363                            .dwattr $C$DW$217, DW_AT_name("buf")
    2364                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("buf")
    2365                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2366                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2367                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2368                            .dwattr $C$DW$217, DW_AT_decl_line(0x5d)
    2369                            .dwattr $C$DW$217, DW_AT_decl_column(0x16)
    2370                    
    2371                    $C$DW$218       .dwtag  DW_TAG_member
    2372                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$47)
    2373                            .dwattr $C$DW$218, DW_AT_name("pos")
    2374                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("pos")
    2375                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2376                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2377                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2378                            .dwattr $C$DW$218, DW_AT_decl_line(0x5e)
    2379                            .dwattr $C$DW$218, DW_AT_decl_column(0x16)
    2380                    
    2381                    $C$DW$219       .dwtag  DW_TAG_member
    2382                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$47)
    2383                            .dwattr $C$DW$219, DW_AT_name("bufend")
    2384                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("bufend")
    2385                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2386                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2387                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2388                            .dwattr $C$DW$219, DW_AT_decl_line(0x5f)
    2389                            .dwattr $C$DW$219, DW_AT_decl_column(0x16)
    2390                    
    2391                    $C$DW$220       .dwtag  DW_TAG_member
    2392                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$47)
    2393                            .dwattr $C$DW$220, DW_AT_name("buff_stop")
    2394                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("buff_stop")
    2395                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2396                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2397                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2398                            .dwattr $C$DW$220, DW_AT_decl_line(0x60)
    2399                            .dwattr $C$DW$220, DW_AT_decl_column(0x16)
    2400                    
    2401                    $C$DW$221       .dwtag  DW_TAG_member
    2402                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$11)
    2403                            .dwattr $C$DW$221, DW_AT_name("flags")
    2404                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("flags")
    2405                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2406                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   46

    2407                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2408                            .dwattr $C$DW$221, DW_AT_decl_line(0x61)
    2409                            .dwattr $C$DW$221, DW_AT_decl_column(0x16)
    2410                    
    2411                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2412                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x5b)
    2413                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    2414                            .dwendtag $C$DW$T$48
    2415                    
    2416                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    2417                            .dwattr $C$DW$T$95, DW_AT_name("FILE")
    2418                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$48)
    2419                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2420                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2421                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x62)
    2422                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2423                    
    2424                    
    2425                    $C$DW$T$51      .dwtag  DW_TAG_union_type
    2426                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x14)
    2427                    $C$DW$222       .dwtag  DW_TAG_member
    2428                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$38)
    2429                            .dwattr $C$DW$222, DW_AT_name("pui8Buffer")
    2430                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("pui8Buffer")
    2431                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2433                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2434                            .dwattr $C$DW$222, DW_AT_decl_line(0x58)
    2435                            .dwattr $C$DW$222, DW_AT_decl_column(0x11)
    2436                    
    2437                    $C$DW$223       .dwtag  DW_TAG_member
    2438                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$49)
    2439                            .dwattr $C$DW$223, DW_AT_name("sWriteState")
    2440                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("sWriteState")
    2441                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2443                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2444                            .dwattr $C$DW$223, DW_AT_decl_line(0x5d)
    2445                            .dwattr $C$DW$223, DW_AT_decl_column(0x15)
    2446                    
    2447                    $C$DW$224       .dwtag  DW_TAG_member
    2448                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$50)
    2449                            .dwattr $C$DW$224, DW_AT_name("sReadModifyWriteState")
    2450                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2451                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2453                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2454                            .dwattr $C$DW$224, DW_AT_decl_line(0x62)
    2455                            .dwattr $C$DW$224, DW_AT_decl_column(0x1f)
    2456                    
    2457                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2458                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x54)
    2459                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
    2460                            .dwendtag $C$DW$T$51
    2461                    
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   47

    2462                    
    2463                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    2464                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    2465                    $C$DW$225       .dwtag  DW_TAG_member
    2466                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$52)
    2467                            .dwattr $C$DW$225, DW_AT_name("pui8Buffer")
    2468                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("pui8Buffer")
    2469                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2471                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2472                            .dwattr $C$DW$225, DW_AT_decl_line(0x74)
    2473                            .dwattr $C$DW$225, DW_AT_decl_column(0x11)
    2474                    
    2475                    $C$DW$226       .dwtag  DW_TAG_member
    2476                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$49)
    2477                            .dwattr $C$DW$226, DW_AT_name("sWriteState")
    2478                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("sWriteState")
    2479                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2480                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2481                            .dwattr $C$DW$226, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2482                            .dwattr $C$DW$226, DW_AT_decl_line(0x79)
    2483                            .dwattr $C$DW$226, DW_AT_decl_column(0x15)
    2484                    
    2485                    $C$DW$227       .dwtag  DW_TAG_member
    2486                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$50)
    2487                            .dwattr $C$DW$227, DW_AT_name("sReadModifyWriteState")
    2488                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2489                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2490                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2491                            .dwattr $C$DW$227, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2492                            .dwattr $C$DW$227, DW_AT_decl_line(0x7e)
    2493                            .dwattr $C$DW$227, DW_AT_decl_column(0x1f)
    2494                    
    2495                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2496                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x70)
    2497                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    2498                            .dwendtag $C$DW$T$53
    2499                    
    2500                    
    2501                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2502                            .dwattr $C$DW$T$55, DW_AT_name("HeapRegion")
    2503                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    2504                    $C$DW$228       .dwtag  DW_TAG_member
    2505                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$23)
    2506                            .dwattr $C$DW$228, DW_AT_name("pucStartAddress")
    2507                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("pucStartAddress")
    2508                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2510                            .dwattr $C$DW$228, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2511                            .dwattr $C$DW$228, DW_AT_decl_line(0x96)
    2512                            .dwattr $C$DW$228, DW_AT_decl_column(0x0b)
    2513                    
    2514                    $C$DW$229       .dwtag  DW_TAG_member
    2515                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$54)
    2516                            .dwattr $C$DW$229, DW_AT_name("xSizeInBytes")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   48

    2517                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("xSizeInBytes")
    2518                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2519                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2520                            .dwattr $C$DW$229, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2521                            .dwattr $C$DW$229, DW_AT_decl_line(0x97)
    2522                            .dwattr $C$DW$229, DW_AT_decl_column(0x09)
    2523                    
    2524                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2525                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x94)
    2526                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    2527                            .dwendtag $C$DW$T$55
    2528                    
    2529                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2530                            .dwattr $C$DW$T$96, DW_AT_name("HeapRegion_t")
    2531                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$55)
    2532                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2533                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2534                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x98)
    2535                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    2536                    
    2537                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2538                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2539                    
    2540                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2541                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2542                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2543                    
    2544                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    2545                            .dwattr $C$DW$T$79, DW_AT_name("TaskHandle_t")
    2546                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$3)
    2547                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2548                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    2549                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x67)
    2550                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x10)
    2551                    
    2552                    $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    2553                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$79)
    2554                            .dwattr $C$DW$T$97, DW_AT_address_class(0x20)
    2555                    
    2556                    $C$DW$T$98      .dwtag  DW_TAG_const_type
    2557                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    2558                    
    2559                    $C$DW$T$99      .dwtag  DW_TAG_const_type
    2560                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$3)
    2561                    
    2562                    
    2563                    $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2564                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2565                    $C$DW$230       .dwtag  DW_TAG_formal_parameter
    2566                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$3)
    2567                    
    2568                    $C$DW$231       .dwtag  DW_TAG_formal_parameter
    2569                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$25)
    2570                    
    2571                            .dwendtag $C$DW$T$26
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:48:44 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   49

    2572                    
    2573                    $C$DW$T$27      .dwtag  DW_TAG_typedef
    2574                            .dwattr $C$DW$T$27, DW_AT_name("tSensorCallback")
    2575                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2576                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2577                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2578                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2c)
    2579                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0f)
    2580                    
    2581                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2582                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2583                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    2584                    
    2585                    
    2586                    $C$DW$T$67      .dwtag  DW_TAG_subroutine_type
    2587                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2588                    $C$DW$232       .dwtag  DW_TAG_formal_parameter
    2589                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$3)
    2590                    
    2591                            .dwendtag $C$DW$T$67
    2592                    
    2593                    $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    2594                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2595                            .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
    2596                    
    2597                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    2598                            .dwattr $C$DW$T$69, DW_AT_name("TaskFunction_t")
    2599                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2600                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2601                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\projdefs.h")
    2602                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x4d)
    2603                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    2604                    
    2605                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2606                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
