TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Thu Oct 27 14:03:10 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Main_Base.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("Processor_Initialization")

    1379                            .dwattr $C$DW$136, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   27

    1380                            .dwattr $C$DW$136, DW_AT_decl_line(0x7e)
    1381                            .dwattr $C$DW$136, DW_AT_decl_column(0x02)
    1382                    
    1383                    $C$DW$137       .dwtag  DW_TAG_enumerator
    1384                            .dwattr $C$DW$137, DW_AT_name("eSetValueWithOverwrite")
    1385                            .dwattr $C$DW$137, DW_AT_const_value(0x03)
    1386                            .dwattr $C$DW$137, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1387                            .dwattr $C$DW$137, DW_AT_decl_line(0x7f)
    1388                            .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    1389                    
    1390                    $C$DW$138       .dwtag  DW_TAG_enumerator
    1391                            .dwattr $C$DW$138, DW_AT_name("eSetValueWithoutOverwrite")
    1392                            .dwattr $C$DW$138, DW_AT_const_value(0x04)
    1393                            .dwattr $C$DW$138, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1394                            .dwattr $C$DW$138, DW_AT_decl_line(0x80)
    1395                            .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    1396                    
    1397                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1398                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x7b)
    1399                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
    1400                            .dwendtag $C$DW$T$86
    1401                    
    1402                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    1403                            .dwattr $C$DW$T$87, DW_AT_name("eNotifyAction")
    1404                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1405                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1406                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1407                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x81)
    1408                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    1409                    
    1410                    
    1411                    $C$DW$T$88      .dwtag  DW_TAG_enumeration_type
    1412                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
    1413                    $C$DW$139       .dwtag  DW_TAG_enumerator
    1414                            .dwattr $C$DW$139, DW_AT_name("eAbortSleep")
    1415                            .dwattr $C$DW$139, DW_AT_const_value(0x00)
    1416                            .dwattr $C$DW$139, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1417                            .dwattr $C$DW$139, DW_AT_decl_line(0xb5)
    1418                            .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    1419                    
    1420                    $C$DW$140       .dwtag  DW_TAG_enumerator
    1421                            .dwattr $C$DW$140, DW_AT_name("eStandardSleep")
    1422                            .dwattr $C$DW$140, DW_AT_const_value(0x01)
    1423                            .dwattr $C$DW$140, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1424                            .dwattr $C$DW$140, DW_AT_decl_line(0xb6)
    1425                            .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    1426                    
    1427                    $C$DW$141       .dwtag  DW_TAG_enumerator
    1428                            .dwattr $C$DW$141, DW_AT_name("eNoTasksWaitingTimeout")
    1429                            .dwattr $C$DW$141, DW_AT_const_value(0x02)
    1430                            .dwattr $C$DW$141, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1431                            .dwattr $C$DW$141, DW_AT_decl_line(0xb7)
    1432                            .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    1433                    
    1434                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   28

    1435                            .dwattr $C$DW$T$88, DW_AT_decl_line(0xb4)
    1436                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x01)
    1437                            .dwendtag $C$DW$T$88
    1438                    
    1439                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    1440                            .dwattr $C$DW$T$89, DW_AT_name("eSleepModeStatus")
    1441                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1442                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1443                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1444                            .dwattr $C$DW$T$89, DW_AT_decl_line(0xb8)
    1445                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    1446                    
    1447                    
    1448                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1449                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1450                    $C$DW$142       .dwtag  DW_TAG_member
    1451                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1452                            .dwattr $C$DW$142, DW_AT_name("ui8Addr")
    1453                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("ui8Addr")
    1454                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1456                            .dwattr $C$DW$142, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1457                            .dwattr $C$DW$142, DW_AT_decl_line(0x4c)
    1458                            .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    1459                    
    1460                    $C$DW$143       .dwtag  DW_TAG_member
    1461                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    1462                            .dwattr $C$DW$143, DW_AT_name("pui8WriteData")
    1463                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("pui8WriteData")
    1464                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1465                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1466                            .dwattr $C$DW$143, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1467                            .dwattr $C$DW$143, DW_AT_decl_line(0x51)
    1468                            .dwattr $C$DW$143, DW_AT_decl_column(0x14)
    1469                    
    1470                    $C$DW$144       .dwtag  DW_TAG_member
    1471                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$22)
    1472                            .dwattr $C$DW$144, DW_AT_name("ui16WriteCount")
    1473                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("ui16WriteCount")
    1474                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1475                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1476                            .dwattr $C$DW$144, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1477                            .dwattr $C$DW$144, DW_AT_decl_line(0x56)
    1478                            .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    1479                    
    1480                    $C$DW$145       .dwtag  DW_TAG_member
    1481                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    1482                            .dwattr $C$DW$145, DW_AT_name("ui16WriteBatchSize")
    1483                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1484                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1485                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1486                            .dwattr $C$DW$145, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1487                            .dwattr $C$DW$145, DW_AT_decl_line(0x5b)
    1488                            .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    1489                    
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   29

    1490                    $C$DW$146       .dwtag  DW_TAG_member
    1491                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$23)
    1492                            .dwattr $C$DW$146, DW_AT_name("pui8ReadData")
    1493                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("pui8ReadData")
    1494                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1495                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1496                            .dwattr $C$DW$146, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1497                            .dwattr $C$DW$146, DW_AT_decl_line(0x60)
    1498                            .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    1499                    
    1500                    $C$DW$147       .dwtag  DW_TAG_member
    1501                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    1502                            .dwattr $C$DW$147, DW_AT_name("ui16ReadCount")
    1503                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("ui16ReadCount")
    1504                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1505                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1506                            .dwattr $C$DW$147, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1507                            .dwattr $C$DW$147, DW_AT_decl_line(0x65)
    1508                            .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    1509                    
    1510                    $C$DW$148       .dwtag  DW_TAG_member
    1511                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$22)
    1512                            .dwattr $C$DW$148, DW_AT_name("ui16ReadBatchSize")
    1513                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1514                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1515                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1516                            .dwattr $C$DW$148, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1517                            .dwattr $C$DW$148, DW_AT_decl_line(0x6a)
    1518                            .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    1519                    
    1520                    $C$DW$149       .dwtag  DW_TAG_member
    1521                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$28)
    1522                            .dwattr $C$DW$149, DW_AT_name("pfnCallback")
    1523                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("pfnCallback")
    1524                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1525                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1526                            .dwattr $C$DW$149, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1527                            .dwattr $C$DW$149, DW_AT_decl_line(0x6f)
    1528                            .dwattr $C$DW$149, DW_AT_decl_column(0x16)
    1529                    
    1530                    $C$DW$150       .dwtag  DW_TAG_member
    1531                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$3)
    1532                            .dwattr $C$DW$150, DW_AT_name("pvCallbackData")
    1533                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("pvCallbackData")
    1534                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1535                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1536                            .dwattr $C$DW$150, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1537                            .dwattr $C$DW$150, DW_AT_decl_line(0x74)
    1538                            .dwattr $C$DW$150, DW_AT_decl_column(0x0b)
    1539                    
    1540                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1541                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1542                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1543                            .dwendtag $C$DW$T$29
    1544                    
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   30

    1545                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1546                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1547                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1548                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1549                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1550                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1551                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1552                    
    1553                    
    1554                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1555                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1556                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1557                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1558                    $C$DW$151       .dwtag  DW_TAG_subrange_type
    1559                            .dwattr $C$DW$151, DW_AT_upper_bound(0x09)
    1560                    
    1561                            .dwendtag $C$DW$T$31
    1562                    
    1563                    
    1564                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1565                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1566                    $C$DW$152       .dwtag  DW_TAG_member
    1567                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$24)
    1568                            .dwattr $C$DW$152, DW_AT_name("ui32Base")
    1569                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("ui32Base")
    1570                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1572                            .dwattr $C$DW$152, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1573                            .dwattr $C$DW$152, DW_AT_decl_line(0x82)
    1574                            .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    1575                    
    1576                    $C$DW$153       .dwtag  DW_TAG_member
    1577                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1578                            .dwattr $C$DW$153, DW_AT_name("ui8Int")
    1579                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("ui8Int")
    1580                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1581                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1582                            .dwattr $C$DW$153, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1583                            .dwattr $C$DW$153, DW_AT_decl_line(0x87)
    1584                            .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    1585                    
    1586                    $C$DW$154       .dwtag  DW_TAG_member
    1587                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1588                            .dwattr $C$DW$154, DW_AT_name("ui8TxDMA")
    1589                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("ui8TxDMA")
    1590                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1591                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1592                            .dwattr $C$DW$154, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1593                            .dwattr $C$DW$154, DW_AT_decl_line(0x8c)
    1594                            .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    1595                    
    1596                    $C$DW$155       .dwtag  DW_TAG_member
    1597                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1598                            .dwattr $C$DW$155, DW_AT_name("ui8RxDMA")
    1599                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("ui8RxDMA")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   31

    1600                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1601                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1602                            .dwattr $C$DW$155, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1603                            .dwattr $C$DW$155, DW_AT_decl_line(0x91)
    1604                            .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    1605                    
    1606                    $C$DW$156       .dwtag  DW_TAG_member
    1607                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1608                            .dwattr $C$DW$156, DW_AT_name("ui8State")
    1609                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("ui8State")
    1610                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1611                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1612                            .dwattr $C$DW$156, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1613                            .dwattr $C$DW$156, DW_AT_decl_line(0x96)
    1614                            .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    1615                    
    1616                    $C$DW$157       .dwtag  DW_TAG_member
    1617                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1618                            .dwattr $C$DW$157, DW_AT_name("ui8ReadPtr")
    1619                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("ui8ReadPtr")
    1620                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1621                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1622                            .dwattr $C$DW$157, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1623                            .dwattr $C$DW$157, DW_AT_decl_line(0x9c)
    1624                            .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    1625                    
    1626                    $C$DW$158       .dwtag  DW_TAG_member
    1627                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1628                            .dwattr $C$DW$158, DW_AT_name("ui8WritePtr")
    1629                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("ui8WritePtr")
    1630                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1631                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1632                            .dwattr $C$DW$158, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1633                            .dwattr $C$DW$158, DW_AT_decl_line(0xa2)
    1634                            .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    1635                    
    1636                    $C$DW$159       .dwtag  DW_TAG_member
    1637                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
    1638                            .dwattr $C$DW$159, DW_AT_name("ui16Index")
    1639                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("ui16Index")
    1640                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1641                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1642                            .dwattr $C$DW$159, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1643                            .dwattr $C$DW$159, DW_AT_decl_line(0xa7)
    1644                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    1645                    
    1646                    $C$DW$160       .dwtag  DW_TAG_member
    1647                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
    1648                            .dwattr $C$DW$160, DW_AT_name("pCommands")
    1649                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("pCommands")
    1650                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1651                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1652                            .dwattr $C$DW$160, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1653                            .dwattr $C$DW$160, DW_AT_decl_line(0xac)
    1654                            .dwattr $C$DW$160, DW_AT_decl_column(0x12)
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   32

    1655                    
    1656                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1657                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    1658                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1659                            .dwendtag $C$DW$T$32
    1660                    
    1661                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    1662                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    1663                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1664                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1665                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1666                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    1667                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    1668                    
    1669                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1670                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1671                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1672                    
    1673                    
    1674                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1675                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    1676                    $C$DW$161       .dwtag  DW_TAG_member
    1677                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$34)
    1678                            .dwattr $C$DW$161, DW_AT_name("psI2CInst")
    1679                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("psI2CInst")
    1680                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1682                            .dwattr $C$DW$161, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1683                            .dwattr $C$DW$161, DW_AT_decl_line(0xf0)
    1684                            .dwattr $C$DW$161, DW_AT_decl_column(0x14)
    1685                    
    1686                    $C$DW$162       .dwtag  DW_TAG_member
    1687                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$35)
    1688                            .dwattr $C$DW$162, DW_AT_name("pui8Buffer")
    1689                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("pui8Buffer")
    1690                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1691                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1692                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1693                            .dwattr $C$DW$162, DW_AT_decl_line(0xf5)
    1694                            .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    1695                    
    1696                    $C$DW$163       .dwtag  DW_TAG_member
    1697                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1698                            .dwattr $C$DW$163, DW_AT_name("ui8State")
    1699                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("ui8State")
    1700                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1701                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1702                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1703                            .dwattr $C$DW$163, DW_AT_decl_line(0xfa)
    1704                            .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    1705                    
    1706                    $C$DW$164       .dwtag  DW_TAG_member
    1707                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1708                            .dwattr $C$DW$164, DW_AT_name("ui8Addr")
    1709                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("ui8Addr")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   33

    1710                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1711                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1712                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1713                            .dwattr $C$DW$164, DW_AT_decl_line(0xff)
    1714                            .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    1715                    
    1716                    $C$DW$165       .dwtag  DW_TAG_member
    1717                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    1718                            .dwattr $C$DW$165, DW_AT_name("ui16Mask")
    1719                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("ui16Mask")
    1720                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1721                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1722                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1723                            .dwattr $C$DW$165, DW_AT_decl_line(0x104)
    1724                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    1725                    
    1726                    $C$DW$166       .dwtag  DW_TAG_member
    1727                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1728                            .dwattr $C$DW$166, DW_AT_name("ui16Value")
    1729                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("ui16Value")
    1730                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1731                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1732                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1733                            .dwattr $C$DW$166, DW_AT_decl_line(0x109)
    1734                            .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    1735                    
    1736                    $C$DW$167       .dwtag  DW_TAG_member
    1737                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$28)
    1738                            .dwattr $C$DW$167, DW_AT_name("pfnCallback")
    1739                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("pfnCallback")
    1740                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1741                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1742                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1743                            .dwattr $C$DW$167, DW_AT_decl_line(0x10f)
    1744                            .dwattr $C$DW$167, DW_AT_decl_column(0x16)
    1745                    
    1746                    $C$DW$168       .dwtag  DW_TAG_member
    1747                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$3)
    1748                            .dwattr $C$DW$168, DW_AT_name("pvCallbackData")
    1749                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("pvCallbackData")
    1750                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1751                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1752                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1753                            .dwattr $C$DW$168, DW_AT_decl_line(0x114)
    1754                            .dwattr $C$DW$168, DW_AT_decl_column(0x0b)
    1755                    
    1756                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1757                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    1758                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    1759                            .dwendtag $C$DW$T$36
    1760                    
    1761                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    1762                            .dwattr $C$DW$T$90, DW_AT_name("tI2CMReadModifyWrite16")
    1763                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$36)
    1764                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   34

    1765                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1766                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x116)
    1767                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    1768                    
    1769                    $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    1770                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    1771                            .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    1772                    
    1773                    
    1774                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1775                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    1776                    $C$DW$169       .dwtag  DW_TAG_member
    1777                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$34)
    1778                            .dwattr $C$DW$169, DW_AT_name("psI2CInst")
    1779                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("psI2CInst")
    1780                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1782                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1783                            .dwattr $C$DW$169, DW_AT_decl_line(0xbc)
    1784                            .dwattr $C$DW$169, DW_AT_decl_column(0x14)
    1785                    
    1786                    $C$DW$170       .dwtag  DW_TAG_member
    1787                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$35)
    1788                            .dwattr $C$DW$170, DW_AT_name("pui8Buffer")
    1789                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("pui8Buffer")
    1790                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1791                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1792                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1793                            .dwattr $C$DW$170, DW_AT_decl_line(0xc1)
    1794                            .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    1795                    
    1796                    $C$DW$171       .dwtag  DW_TAG_member
    1797                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1798                            .dwattr $C$DW$171, DW_AT_name("ui8State")
    1799                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ui8State")
    1800                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1801                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1802                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1803                            .dwattr $C$DW$171, DW_AT_decl_line(0xc6)
    1804                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    1805                    
    1806                    $C$DW$172       .dwtag  DW_TAG_member
    1807                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1808                            .dwattr $C$DW$172, DW_AT_name("ui8Addr")
    1809                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui8Addr")
    1810                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1811                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1812                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1813                            .dwattr $C$DW$172, DW_AT_decl_line(0xcb)
    1814                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    1815                    
    1816                    $C$DW$173       .dwtag  DW_TAG_member
    1817                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1818                            .dwattr $C$DW$173, DW_AT_name("ui8Mask")
    1819                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ui8Mask")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   35

    1820                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1821                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1822                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1823                            .dwattr $C$DW$173, DW_AT_decl_line(0xd0)
    1824                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    1825                    
    1826                    $C$DW$174       .dwtag  DW_TAG_member
    1827                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1828                            .dwattr $C$DW$174, DW_AT_name("ui8Value")
    1829                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui8Value")
    1830                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1831                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1832                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1833                            .dwattr $C$DW$174, DW_AT_decl_line(0xd5)
    1834                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    1835                    
    1836                    $C$DW$175       .dwtag  DW_TAG_member
    1837                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$28)
    1838                            .dwattr $C$DW$175, DW_AT_name("pfnCallback")
    1839                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("pfnCallback")
    1840                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1841                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1842                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1843                            .dwattr $C$DW$175, DW_AT_decl_line(0xdb)
    1844                            .dwattr $C$DW$175, DW_AT_decl_column(0x16)
    1845                    
    1846                    $C$DW$176       .dwtag  DW_TAG_member
    1847                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$3)
    1848                            .dwattr $C$DW$176, DW_AT_name("pvCallbackData")
    1849                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("pvCallbackData")
    1850                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1851                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1852                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1853                            .dwattr $C$DW$176, DW_AT_decl_line(0xe0)
    1854                            .dwattr $C$DW$176, DW_AT_decl_column(0x0b)
    1855                    
    1856                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1857                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xb7)
    1858                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    1859                            .dwendtag $C$DW$T$37
    1860                    
    1861                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    1862                            .dwattr $C$DW$T$50, DW_AT_name("tI2CMReadModifyWrite8")
    1863                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$37)
    1864                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1865                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1866                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe2)
    1867                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    1868                    
    1869                    
    1870                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1871                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1872                    $C$DW$177       .dwtag  DW_TAG_member
    1873                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$34)
    1874                            .dwattr $C$DW$177, DW_AT_name("psI2CInst")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   36

    1875                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("psI2CInst")
    1876                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1878                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1879                            .dwattr $C$DW$177, DW_AT_decl_line(0x123)
    1880                            .dwattr $C$DW$177, DW_AT_decl_column(0x14)
    1881                    
    1882                    $C$DW$178       .dwtag  DW_TAG_member
    1883                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$38)
    1884                            .dwattr $C$DW$178, DW_AT_name("pui8Buffer")
    1885                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("pui8Buffer")
    1886                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1887                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1888                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1889                            .dwattr $C$DW$178, DW_AT_decl_line(0x128)
    1890                            .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    1891                    
    1892                    $C$DW$179       .dwtag  DW_TAG_member
    1893                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    1894                            .dwattr $C$DW$179, DW_AT_name("ui16Count")
    1895                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("ui16Count")
    1896                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1897                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1898                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1899                            .dwattr $C$DW$179, DW_AT_decl_line(0x12d)
    1900                            .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    1901                    
    1902                    $C$DW$180       .dwtag  DW_TAG_member
    1903                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    1904                            .dwattr $C$DW$180, DW_AT_name("pui8Data")
    1905                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("pui8Data")
    1906                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1907                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1908                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1909                            .dwattr $C$DW$180, DW_AT_decl_line(0x132)
    1910                            .dwattr $C$DW$180, DW_AT_decl_column(0x14)
    1911                    
    1912                    $C$DW$181       .dwtag  DW_TAG_member
    1913                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$28)
    1914                            .dwattr $C$DW$181, DW_AT_name("pfnCallback")
    1915                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("pfnCallback")
    1916                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1917                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1918                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1919                            .dwattr $C$DW$181, DW_AT_decl_line(0x137)
    1920                            .dwattr $C$DW$181, DW_AT_decl_column(0x16)
    1921                    
    1922                    $C$DW$182       .dwtag  DW_TAG_member
    1923                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$3)
    1924                            .dwattr $C$DW$182, DW_AT_name("pvCallbackData")
    1925                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("pvCallbackData")
    1926                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1927                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1928                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1929                            .dwattr $C$DW$182, DW_AT_decl_line(0x13c)
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   37

    1930                            .dwattr $C$DW$182, DW_AT_decl_column(0x0b)
    1931                    
    1932                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1933                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x11e)
    1934                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    1935                            .dwendtag $C$DW$T$39
    1936                    
    1937                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    1938                            .dwattr $C$DW$T$49, DW_AT_name("tI2CMWrite8")
    1939                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$39)
    1940                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1941                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1942                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x13e)
    1943                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    1944                    
    1945                    
    1946                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1947                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    1948                    $C$DW$183       .dwtag  DW_TAG_member
    1949                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$34)
    1950                            .dwattr $C$DW$183, DW_AT_name("psI2CInst")
    1951                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("psI2CInst")
    1952                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1954                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1955                            .dwattr $C$DW$183, DW_AT_decl_line(0x14c)
    1956                            .dwattr $C$DW$183, DW_AT_decl_column(0x14)
    1957                    
    1958                    $C$DW$184       .dwtag  DW_TAG_member
    1959                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$23)
    1960                            .dwattr $C$DW$184, DW_AT_name("pui8Data")
    1961                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("pui8Data")
    1962                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1963                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1964                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1965                            .dwattr $C$DW$184, DW_AT_decl_line(0x151)
    1966                            .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    1967                    
    1968                    $C$DW$185       .dwtag  DW_TAG_member
    1969                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    1970                            .dwattr $C$DW$185, DW_AT_name("ui16Count")
    1971                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("ui16Count")
    1972                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1973                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1974                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1975                            .dwattr $C$DW$185, DW_AT_decl_line(0x156)
    1976                            .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    1977                    
    1978                    $C$DW$186       .dwtag  DW_TAG_member
    1979                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$28)
    1980                            .dwattr $C$DW$186, DW_AT_name("pfnCallback")
    1981                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("pfnCallback")
    1982                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1983                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1984                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   38

    1985                            .dwattr $C$DW$186, DW_AT_decl_line(0x15b)
    1986                            .dwattr $C$DW$186, DW_AT_decl_column(0x16)
    1987                    
    1988                    $C$DW$187       .dwtag  DW_TAG_member
    1989                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$3)
    1990                            .dwattr $C$DW$187, DW_AT_name("pvCallbackData")
    1991                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("pvCallbackData")
    1992                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1993                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1994                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1995                            .dwattr $C$DW$187, DW_AT_decl_line(0x160)
    1996                            .dwattr $C$DW$187, DW_AT_decl_column(0x0b)
    1997                    
    1998                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1999                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x147)
    2000                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    2001                            .dwendtag $C$DW$T$40
    2002                    
    2003                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    2004                            .dwattr $C$DW$T$92, DW_AT_name("tI2CMRead16BE")
    2005                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$40)
    2006                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2007                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2008                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x162)
    2009                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    2010                    
    2011                    
    2012                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2013                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    2014                    $C$DW$188       .dwtag  DW_TAG_member
    2015                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$34)
    2016                            .dwattr $C$DW$188, DW_AT_name("psI2CInst")
    2017                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("psI2CInst")
    2018                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2020                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2021                            .dwattr $C$DW$188, DW_AT_decl_line(0x170)
    2022                            .dwattr $C$DW$188, DW_AT_decl_column(0x14)
    2023                    
    2024                    $C$DW$189       .dwtag  DW_TAG_member
    2025                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$38)
    2026                            .dwattr $C$DW$189, DW_AT_name("pui8Buffer")
    2027                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("pui8Buffer")
    2028                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2029                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2030                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2031                            .dwattr $C$DW$189, DW_AT_decl_line(0x175)
    2032                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2033                    
    2034                    $C$DW$190       .dwtag  DW_TAG_member
    2035                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2036                            .dwattr $C$DW$190, DW_AT_name("ui16Count")
    2037                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ui16Count")
    2038                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2039                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   39

    2040                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2041                            .dwattr $C$DW$190, DW_AT_decl_line(0x17a)
    2042                            .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    2043                    
    2044                    $C$DW$191       .dwtag  DW_TAG_member
    2045                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    2046                            .dwattr $C$DW$191, DW_AT_name("pui8Data")
    2047                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("pui8Data")
    2048                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2049                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2050                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2051                            .dwattr $C$DW$191, DW_AT_decl_line(0x17f)
    2052                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2053                    
    2054                    $C$DW$192       .dwtag  DW_TAG_member
    2055                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$28)
    2056                            .dwattr $C$DW$192, DW_AT_name("pfnCallback")
    2057                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pfnCallback")
    2058                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2059                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2060                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2061                            .dwattr $C$DW$192, DW_AT_decl_line(0x184)
    2062                            .dwattr $C$DW$192, DW_AT_decl_column(0x16)
    2063                    
    2064                    $C$DW$193       .dwtag  DW_TAG_member
    2065                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$3)
    2066                            .dwattr $C$DW$193, DW_AT_name("pvCallbackData")
    2067                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("pvCallbackData")
    2068                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2069                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2070                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2071                            .dwattr $C$DW$193, DW_AT_decl_line(0x189)
    2072                            .dwattr $C$DW$193, DW_AT_decl_column(0x0b)
    2073                    
    2074                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2075                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x16b)
    2076                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2077                            .dwendtag $C$DW$T$41
    2078                    
    2079                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    2080                            .dwattr $C$DW$T$93, DW_AT_name("tI2CMWrite16BE")
    2081                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$41)
    2082                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2083                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2084                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x18b)
    2085                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2086                    
    2087                    
    2088                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2089                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x2c)
    2090                    $C$DW$194       .dwtag  DW_TAG_member
    2091                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$34)
    2092                            .dwattr $C$DW$194, DW_AT_name("psI2CInst")
    2093                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("psI2CInst")
    2094                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   40

    2095                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2096                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2097                            .dwattr $C$DW$194, DW_AT_decl_line(0x32)
    2098                            .dwattr $C$DW$194, DW_AT_decl_column(0x14)
    2099                    
    2100                    $C$DW$195       .dwtag  DW_TAG_member
    2101                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2102                            .dwattr $C$DW$195, DW_AT_name("ui8Addr")
    2103                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ui8Addr")
    2104                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2105                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2106                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2107                            .dwattr $C$DW$195, DW_AT_decl_line(0x37)
    2108                            .dwattr $C$DW$195, DW_AT_decl_column(0x0d)
    2109                    
    2110                    $C$DW$196       .dwtag  DW_TAG_member
    2111                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2112                            .dwattr $C$DW$196, DW_AT_name("ui8State")
    2113                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("ui8State")
    2114                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2115                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2116                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2117                            .dwattr $C$DW$196, DW_AT_decl_line(0x3c)
    2118                            .dwattr $C$DW$196, DW_AT_decl_column(0x0d)
    2119                    
    2120                    $C$DW$197       .dwtag  DW_TAG_member
    2121                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$42)
    2122                            .dwattr $C$DW$197, DW_AT_name("pui8Data")
    2123                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("pui8Data")
    2124                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2125                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2126                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2127                            .dwattr $C$DW$197, DW_AT_decl_line(0x41)
    2128                            .dwattr $C$DW$197, DW_AT_decl_column(0x0d)
    2129                    
    2130                    $C$DW$198       .dwtag  DW_TAG_member
    2131                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$28)
    2132                            .dwattr $C$DW$198, DW_AT_name("pfnCallback")
    2133                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("pfnCallback")
    2134                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2135                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2136                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2137                            .dwattr $C$DW$198, DW_AT_decl_line(0x47)
    2138                            .dwattr $C$DW$198, DW_AT_decl_column(0x16)
    2139                    
    2140                    $C$DW$199       .dwtag  DW_TAG_member
    2141                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$3)
    2142                            .dwattr $C$DW$199, DW_AT_name("pvCallbackData")
    2143                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("pvCallbackData")
    2144                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2145                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2146                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2147                            .dwattr $C$DW$199, DW_AT_decl_line(0x4c)
    2148                            .dwattr $C$DW$199, DW_AT_decl_column(0x0b)
    2149                    
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   41

    2150                    $C$DW$200       .dwtag  DW_TAG_member
    2151                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$51)
    2152                            .dwattr $C$DW$200, DW_AT_name("uCommand")
    2153                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("uCommand")
    2154                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2155                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2156                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2157                            .dwattr $C$DW$200, DW_AT_decl_line(0x64)
    2158                            .dwattr $C$DW$200, DW_AT_decl_column(0x05)
    2159                    
    2160                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2161                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2d)
    2162                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    2163                            .dwendtag $C$DW$T$43
    2164                    
    2165                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    2166                            .dwattr $C$DW$T$44, DW_AT_name("tAK8975")
    2167                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2168                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2169                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2170                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x66)
    2171                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2172                    
    2173                    
    2174                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2175                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x6c)
    2176                    $C$DW$201       .dwtag  DW_TAG_member
    2177                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$34)
    2178                            .dwattr $C$DW$201, DW_AT_name("psI2CInst")
    2179                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("psI2CInst")
    2180                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2181                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2182                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2183                            .dwattr $C$DW$201, DW_AT_decl_line(0x33)
    2184                            .dwattr $C$DW$201, DW_AT_decl_column(0x14)
    2185                    
    2186                    $C$DW$202       .dwtag  DW_TAG_member
    2187                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$44)
    2188                            .dwattr $C$DW$202, DW_AT_name("sAK8975Inst")
    2189                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("sAK8975Inst")
    2190                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2191                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2192                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2193                            .dwattr $C$DW$202, DW_AT_decl_line(0x38)
    2194                            .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    2195                    
    2196                    $C$DW$203       .dwtag  DW_TAG_member
    2197                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2198                            .dwattr $C$DW$203, DW_AT_name("ui8Addr")
    2199                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("ui8Addr")
    2200                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2201                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2202                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2203                            .dwattr $C$DW$203, DW_AT_decl_line(0x3d)
    2204                            .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   42

    2205                    
    2206                    $C$DW$204       .dwtag  DW_TAG_member
    2207                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2208                            .dwattr $C$DW$204, DW_AT_name("ui8State")
    2209                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("ui8State")
    2210                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2211                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2212                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2213                            .dwattr $C$DW$204, DW_AT_decl_line(0x42)
    2214                            .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2215                    
    2216                    $C$DW$205       .dwtag  DW_TAG_member
    2217                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2218                            .dwattr $C$DW$205, DW_AT_name("ui8AccelAfsSel")
    2219                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2220                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2221                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2222                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2223                            .dwattr $C$DW$205, DW_AT_decl_line(0x47)
    2224                            .dwattr $C$DW$205, DW_AT_decl_column(0x0d)
    2225                    
    2226                    $C$DW$206       .dwtag  DW_TAG_member
    2227                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2228                            .dwattr $C$DW$206, DW_AT_name("ui8NewAccelAfsSel")
    2229                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2230                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2231                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2232                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2233                            .dwattr $C$DW$206, DW_AT_decl_line(0x4d)
    2234                            .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    2235                    
    2236                    $C$DW$207       .dwtag  DW_TAG_member
    2237                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2238                            .dwattr $C$DW$207, DW_AT_name("ui8GyroFsSel")
    2239                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2240                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2241                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2242                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2243                            .dwattr $C$DW$207, DW_AT_decl_line(0x52)
    2244                            .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    2245                    
    2246                    $C$DW$208       .dwtag  DW_TAG_member
    2247                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2248                            .dwattr $C$DW$208, DW_AT_name("ui8NewGyroFsSel")
    2249                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2250                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2251                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2252                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2253                            .dwattr $C$DW$208, DW_AT_decl_line(0x58)
    2254                            .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    2255                    
    2256                    $C$DW$209       .dwtag  DW_TAG_member
    2257                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$45)
    2258                            .dwattr $C$DW$209, DW_AT_name("pui8Data")
    2259                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("pui8Data")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   43

    2260                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2261                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2262                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2263                            .dwattr $C$DW$209, DW_AT_decl_line(0x5d)
    2264                            .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    2265                    
    2266                    $C$DW$210       .dwtag  DW_TAG_member
    2267                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$28)
    2268                            .dwattr $C$DW$210, DW_AT_name("pfnCallback")
    2269                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("pfnCallback")
    2270                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2271                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2272                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2273                            .dwattr $C$DW$210, DW_AT_decl_line(0x63)
    2274                            .dwattr $C$DW$210, DW_AT_decl_column(0x16)
    2275                    
    2276                    $C$DW$211       .dwtag  DW_TAG_member
    2277                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$3)
    2278                            .dwattr $C$DW$211, DW_AT_name("pvCallbackData")
    2279                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("pvCallbackData")
    2280                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2281                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2282                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2283                            .dwattr $C$DW$211, DW_AT_decl_line(0x68)
    2284                            .dwattr $C$DW$211, DW_AT_decl_column(0x0b)
    2285                    
    2286                    $C$DW$212       .dwtag  DW_TAG_member
    2287                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$53)
    2288                            .dwattr $C$DW$212, DW_AT_name("uCommand")
    2289                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("uCommand")
    2290                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2291                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2292                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2293                            .dwattr $C$DW$212, DW_AT_decl_line(0x80)
    2294                            .dwattr $C$DW$212, DW_AT_decl_column(0x05)
    2295                    
    2296                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2297                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2e)
    2298                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    2299                            .dwendtag $C$DW$T$46
    2300                    
    2301                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    2302                            .dwattr $C$DW$T$94, DW_AT_name("tMPU9150")
    2303                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$46)
    2304                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2305                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2306                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x82)
    2307                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    2308                    
    2309                    
    2310                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2311                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x18)
    2312                    $C$DW$213       .dwtag  DW_TAG_member
    2313                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$10)
    2314                            .dwattr $C$DW$213, DW_AT_name("fd")
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   44

    2315                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("fd")
    2316                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2317                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2318                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2319                            .dwattr $C$DW$213, DW_AT_decl_line(0x5c)
    2320                            .dwattr $C$DW$213, DW_AT_decl_column(0x0b)
    2321                    
    2322                    $C$DW$214       .dwtag  DW_TAG_member
    2323                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$47)
    2324                            .dwattr $C$DW$214, DW_AT_name("buf")
    2325                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("buf")
    2326                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2327                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2328                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2329                            .dwattr $C$DW$214, DW_AT_decl_line(0x5d)
    2330                            .dwattr $C$DW$214, DW_AT_decl_column(0x16)
    2331                    
    2332                    $C$DW$215       .dwtag  DW_TAG_member
    2333                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$47)
    2334                            .dwattr $C$DW$215, DW_AT_name("pos")
    2335                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("pos")
    2336                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2337                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2338                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2339                            .dwattr $C$DW$215, DW_AT_decl_line(0x5e)
    2340                            .dwattr $C$DW$215, DW_AT_decl_column(0x16)
    2341                    
    2342                    $C$DW$216       .dwtag  DW_TAG_member
    2343                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$47)
    2344                            .dwattr $C$DW$216, DW_AT_name("bufend")
    2345                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("bufend")
    2346                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2347                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2348                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2349                            .dwattr $C$DW$216, DW_AT_decl_line(0x5f)
    2350                            .dwattr $C$DW$216, DW_AT_decl_column(0x16)
    2351                    
    2352                    $C$DW$217       .dwtag  DW_TAG_member
    2353                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$47)
    2354                            .dwattr $C$DW$217, DW_AT_name("buff_stop")
    2355                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("buff_stop")
    2356                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2357                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2358                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2359                            .dwattr $C$DW$217, DW_AT_decl_line(0x60)
    2360                            .dwattr $C$DW$217, DW_AT_decl_column(0x16)
    2361                    
    2362                    $C$DW$218       .dwtag  DW_TAG_member
    2363                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$11)
    2364                            .dwattr $C$DW$218, DW_AT_name("flags")
    2365                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("flags")
    2366                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2367                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2368                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2369                            .dwattr $C$DW$218, DW_AT_decl_line(0x61)
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   45

    2370                            .dwattr $C$DW$218, DW_AT_decl_column(0x16)
    2371                    
    2372                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2373                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x5b)
    2374                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    2375                            .dwendtag $C$DW$T$48
    2376                    
    2377                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    2378                            .dwattr $C$DW$T$95, DW_AT_name("FILE")
    2379                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$48)
    2380                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2381                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2382                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x62)
    2383                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2384                    
    2385                    
    2386                    $C$DW$T$51      .dwtag  DW_TAG_union_type
    2387                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x14)
    2388                    $C$DW$219       .dwtag  DW_TAG_member
    2389                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$38)
    2390                            .dwattr $C$DW$219, DW_AT_name("pui8Buffer")
    2391                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("pui8Buffer")
    2392                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2393                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2394                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2395                            .dwattr $C$DW$219, DW_AT_decl_line(0x58)
    2396                            .dwattr $C$DW$219, DW_AT_decl_column(0x11)
    2397                    
    2398                    $C$DW$220       .dwtag  DW_TAG_member
    2399                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$49)
    2400                            .dwattr $C$DW$220, DW_AT_name("sWriteState")
    2401                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("sWriteState")
    2402                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2405                            .dwattr $C$DW$220, DW_AT_decl_line(0x5d)
    2406                            .dwattr $C$DW$220, DW_AT_decl_column(0x15)
    2407                    
    2408                    $C$DW$221       .dwtag  DW_TAG_member
    2409                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$50)
    2410                            .dwattr $C$DW$221, DW_AT_name("sReadModifyWriteState")
    2411                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2412                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2413                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2414                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2415                            .dwattr $C$DW$221, DW_AT_decl_line(0x62)
    2416                            .dwattr $C$DW$221, DW_AT_decl_column(0x1f)
    2417                    
    2418                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2419                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x54)
    2420                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
    2421                            .dwendtag $C$DW$T$51
    2422                    
    2423                    
    2424                    $C$DW$T$53      .dwtag  DW_TAG_union_type
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   46

    2425                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    2426                    $C$DW$222       .dwtag  DW_TAG_member
    2427                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$52)
    2428                            .dwattr $C$DW$222, DW_AT_name("pui8Buffer")
    2429                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("pui8Buffer")
    2430                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2431                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2432                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2433                            .dwattr $C$DW$222, DW_AT_decl_line(0x74)
    2434                            .dwattr $C$DW$222, DW_AT_decl_column(0x11)
    2435                    
    2436                    $C$DW$223       .dwtag  DW_TAG_member
    2437                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$49)
    2438                            .dwattr $C$DW$223, DW_AT_name("sWriteState")
    2439                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("sWriteState")
    2440                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2441                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2442                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2443                            .dwattr $C$DW$223, DW_AT_decl_line(0x79)
    2444                            .dwattr $C$DW$223, DW_AT_decl_column(0x15)
    2445                    
    2446                    $C$DW$224       .dwtag  DW_TAG_member
    2447                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$50)
    2448                            .dwattr $C$DW$224, DW_AT_name("sReadModifyWriteState")
    2449                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2450                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2451                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2452                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2453                            .dwattr $C$DW$224, DW_AT_decl_line(0x7e)
    2454                            .dwattr $C$DW$224, DW_AT_decl_column(0x1f)
    2455                    
    2456                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2457                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x70)
    2458                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    2459                            .dwendtag $C$DW$T$53
    2460                    
    2461                    
    2462                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2463                            .dwattr $C$DW$T$55, DW_AT_name("HeapRegion")
    2464                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    2465                    $C$DW$225       .dwtag  DW_TAG_member
    2466                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$23)
    2467                            .dwattr $C$DW$225, DW_AT_name("pucStartAddress")
    2468                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("pucStartAddress")
    2469                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2471                            .dwattr $C$DW$225, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2472                            .dwattr $C$DW$225, DW_AT_decl_line(0x96)
    2473                            .dwattr $C$DW$225, DW_AT_decl_column(0x0b)
    2474                    
    2475                    $C$DW$226       .dwtag  DW_TAG_member
    2476                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$54)
    2477                            .dwattr $C$DW$226, DW_AT_name("xSizeInBytes")
    2478                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("xSizeInBytes")
    2479                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   47

    2480                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2481                            .dwattr $C$DW$226, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2482                            .dwattr $C$DW$226, DW_AT_decl_line(0x97)
    2483                            .dwattr $C$DW$226, DW_AT_decl_column(0x09)
    2484                    
    2485                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2486                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x94)
    2487                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    2488                            .dwendtag $C$DW$T$55
    2489                    
    2490                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2491                            .dwattr $C$DW$T$96, DW_AT_name("HeapRegion_t")
    2492                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$55)
    2493                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2494                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2495                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x98)
    2496                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    2497                    
    2498                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2499                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2500                    
    2501                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2502                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2503                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2504                    
    2505                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    2506                            .dwattr $C$DW$T$79, DW_AT_name("TaskHandle_t")
    2507                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$3)
    2508                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2509                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    2510                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x67)
    2511                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x10)
    2512                    
    2513                    $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    2514                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$79)
    2515                            .dwattr $C$DW$T$97, DW_AT_address_class(0x20)
    2516                    
    2517                    $C$DW$T$98      .dwtag  DW_TAG_const_type
    2518                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    2519                    
    2520                    $C$DW$T$99      .dwtag  DW_TAG_const_type
    2521                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$3)
    2522                    
    2523                    
    2524                    $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2525                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2526                    $C$DW$227       .dwtag  DW_TAG_formal_parameter
    2527                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$3)
    2528                    
    2529                    $C$DW$228       .dwtag  DW_TAG_formal_parameter
    2530                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$25)
    2531                    
    2532                            .dwendtag $C$DW$T$26
    2533                    
    2534                    $C$DW$T$27      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v15.12.1 Thu Oct 27 14:03:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Main_Base.asm                                                        PAGE   48

    2535                            .dwattr $C$DW$T$27, DW_AT_name("tSensorCallback")
    2536                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2537                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2538                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2539                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2c)
    2540                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0f)
    2541                    
    2542                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2543                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2544                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    2545                    
    2546                    
    2547                    $C$DW$T$67      .dwtag  DW_TAG_subroutine_type
    2548                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2549                    $C$DW$229       .dwtag  DW_TAG_formal_parameter
    2550                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$3)
    2551                    
    2552                            .dwendtag $C$DW$T$67
    2553                    
    2554                    $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    2555                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2556                            .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
    2557                    
    2558                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    2559                            .dwattr $C$DW$T$69, DW_AT_name("TaskFunction_t")
    2560                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2561                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2562                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\projdefs.h")
    2563                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x4d)
    2564                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    2565                    
    2566                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2567                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
