TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Tue Nov 01 13:44:08 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/AccelTest.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("I2CMCommand")

    1292                            .dwattr $C$DW$127, DW_AT_name("eIncrement")
    1293                            .dwattr $C$DW$127, DW_AT_const_value(0x02)
    1294                            .dwattr $C$DW$127, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1295                            .dwattr $C$DW$127, DW_AT_decl_line(0x7e)
    1296                            .dwattr $C$DW$127, DW_AT_decl_column(0x02)
    1297                    
    1298                    $C$DW$128       .dwtag  DW_TAG_enumerator
    1299                            .dwattr $C$DW$128, DW_AT_name("eSetValueWithOverwrite")
    1300                            .dwattr $C$DW$128, DW_AT_const_value(0x03)
    1301                            .dwattr $C$DW$128, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1302                            .dwattr $C$DW$128, DW_AT_decl_line(0x7f)
    1303                            .dwattr $C$DW$128, DW_AT_decl_column(0x02)
    1304                    
    1305                    $C$DW$129       .dwtag  DW_TAG_enumerator
    1306                            .dwattr $C$DW$129, DW_AT_name("eSetValueWithoutOverwrite")
    1307                            .dwattr $C$DW$129, DW_AT_const_value(0x04)
    1308                            .dwattr $C$DW$129, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1309                            .dwattr $C$DW$129, DW_AT_decl_line(0x80)
    1310                            .dwattr $C$DW$129, DW_AT_decl_column(0x02)
    1311                    
    1312                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1313                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x7b)
    1314                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    1315                            .dwendtag $C$DW$T$90
    1316                    
    1317                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    1318                            .dwattr $C$DW$T$91, DW_AT_name("eNotifyAction")
    1319                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    1320                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   25

    1321                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1322                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x81)
    1323                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    1324                    
    1325                    
    1326                    $C$DW$T$92      .dwtag  DW_TAG_enumeration_type
    1327                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x01)
    1328                    $C$DW$130       .dwtag  DW_TAG_enumerator
    1329                            .dwattr $C$DW$130, DW_AT_name("eAbortSleep")
    1330                            .dwattr $C$DW$130, DW_AT_const_value(0x00)
    1331                            .dwattr $C$DW$130, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1332                            .dwattr $C$DW$130, DW_AT_decl_line(0xb5)
    1333                            .dwattr $C$DW$130, DW_AT_decl_column(0x02)
    1334                    
    1335                    $C$DW$131       .dwtag  DW_TAG_enumerator
    1336                            .dwattr $C$DW$131, DW_AT_name("eStandardSleep")
    1337                            .dwattr $C$DW$131, DW_AT_const_value(0x01)
    1338                            .dwattr $C$DW$131, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1339                            .dwattr $C$DW$131, DW_AT_decl_line(0xb6)
    1340                            .dwattr $C$DW$131, DW_AT_decl_column(0x02)
    1341                    
    1342                    $C$DW$132       .dwtag  DW_TAG_enumerator
    1343                            .dwattr $C$DW$132, DW_AT_name("eNoTasksWaitingTimeout")
    1344                            .dwattr $C$DW$132, DW_AT_const_value(0x02)
    1345                            .dwattr $C$DW$132, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1346                            .dwattr $C$DW$132, DW_AT_decl_line(0xb7)
    1347                            .dwattr $C$DW$132, DW_AT_decl_column(0x02)
    1348                    
    1349                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1350                            .dwattr $C$DW$T$92, DW_AT_decl_line(0xb4)
    1351                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    1352                            .dwendtag $C$DW$T$92
    1353                    
    1354                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    1355                            .dwattr $C$DW$T$93, DW_AT_name("eSleepModeStatus")
    1356                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    1357                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1358                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1359                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xb8)
    1360                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    1361                    
    1362                    
    1363                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1364                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1365                    $C$DW$133       .dwtag  DW_TAG_member
    1366                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1367                            .dwattr $C$DW$133, DW_AT_name("ui8Addr")
    1368                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ui8Addr")
    1369                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1371                            .dwattr $C$DW$133, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1372                            .dwattr $C$DW$133, DW_AT_decl_line(0x4c)
    1373                            .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1374                    
    1375                    $C$DW$134       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   26

    1376                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    1377                            .dwattr $C$DW$134, DW_AT_name("pui8WriteData")
    1378                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("pui8WriteData")
    1379                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1380                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1381                            .dwattr $C$DW$134, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1382                            .dwattr $C$DW$134, DW_AT_decl_line(0x51)
    1383                            .dwattr $C$DW$134, DW_AT_decl_column(0x14)
    1384                    
    1385                    $C$DW$135       .dwtag  DW_TAG_member
    1386                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$22)
    1387                            .dwattr $C$DW$135, DW_AT_name("ui16WriteCount")
    1388                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("ui16WriteCount")
    1389                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1390                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1391                            .dwattr $C$DW$135, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1392                            .dwattr $C$DW$135, DW_AT_decl_line(0x56)
    1393                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    1394                    
    1395                    $C$DW$136       .dwtag  DW_TAG_member
    1396                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    1397                            .dwattr $C$DW$136, DW_AT_name("ui16WriteBatchSize")
    1398                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1399                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1400                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1401                            .dwattr $C$DW$136, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1402                            .dwattr $C$DW$136, DW_AT_decl_line(0x5b)
    1403                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    1404                    
    1405                    $C$DW$137       .dwtag  DW_TAG_member
    1406                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    1407                            .dwattr $C$DW$137, DW_AT_name("pui8ReadData")
    1408                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("pui8ReadData")
    1409                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1410                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1411                            .dwattr $C$DW$137, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1412                            .dwattr $C$DW$137, DW_AT_decl_line(0x60)
    1413                            .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    1414                    
    1415                    $C$DW$138       .dwtag  DW_TAG_member
    1416                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    1417                            .dwattr $C$DW$138, DW_AT_name("ui16ReadCount")
    1418                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("ui16ReadCount")
    1419                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1420                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1421                            .dwattr $C$DW$138, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1422                            .dwattr $C$DW$138, DW_AT_decl_line(0x65)
    1423                            .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    1424                    
    1425                    $C$DW$139       .dwtag  DW_TAG_member
    1426                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$22)
    1427                            .dwattr $C$DW$139, DW_AT_name("ui16ReadBatchSize")
    1428                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1429                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1430                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   27

    1431                            .dwattr $C$DW$139, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1432                            .dwattr $C$DW$139, DW_AT_decl_line(0x6a)
    1433                            .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    1434                    
    1435                    $C$DW$140       .dwtag  DW_TAG_member
    1436                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$28)
    1437                            .dwattr $C$DW$140, DW_AT_name("pfnCallback")
    1438                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("pfnCallback")
    1439                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1440                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1441                            .dwattr $C$DW$140, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1442                            .dwattr $C$DW$140, DW_AT_decl_line(0x6f)
    1443                            .dwattr $C$DW$140, DW_AT_decl_column(0x16)
    1444                    
    1445                    $C$DW$141       .dwtag  DW_TAG_member
    1446                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$3)
    1447                            .dwattr $C$DW$141, DW_AT_name("pvCallbackData")
    1448                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("pvCallbackData")
    1449                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1450                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1451                            .dwattr $C$DW$141, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1452                            .dwattr $C$DW$141, DW_AT_decl_line(0x74)
    1453                            .dwattr $C$DW$141, DW_AT_decl_column(0x0b)
    1454                    
    1455                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1456                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1457                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1458                            .dwendtag $C$DW$T$29
    1459                    
    1460                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1461                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1462                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1463                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1464                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1465                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1466                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1467                    
    1468                    
    1469                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1470                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1471                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1472                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1473                    $C$DW$142       .dwtag  DW_TAG_subrange_type
    1474                            .dwattr $C$DW$142, DW_AT_upper_bound(0x09)
    1475                    
    1476                            .dwendtag $C$DW$T$31
    1477                    
    1478                    
    1479                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1480                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1481                    $C$DW$143       .dwtag  DW_TAG_member
    1482                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$24)
    1483                            .dwattr $C$DW$143, DW_AT_name("ui32Base")
    1484                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("ui32Base")
    1485                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   28

    1486                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1487                            .dwattr $C$DW$143, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1488                            .dwattr $C$DW$143, DW_AT_decl_line(0x82)
    1489                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    1490                    
    1491                    $C$DW$144       .dwtag  DW_TAG_member
    1492                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1493                            .dwattr $C$DW$144, DW_AT_name("ui8Int")
    1494                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("ui8Int")
    1495                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1496                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1497                            .dwattr $C$DW$144, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1498                            .dwattr $C$DW$144, DW_AT_decl_line(0x87)
    1499                            .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    1500                    
    1501                    $C$DW$145       .dwtag  DW_TAG_member
    1502                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1503                            .dwattr $C$DW$145, DW_AT_name("ui8TxDMA")
    1504                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("ui8TxDMA")
    1505                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1506                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1507                            .dwattr $C$DW$145, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1508                            .dwattr $C$DW$145, DW_AT_decl_line(0x8c)
    1509                            .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    1510                    
    1511                    $C$DW$146       .dwtag  DW_TAG_member
    1512                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1513                            .dwattr $C$DW$146, DW_AT_name("ui8RxDMA")
    1514                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("ui8RxDMA")
    1515                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1516                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1517                            .dwattr $C$DW$146, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1518                            .dwattr $C$DW$146, DW_AT_decl_line(0x91)
    1519                            .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    1520                    
    1521                    $C$DW$147       .dwtag  DW_TAG_member
    1522                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1523                            .dwattr $C$DW$147, DW_AT_name("ui8State")
    1524                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("ui8State")
    1525                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1526                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1527                            .dwattr $C$DW$147, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1528                            .dwattr $C$DW$147, DW_AT_decl_line(0x96)
    1529                            .dwattr $C$DW$147, DW_AT_decl_column(0x0d)
    1530                    
    1531                    $C$DW$148       .dwtag  DW_TAG_member
    1532                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1533                            .dwattr $C$DW$148, DW_AT_name("ui8ReadPtr")
    1534                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("ui8ReadPtr")
    1535                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1536                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1537                            .dwattr $C$DW$148, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1538                            .dwattr $C$DW$148, DW_AT_decl_line(0x9c)
    1539                            .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    1540                    
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   29

    1541                    $C$DW$149       .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1543                            .dwattr $C$DW$149, DW_AT_name("ui8WritePtr")
    1544                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("ui8WritePtr")
    1545                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1546                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1547                            .dwattr $C$DW$149, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1548                            .dwattr $C$DW$149, DW_AT_decl_line(0xa2)
    1549                            .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    1550                    
    1551                    $C$DW$150       .dwtag  DW_TAG_member
    1552                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$22)
    1553                            .dwattr $C$DW$150, DW_AT_name("ui16Index")
    1554                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("ui16Index")
    1555                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1556                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1557                            .dwattr $C$DW$150, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1558                            .dwattr $C$DW$150, DW_AT_decl_line(0xa7)
    1559                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    1560                    
    1561                    $C$DW$151       .dwtag  DW_TAG_member
    1562                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
    1563                            .dwattr $C$DW$151, DW_AT_name("pCommands")
    1564                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("pCommands")
    1565                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1566                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1567                            .dwattr $C$DW$151, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1568                            .dwattr $C$DW$151, DW_AT_decl_line(0xac)
    1569                            .dwattr $C$DW$151, DW_AT_decl_column(0x12)
    1570                    
    1571                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1572                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    1573                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1574                            .dwendtag $C$DW$T$32
    1575                    
    1576                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    1577                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    1578                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1579                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1580                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1581                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    1582                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    1583                    
    1584                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1585                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1586                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1587                    
    1588                    
    1589                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1590                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    1591                    $C$DW$152       .dwtag  DW_TAG_member
    1592                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$34)
    1593                            .dwattr $C$DW$152, DW_AT_name("psI2CInst")
    1594                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("psI2CInst")
    1595                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   30

    1596                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1597                            .dwattr $C$DW$152, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1598                            .dwattr $C$DW$152, DW_AT_decl_line(0xf0)
    1599                            .dwattr $C$DW$152, DW_AT_decl_column(0x14)
    1600                    
    1601                    $C$DW$153       .dwtag  DW_TAG_member
    1602                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$35)
    1603                            .dwattr $C$DW$153, DW_AT_name("pui8Buffer")
    1604                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("pui8Buffer")
    1605                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1606                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1607                            .dwattr $C$DW$153, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1608                            .dwattr $C$DW$153, DW_AT_decl_line(0xf5)
    1609                            .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    1610                    
    1611                    $C$DW$154       .dwtag  DW_TAG_member
    1612                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1613                            .dwattr $C$DW$154, DW_AT_name("ui8State")
    1614                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("ui8State")
    1615                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1616                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1617                            .dwattr $C$DW$154, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1618                            .dwattr $C$DW$154, DW_AT_decl_line(0xfa)
    1619                            .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    1620                    
    1621                    $C$DW$155       .dwtag  DW_TAG_member
    1622                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1623                            .dwattr $C$DW$155, DW_AT_name("ui8Addr")
    1624                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("ui8Addr")
    1625                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1626                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1627                            .dwattr $C$DW$155, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1628                            .dwattr $C$DW$155, DW_AT_decl_line(0xff)
    1629                            .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    1630                    
    1631                    $C$DW$156       .dwtag  DW_TAG_member
    1632                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$22)
    1633                            .dwattr $C$DW$156, DW_AT_name("ui16Mask")
    1634                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("ui16Mask")
    1635                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1636                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1637                            .dwattr $C$DW$156, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1638                            .dwattr $C$DW$156, DW_AT_decl_line(0x104)
    1639                            .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    1640                    
    1641                    $C$DW$157       .dwtag  DW_TAG_member
    1642                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    1643                            .dwattr $C$DW$157, DW_AT_name("ui16Value")
    1644                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("ui16Value")
    1645                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1646                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1647                            .dwattr $C$DW$157, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1648                            .dwattr $C$DW$157, DW_AT_decl_line(0x109)
    1649                            .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    1650                    
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   31

    1651                    $C$DW$158       .dwtag  DW_TAG_member
    1652                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$28)
    1653                            .dwattr $C$DW$158, DW_AT_name("pfnCallback")
    1654                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("pfnCallback")
    1655                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1656                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1657                            .dwattr $C$DW$158, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1658                            .dwattr $C$DW$158, DW_AT_decl_line(0x10f)
    1659                            .dwattr $C$DW$158, DW_AT_decl_column(0x16)
    1660                    
    1661                    $C$DW$159       .dwtag  DW_TAG_member
    1662                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$3)
    1663                            .dwattr $C$DW$159, DW_AT_name("pvCallbackData")
    1664                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("pvCallbackData")
    1665                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1666                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1667                            .dwattr $C$DW$159, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1668                            .dwattr $C$DW$159, DW_AT_decl_line(0x114)
    1669                            .dwattr $C$DW$159, DW_AT_decl_column(0x0b)
    1670                    
    1671                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1672                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    1673                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    1674                            .dwendtag $C$DW$T$36
    1675                    
    1676                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    1677                            .dwattr $C$DW$T$94, DW_AT_name("tI2CMReadModifyWrite16")
    1678                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$36)
    1679                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    1680                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1681                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x116)
    1682                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    1683                    
    1684                    $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    1685                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    1686                            .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
    1687                    
    1688                    
    1689                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1690                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    1691                    $C$DW$160       .dwtag  DW_TAG_member
    1692                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$34)
    1693                            .dwattr $C$DW$160, DW_AT_name("psI2CInst")
    1694                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("psI2CInst")
    1695                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1697                            .dwattr $C$DW$160, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1698                            .dwattr $C$DW$160, DW_AT_decl_line(0x123)
    1699                            .dwattr $C$DW$160, DW_AT_decl_column(0x14)
    1700                    
    1701                    $C$DW$161       .dwtag  DW_TAG_member
    1702                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$37)
    1703                            .dwattr $C$DW$161, DW_AT_name("pui8Buffer")
    1704                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("pui8Buffer")
    1705                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   32

    1706                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1707                            .dwattr $C$DW$161, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1708                            .dwattr $C$DW$161, DW_AT_decl_line(0x128)
    1709                            .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    1710                    
    1711                    $C$DW$162       .dwtag  DW_TAG_member
    1712                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    1713                            .dwattr $C$DW$162, DW_AT_name("ui16Count")
    1714                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("ui16Count")
    1715                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1716                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1717                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1718                            .dwattr $C$DW$162, DW_AT_decl_line(0x12d)
    1719                            .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    1720                    
    1721                    $C$DW$163       .dwtag  DW_TAG_member
    1722                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    1723                            .dwattr $C$DW$163, DW_AT_name("pui8Data")
    1724                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("pui8Data")
    1725                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1726                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1727                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1728                            .dwattr $C$DW$163, DW_AT_decl_line(0x132)
    1729                            .dwattr $C$DW$163, DW_AT_decl_column(0x14)
    1730                    
    1731                    $C$DW$164       .dwtag  DW_TAG_member
    1732                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$28)
    1733                            .dwattr $C$DW$164, DW_AT_name("pfnCallback")
    1734                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("pfnCallback")
    1735                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1736                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1737                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1738                            .dwattr $C$DW$164, DW_AT_decl_line(0x137)
    1739                            .dwattr $C$DW$164, DW_AT_decl_column(0x16)
    1740                    
    1741                    $C$DW$165       .dwtag  DW_TAG_member
    1742                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$3)
    1743                            .dwattr $C$DW$165, DW_AT_name("pvCallbackData")
    1744                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("pvCallbackData")
    1745                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1746                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1747                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1748                            .dwattr $C$DW$165, DW_AT_decl_line(0x13c)
    1749                            .dwattr $C$DW$165, DW_AT_decl_column(0x0b)
    1750                    
    1751                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1752                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x11e)
    1753                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    1754                            .dwendtag $C$DW$T$38
    1755                    
    1756                    $C$DW$T$52      .dwtag  DW_TAG_typedef
    1757                            .dwattr $C$DW$T$52, DW_AT_name("tI2CMWrite8")
    1758                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$38)
    1759                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1760                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   33

    1761                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x13e)
    1762                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    1763                    
    1764                    
    1765                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1766                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1767                    $C$DW$166       .dwtag  DW_TAG_member
    1768                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$34)
    1769                            .dwattr $C$DW$166, DW_AT_name("psI2CInst")
    1770                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("psI2CInst")
    1771                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1773                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1774                            .dwattr $C$DW$166, DW_AT_decl_line(0xbc)
    1775                            .dwattr $C$DW$166, DW_AT_decl_column(0x14)
    1776                    
    1777                    $C$DW$167       .dwtag  DW_TAG_member
    1778                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$35)
    1779                            .dwattr $C$DW$167, DW_AT_name("pui8Buffer")
    1780                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("pui8Buffer")
    1781                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1782                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1783                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1784                            .dwattr $C$DW$167, DW_AT_decl_line(0xc1)
    1785                            .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    1786                    
    1787                    $C$DW$168       .dwtag  DW_TAG_member
    1788                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1789                            .dwattr $C$DW$168, DW_AT_name("ui8State")
    1790                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("ui8State")
    1791                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1792                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1793                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1794                            .dwattr $C$DW$168, DW_AT_decl_line(0xc6)
    1795                            .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    1796                    
    1797                    $C$DW$169       .dwtag  DW_TAG_member
    1798                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1799                            .dwattr $C$DW$169, DW_AT_name("ui8Addr")
    1800                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("ui8Addr")
    1801                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1802                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1803                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1804                            .dwattr $C$DW$169, DW_AT_decl_line(0xcb)
    1805                            .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    1806                    
    1807                    $C$DW$170       .dwtag  DW_TAG_member
    1808                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1809                            .dwattr $C$DW$170, DW_AT_name("ui8Mask")
    1810                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("ui8Mask")
    1811                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1812                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1813                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1814                            .dwattr $C$DW$170, DW_AT_decl_line(0xd0)
    1815                            .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   34

    1816                    
    1817                    $C$DW$171       .dwtag  DW_TAG_member
    1818                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1819                            .dwattr $C$DW$171, DW_AT_name("ui8Value")
    1820                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ui8Value")
    1821                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1822                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1823                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1824                            .dwattr $C$DW$171, DW_AT_decl_line(0xd5)
    1825                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    1826                    
    1827                    $C$DW$172       .dwtag  DW_TAG_member
    1828                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$28)
    1829                            .dwattr $C$DW$172, DW_AT_name("pfnCallback")
    1830                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("pfnCallback")
    1831                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1832                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1833                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1834                            .dwattr $C$DW$172, DW_AT_decl_line(0xdb)
    1835                            .dwattr $C$DW$172, DW_AT_decl_column(0x16)
    1836                    
    1837                    $C$DW$173       .dwtag  DW_TAG_member
    1838                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$3)
    1839                            .dwattr $C$DW$173, DW_AT_name("pvCallbackData")
    1840                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("pvCallbackData")
    1841                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1842                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1843                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1844                            .dwattr $C$DW$173, DW_AT_decl_line(0xe0)
    1845                            .dwattr $C$DW$173, DW_AT_decl_column(0x0b)
    1846                    
    1847                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1848                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xb7)
    1849                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    1850                            .dwendtag $C$DW$T$39
    1851                    
    1852                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    1853                            .dwattr $C$DW$T$53, DW_AT_name("tI2CMReadModifyWrite8")
    1854                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$39)
    1855                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1856                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1857                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xe2)
    1858                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    1859                    
    1860                    
    1861                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1862                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x2c)
    1863                    $C$DW$174       .dwtag  DW_TAG_member
    1864                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$34)
    1865                            .dwattr $C$DW$174, DW_AT_name("psI2CInst")
    1866                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("psI2CInst")
    1867                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1869                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1870                            .dwattr $C$DW$174, DW_AT_decl_line(0x32)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   35

    1871                            .dwattr $C$DW$174, DW_AT_decl_column(0x14)
    1872                    
    1873                    $C$DW$175       .dwtag  DW_TAG_member
    1874                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1875                            .dwattr $C$DW$175, DW_AT_name("ui8Addr")
    1876                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ui8Addr")
    1877                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1878                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1879                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1880                            .dwattr $C$DW$175, DW_AT_decl_line(0x37)
    1881                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    1882                    
    1883                    $C$DW$176       .dwtag  DW_TAG_member
    1884                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1885                            .dwattr $C$DW$176, DW_AT_name("ui8State")
    1886                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("ui8State")
    1887                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1888                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1889                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1890                            .dwattr $C$DW$176, DW_AT_decl_line(0x3c)
    1891                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    1892                    
    1893                    $C$DW$177       .dwtag  DW_TAG_member
    1894                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$40)
    1895                            .dwattr $C$DW$177, DW_AT_name("pui8Data")
    1896                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("pui8Data")
    1897                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1898                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1899                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1900                            .dwattr $C$DW$177, DW_AT_decl_line(0x41)
    1901                            .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    1902                    
    1903                    $C$DW$178       .dwtag  DW_TAG_member
    1904                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$28)
    1905                            .dwattr $C$DW$178, DW_AT_name("pfnCallback")
    1906                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("pfnCallback")
    1907                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1908                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1909                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1910                            .dwattr $C$DW$178, DW_AT_decl_line(0x47)
    1911                            .dwattr $C$DW$178, DW_AT_decl_column(0x16)
    1912                    
    1913                    $C$DW$179       .dwtag  DW_TAG_member
    1914                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$3)
    1915                            .dwattr $C$DW$179, DW_AT_name("pvCallbackData")
    1916                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("pvCallbackData")
    1917                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1918                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1919                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1920                            .dwattr $C$DW$179, DW_AT_decl_line(0x4c)
    1921                            .dwattr $C$DW$179, DW_AT_decl_column(0x0b)
    1922                    
    1923                    $C$DW$180       .dwtag  DW_TAG_member
    1924                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$54)
    1925                            .dwattr $C$DW$180, DW_AT_name("uCommand")
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   36

    1926                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("uCommand")
    1927                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1928                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1929                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1930                            .dwattr $C$DW$180, DW_AT_decl_line(0x64)
    1931                            .dwattr $C$DW$180, DW_AT_decl_column(0x05)
    1932                    
    1933                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1934                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2d)
    1935                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    1936                            .dwendtag $C$DW$T$41
    1937                    
    1938                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    1939                            .dwattr $C$DW$T$42, DW_AT_name("tAK8975")
    1940                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1941                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1942                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    1943                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x66)
    1944                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    1945                    
    1946                    
    1947                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1948                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x6c)
    1949                    $C$DW$181       .dwtag  DW_TAG_member
    1950                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$34)
    1951                            .dwattr $C$DW$181, DW_AT_name("psI2CInst")
    1952                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("psI2CInst")
    1953                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1955                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    1956                            .dwattr $C$DW$181, DW_AT_decl_line(0x33)
    1957                            .dwattr $C$DW$181, DW_AT_decl_column(0x14)
    1958                    
    1959                    $C$DW$182       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$42)
    1961                            .dwattr $C$DW$182, DW_AT_name("sAK8975Inst")
    1962                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("sAK8975Inst")
    1963                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1964                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1965                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    1966                            .dwattr $C$DW$182, DW_AT_decl_line(0x38)
    1967                            .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    1968                    
    1969                    $C$DW$183       .dwtag  DW_TAG_member
    1970                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1971                            .dwattr $C$DW$183, DW_AT_name("ui8Addr")
    1972                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui8Addr")
    1973                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1974                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1975                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    1976                            .dwattr $C$DW$183, DW_AT_decl_line(0x3d)
    1977                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    1978                    
    1979                    $C$DW$184       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   37

    1981                            .dwattr $C$DW$184, DW_AT_name("ui8State")
    1982                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ui8State")
    1983                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1984                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1985                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    1986                            .dwattr $C$DW$184, DW_AT_decl_line(0x42)
    1987                            .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    1988                    
    1989                    $C$DW$185       .dwtag  DW_TAG_member
    1990                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1991                            .dwattr $C$DW$185, DW_AT_name("ui8AccelAfsSel")
    1992                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    1993                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1994                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    1996                            .dwattr $C$DW$185, DW_AT_decl_line(0x47)
    1997                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    1998                    
    1999                    $C$DW$186       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2001                            .dwattr $C$DW$186, DW_AT_name("ui8NewAccelAfsSel")
    2002                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2003                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2004                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2005                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2006                            .dwattr $C$DW$186, DW_AT_decl_line(0x4d)
    2007                            .dwattr $C$DW$186, DW_AT_decl_column(0x0d)
    2008                    
    2009                    $C$DW$187       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2011                            .dwattr $C$DW$187, DW_AT_name("ui8GyroFsSel")
    2012                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2013                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2014                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2016                            .dwattr $C$DW$187, DW_AT_decl_line(0x52)
    2017                            .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    2018                    
    2019                    $C$DW$188       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2021                            .dwattr $C$DW$188, DW_AT_name("ui8NewGyroFsSel")
    2022                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2023                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2024                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2025                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2026                            .dwattr $C$DW$188, DW_AT_decl_line(0x58)
    2027                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    2028                    
    2029                    $C$DW$189       .dwtag  DW_TAG_member
    2030                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$43)
    2031                            .dwattr $C$DW$189, DW_AT_name("pui8Data")
    2032                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("pui8Data")
    2033                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2034                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2035                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   38

    2036                            .dwattr $C$DW$189, DW_AT_decl_line(0x5d)
    2037                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2038                    
    2039                    $C$DW$190       .dwtag  DW_TAG_member
    2040                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$28)
    2041                            .dwattr $C$DW$190, DW_AT_name("pfnCallback")
    2042                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("pfnCallback")
    2043                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2044                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2045                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2046                            .dwattr $C$DW$190, DW_AT_decl_line(0x63)
    2047                            .dwattr $C$DW$190, DW_AT_decl_column(0x16)
    2048                    
    2049                    $C$DW$191       .dwtag  DW_TAG_member
    2050                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$3)
    2051                            .dwattr $C$DW$191, DW_AT_name("pvCallbackData")
    2052                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("pvCallbackData")
    2053                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2054                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2055                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2056                            .dwattr $C$DW$191, DW_AT_decl_line(0x68)
    2057                            .dwattr $C$DW$191, DW_AT_decl_column(0x0b)
    2058                    
    2059                    $C$DW$192       .dwtag  DW_TAG_member
    2060                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$56)
    2061                            .dwattr $C$DW$192, DW_AT_name("uCommand")
    2062                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("uCommand")
    2063                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2064                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2065                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2066                            .dwattr $C$DW$192, DW_AT_decl_line(0x80)
    2067                            .dwattr $C$DW$192, DW_AT_decl_column(0x05)
    2068                    
    2069                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2070                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
    2071                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2072                            .dwendtag $C$DW$T$44
    2073                    
    2074                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2075                            .dwattr $C$DW$T$96, DW_AT_name("tMPU9150")
    2076                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$44)
    2077                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2078                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2079                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x82)
    2080                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    2081                    
    2082                    
    2083                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2084                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
    2085                    $C$DW$193       .dwtag  DW_TAG_member
    2086                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$34)
    2087                            .dwattr $C$DW$193, DW_AT_name("psI2CInst")
    2088                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("psI2CInst")
    2089                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   39

    2091                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2092                            .dwattr $C$DW$193, DW_AT_decl_line(0x14c)
    2093                            .dwattr $C$DW$193, DW_AT_decl_column(0x14)
    2094                    
    2095                    $C$DW$194       .dwtag  DW_TAG_member
    2096                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$23)
    2097                            .dwattr $C$DW$194, DW_AT_name("pui8Data")
    2098                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("pui8Data")
    2099                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2100                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2102                            .dwattr $C$DW$194, DW_AT_decl_line(0x151)
    2103                            .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    2104                    
    2105                    $C$DW$195       .dwtag  DW_TAG_member
    2106                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2107                            .dwattr $C$DW$195, DW_AT_name("ui16Count")
    2108                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ui16Count")
    2109                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2110                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2111                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2112                            .dwattr $C$DW$195, DW_AT_decl_line(0x156)
    2113                            .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    2114                    
    2115                    $C$DW$196       .dwtag  DW_TAG_member
    2116                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$28)
    2117                            .dwattr $C$DW$196, DW_AT_name("pfnCallback")
    2118                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("pfnCallback")
    2119                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2120                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2121                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2122                            .dwattr $C$DW$196, DW_AT_decl_line(0x15b)
    2123                            .dwattr $C$DW$196, DW_AT_decl_column(0x16)
    2124                    
    2125                    $C$DW$197       .dwtag  DW_TAG_member
    2126                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$3)
    2127                            .dwattr $C$DW$197, DW_AT_name("pvCallbackData")
    2128                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("pvCallbackData")
    2129                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2130                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2131                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2132                            .dwattr $C$DW$197, DW_AT_decl_line(0x160)
    2133                            .dwattr $C$DW$197, DW_AT_decl_column(0x0b)
    2134                    
    2135                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2136                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x147)
    2137                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    2138                            .dwendtag $C$DW$T$45
    2139                    
    2140                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    2141                            .dwattr $C$DW$T$97, DW_AT_name("tI2CMRead16BE")
    2142                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$45)
    2143                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2144                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2145                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x162)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   40

    2146                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    2147                    
    2148                    
    2149                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2150                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
    2151                    $C$DW$198       .dwtag  DW_TAG_member
    2152                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$34)
    2153                            .dwattr $C$DW$198, DW_AT_name("psI2CInst")
    2154                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("psI2CInst")
    2155                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2157                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2158                            .dwattr $C$DW$198, DW_AT_decl_line(0x170)
    2159                            .dwattr $C$DW$198, DW_AT_decl_column(0x14)
    2160                    
    2161                    $C$DW$199       .dwtag  DW_TAG_member
    2162                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$37)
    2163                            .dwattr $C$DW$199, DW_AT_name("pui8Buffer")
    2164                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("pui8Buffer")
    2165                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2166                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2167                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2168                            .dwattr $C$DW$199, DW_AT_decl_line(0x175)
    2169                            .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    2170                    
    2171                    $C$DW$200       .dwtag  DW_TAG_member
    2172                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    2173                            .dwattr $C$DW$200, DW_AT_name("ui16Count")
    2174                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("ui16Count")
    2175                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2176                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2177                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2178                            .dwattr $C$DW$200, DW_AT_decl_line(0x17a)
    2179                            .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    2180                    
    2181                    $C$DW$201       .dwtag  DW_TAG_member
    2182                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    2183                            .dwattr $C$DW$201, DW_AT_name("pui8Data")
    2184                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("pui8Data")
    2185                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2186                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2187                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2188                            .dwattr $C$DW$201, DW_AT_decl_line(0x17f)
    2189                            .dwattr $C$DW$201, DW_AT_decl_column(0x14)
    2190                    
    2191                    $C$DW$202       .dwtag  DW_TAG_member
    2192                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$28)
    2193                            .dwattr $C$DW$202, DW_AT_name("pfnCallback")
    2194                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("pfnCallback")
    2195                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2196                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2197                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2198                            .dwattr $C$DW$202, DW_AT_decl_line(0x184)
    2199                            .dwattr $C$DW$202, DW_AT_decl_column(0x16)
    2200                    
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   41

    2201                    $C$DW$203       .dwtag  DW_TAG_member
    2202                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$3)
    2203                            .dwattr $C$DW$203, DW_AT_name("pvCallbackData")
    2204                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("pvCallbackData")
    2205                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2206                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2207                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2208                            .dwattr $C$DW$203, DW_AT_decl_line(0x189)
    2209                            .dwattr $C$DW$203, DW_AT_decl_column(0x0b)
    2210                    
    2211                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2212                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x16b)
    2213                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    2214                            .dwendtag $C$DW$T$46
    2215                    
    2216                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2217                            .dwattr $C$DW$T$98, DW_AT_name("tI2CMWrite16BE")
    2218                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$46)
    2219                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2220                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2221                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x18b)
    2222                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x01)
    2223                    
    2224                    
    2225                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2226                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x58)
    2227                    $C$DW$204       .dwtag  DW_TAG_member
    2228                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$48)
    2229                            .dwattr $C$DW$204, DW_AT_name("ppfDCM")
    2230                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("ppfDCM")
    2231                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2232                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2233                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2234                            .dwattr $C$DW$204, DW_AT_decl_line(0x33)
    2235                            .dwattr $C$DW$204, DW_AT_decl_column(0x0b)
    2236                    
    2237                    $C$DW$205       .dwtag  DW_TAG_member
    2238                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$16)
    2239                            .dwattr $C$DW$205, DW_AT_name("fDeltaT")
    2240                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("fDeltaT")
    2241                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2242                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2243                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2244                            .dwattr $C$DW$205, DW_AT_decl_line(0x38)
    2245                            .dwattr $C$DW$205, DW_AT_decl_column(0x0b)
    2246                    
    2247                    $C$DW$206       .dwtag  DW_TAG_member
    2248                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$16)
    2249                            .dwattr $C$DW$206, DW_AT_name("fScaleA")
    2250                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("fScaleA")
    2251                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2252                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2253                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2254                            .dwattr $C$DW$206, DW_AT_decl_line(0x3e)
    2255                            .dwattr $C$DW$206, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   42

    2256                    
    2257                    $C$DW$207       .dwtag  DW_TAG_member
    2258                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$16)
    2259                            .dwattr $C$DW$207, DW_AT_name("fScaleG")
    2260                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("fScaleG")
    2261                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2262                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2263                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2264                            .dwattr $C$DW$207, DW_AT_decl_line(0x43)
    2265                            .dwattr $C$DW$207, DW_AT_decl_column(0x0b)
    2266                    
    2267                    $C$DW$208       .dwtag  DW_TAG_member
    2268                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$16)
    2269                            .dwattr $C$DW$208, DW_AT_name("fScaleM")
    2270                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("fScaleM")
    2271                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2272                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2273                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2274                            .dwattr $C$DW$208, DW_AT_decl_line(0x48)
    2275                            .dwattr $C$DW$208, DW_AT_decl_column(0x0b)
    2276                    
    2277                    $C$DW$209       .dwtag  DW_TAG_member
    2278                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$47)
    2279                            .dwattr $C$DW$209, DW_AT_name("pfAccel")
    2280                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("pfAccel")
    2281                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2282                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2283                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2284                            .dwattr $C$DW$209, DW_AT_decl_line(0x4d)
    2285                            .dwattr $C$DW$209, DW_AT_decl_column(0x0b)
    2286                    
    2287                    $C$DW$210       .dwtag  DW_TAG_member
    2288                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$47)
    2289                            .dwattr $C$DW$210, DW_AT_name("pfGyro")
    2290                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("pfGyro")
    2291                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2292                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2293                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2294                            .dwattr $C$DW$210, DW_AT_decl_line(0x52)
    2295                            .dwattr $C$DW$210, DW_AT_decl_column(0x0b)
    2296                    
    2297                    $C$DW$211       .dwtag  DW_TAG_member
    2298                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$47)
    2299                            .dwattr $C$DW$211, DW_AT_name("pfMagneto")
    2300                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("pfMagneto")
    2301                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2302                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2303                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2304                            .dwattr $C$DW$211, DW_AT_decl_line(0x57)
    2305                            .dwattr $C$DW$211, DW_AT_decl_column(0x0b)
    2306                    
    2307                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2308                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    2309                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    2310                            .dwendtag $C$DW$T$49
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   43

    2311                    
    2312                    $C$DW$T$99      .dwtag  DW_TAG_typedef
    2313                            .dwattr $C$DW$T$99, DW_AT_name("tCompDCM")
    2314                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$49)
    2315                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    2316                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2317                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x59)
    2318                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x01)
    2319                    
    2320                    
    2321                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    2322                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x18)
    2323                    $C$DW$212       .dwtag  DW_TAG_member
    2324                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$10)
    2325                            .dwattr $C$DW$212, DW_AT_name("fd")
    2326                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("fd")
    2327                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2328                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2329                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2330                            .dwattr $C$DW$212, DW_AT_decl_line(0x5c)
    2331                            .dwattr $C$DW$212, DW_AT_decl_column(0x0b)
    2332                    
    2333                    $C$DW$213       .dwtag  DW_TAG_member
    2334                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$50)
    2335                            .dwattr $C$DW$213, DW_AT_name("buf")
    2336                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("buf")
    2337                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2338                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2339                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2340                            .dwattr $C$DW$213, DW_AT_decl_line(0x5d)
    2341                            .dwattr $C$DW$213, DW_AT_decl_column(0x16)
    2342                    
    2343                    $C$DW$214       .dwtag  DW_TAG_member
    2344                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$50)
    2345                            .dwattr $C$DW$214, DW_AT_name("pos")
    2346                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("pos")
    2347                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2348                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2349                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2350                            .dwattr $C$DW$214, DW_AT_decl_line(0x5e)
    2351                            .dwattr $C$DW$214, DW_AT_decl_column(0x16)
    2352                    
    2353                    $C$DW$215       .dwtag  DW_TAG_member
    2354                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$50)
    2355                            .dwattr $C$DW$215, DW_AT_name("bufend")
    2356                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("bufend")
    2357                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2358                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2359                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2360                            .dwattr $C$DW$215, DW_AT_decl_line(0x5f)
    2361                            .dwattr $C$DW$215, DW_AT_decl_column(0x16)
    2362                    
    2363                    $C$DW$216       .dwtag  DW_TAG_member
    2364                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$50)
    2365                            .dwattr $C$DW$216, DW_AT_name("buff_stop")
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   44

    2366                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("buff_stop")
    2367                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2368                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2369                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2370                            .dwattr $C$DW$216, DW_AT_decl_line(0x60)
    2371                            .dwattr $C$DW$216, DW_AT_decl_column(0x16)
    2372                    
    2373                    $C$DW$217       .dwtag  DW_TAG_member
    2374                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$11)
    2375                            .dwattr $C$DW$217, DW_AT_name("flags")
    2376                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("flags")
    2377                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2378                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2379                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2380                            .dwattr $C$DW$217, DW_AT_decl_line(0x61)
    2381                            .dwattr $C$DW$217, DW_AT_decl_column(0x16)
    2382                    
    2383                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2384                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x5b)
    2385                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    2386                            .dwendtag $C$DW$T$51
    2387                    
    2388                    $C$DW$T$100     .dwtag  DW_TAG_typedef
    2389                            .dwattr $C$DW$T$100, DW_AT_name("FILE")
    2390                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$51)
    2391                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    2392                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2393                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x62)
    2394                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    2395                    
    2396                    
    2397                    $C$DW$T$54      .dwtag  DW_TAG_union_type
    2398                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x14)
    2399                    $C$DW$218       .dwtag  DW_TAG_member
    2400                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$37)
    2401                            .dwattr $C$DW$218, DW_AT_name("pui8Buffer")
    2402                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("pui8Buffer")
    2403                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2404                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2405                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2406                            .dwattr $C$DW$218, DW_AT_decl_line(0x58)
    2407                            .dwattr $C$DW$218, DW_AT_decl_column(0x11)
    2408                    
    2409                    $C$DW$219       .dwtag  DW_TAG_member
    2410                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$52)
    2411                            .dwattr $C$DW$219, DW_AT_name("sWriteState")
    2412                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("sWriteState")
    2413                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2414                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2415                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2416                            .dwattr $C$DW$219, DW_AT_decl_line(0x5d)
    2417                            .dwattr $C$DW$219, DW_AT_decl_column(0x15)
    2418                    
    2419                    $C$DW$220       .dwtag  DW_TAG_member
    2420                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$53)
TI ARM Assembler PC v15.12.1 Tue Nov 01 13:44:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AccelTest.asm                                                        PAGE   45

    2421                            .dwattr $C$DW$220, DW_AT_name("sReadModifyWriteState")
    2422                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2423                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2424                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2425                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2426                            .dwattr $C$DW$220, DW_AT_decl_line(0x62)
    2427                            .dwattr $C$DW$220, DW_AT_decl_column(0x1f)
    2428                    
    2429                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2430                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x54)
    2431                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x05)
    2432                            .dwendtag $C$DW$T$54
    2433                    
    2434                    
    2435                    $C$DW$T$56      .dwtag  DW_TAG_union_type
    2436                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x14)
    2437                    $C$DW$221       .dwtag  DW_TAG_member
    2438                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$55)
    2439                            .dwattr $C$DW$221, DW_AT_name("pui8Buffer")
    2440                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("pui8Buffer")
    2441                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2443                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2444                            .dwattr $C$DW$221, DW_AT_decl_line(0x74)
    2445                            .dwattr $C$DW$221, DW_AT_decl_column(0x11)
    2446                    
    2447                    $C$DW$222       .dwtag  DW_TAG_member
    2448                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$52)
    2449                            .dwattr $C$DW$222, DW_AT_name("sWriteState")
    2450                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("sWriteState")
    2451                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2453                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2454                            .dwattr $C$DW$222, DW_AT_decl_line(0x79)
    2455                            .dwattr $C$DW$222, DW_AT_decl_column(0x15)
    2456                    
    2457                    $C$DW$223       .dwtag  DW_TAG_member
    2458                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$53)
    2459                            .dwattr $C$DW$223, DW_AT_name("sReadModifyWriteState")
    2460                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2461                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2462                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2463                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2464                            .dwattr $C$DW$223, DW_AT_decl_line(0x7e)
    2465                            .dwattr $C$DW$223, DW_AT_decl_column(0x1f)
    2466                    
    2467                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2468                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x70)
    2469                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x05)
    2470                            .dwendtag $C$DW$T$56
