TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Thu Nov 03 13:01:19 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/MPU9150AccelerometerManager_Task.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1756                            .dwattr $C$DW$163, DW_AT_name("eIncrement")
    1757                            .dwattr $C$DW$163, DW_AT_const_value(0x02)
    1758                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1759                            .dwattr $C$DW$163, DW_AT_decl_line(0x7e)
    1760                            .dwattr $C$DW$163, DW_AT_decl_column(0x02)
    1761                    
    1762                    $C$DW$164       .dwtag  DW_TAG_enumerator
    1763                            .dwattr $C$DW$164, DW_AT_name("eSetValueWithOverwrite")
    1764                            .dwattr $C$DW$164, DW_AT_const_value(0x03)
    1765                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1766                            .dwattr $C$DW$164, DW_AT_decl_line(0x7f)
    1767                            .dwattr $C$DW$164, DW_AT_decl_column(0x02)
    1768                    
    1769                    $C$DW$165       .dwtag  DW_TAG_enumerator
    1770                            .dwattr $C$DW$165, DW_AT_name("eSetValueWithoutOverwrite")
    1771                            .dwattr $C$DW$165, DW_AT_const_value(0x04)
    1772                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1773                            .dwattr $C$DW$165, DW_AT_decl_line(0x80)
    1774                            .dwattr $C$DW$165, DW_AT_decl_column(0x02)
    1775                    
    1776                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1777                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x7b)
    1778                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    1779                            .dwendtag $C$DW$T$90
    1780                    
    1781                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    1782                            .dwattr $C$DW$T$91, DW_AT_name("eNotifyAction")
    1783                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    1784                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1785                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   35

    1786                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x81)
    1787                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    1788                    
    1789                    
    1790                    $C$DW$T$92      .dwtag  DW_TAG_enumeration_type
    1791                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x01)
    1792                    $C$DW$166       .dwtag  DW_TAG_enumerator
    1793                            .dwattr $C$DW$166, DW_AT_name("eAbortSleep")
    1794                            .dwattr $C$DW$166, DW_AT_const_value(0x00)
    1795                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1796                            .dwattr $C$DW$166, DW_AT_decl_line(0xb5)
    1797                            .dwattr $C$DW$166, DW_AT_decl_column(0x02)
    1798                    
    1799                    $C$DW$167       .dwtag  DW_TAG_enumerator
    1800                            .dwattr $C$DW$167, DW_AT_name("eStandardSleep")
    1801                            .dwattr $C$DW$167, DW_AT_const_value(0x01)
    1802                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1803                            .dwattr $C$DW$167, DW_AT_decl_line(0xb6)
    1804                            .dwattr $C$DW$167, DW_AT_decl_column(0x02)
    1805                    
    1806                    $C$DW$168       .dwtag  DW_TAG_enumerator
    1807                            .dwattr $C$DW$168, DW_AT_name("eNoTasksWaitingTimeout")
    1808                            .dwattr $C$DW$168, DW_AT_const_value(0x02)
    1809                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1810                            .dwattr $C$DW$168, DW_AT_decl_line(0xb7)
    1811                            .dwattr $C$DW$168, DW_AT_decl_column(0x02)
    1812                    
    1813                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1814                            .dwattr $C$DW$T$92, DW_AT_decl_line(0xb4)
    1815                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    1816                            .dwendtag $C$DW$T$92
    1817                    
    1818                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    1819                            .dwattr $C$DW$T$93, DW_AT_name("eSleepModeStatus")
    1820                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    1821                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1822                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1823                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xb8)
    1824                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    1825                    
    1826                    
    1827                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1828                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1829                    $C$DW$169       .dwtag  DW_TAG_member
    1830                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1831                            .dwattr $C$DW$169, DW_AT_name("ui8Addr")
    1832                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("ui8Addr")
    1833                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1835                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1836                            .dwattr $C$DW$169, DW_AT_decl_line(0x4c)
    1837                            .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    1838                    
    1839                    $C$DW$170       .dwtag  DW_TAG_member
    1840                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   36

    1841                            .dwattr $C$DW$170, DW_AT_name("pui8WriteData")
    1842                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("pui8WriteData")
    1843                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1844                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1845                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1846                            .dwattr $C$DW$170, DW_AT_decl_line(0x51)
    1847                            .dwattr $C$DW$170, DW_AT_decl_column(0x14)
    1848                    
    1849                    $C$DW$171       .dwtag  DW_TAG_member
    1850                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    1851                            .dwattr $C$DW$171, DW_AT_name("ui16WriteCount")
    1852                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ui16WriteCount")
    1853                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1854                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1855                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1856                            .dwattr $C$DW$171, DW_AT_decl_line(0x56)
    1857                            .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    1858                    
    1859                    $C$DW$172       .dwtag  DW_TAG_member
    1860                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    1861                            .dwattr $C$DW$172, DW_AT_name("ui16WriteBatchSize")
    1862                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1863                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1864                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1865                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1866                            .dwattr $C$DW$172, DW_AT_decl_line(0x5b)
    1867                            .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    1868                    
    1869                    $C$DW$173       .dwtag  DW_TAG_member
    1870                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
    1871                            .dwattr $C$DW$173, DW_AT_name("pui8ReadData")
    1872                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("pui8ReadData")
    1873                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1874                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1875                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1876                            .dwattr $C$DW$173, DW_AT_decl_line(0x60)
    1877                            .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    1878                    
    1879                    $C$DW$174       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    1881                            .dwattr $C$DW$174, DW_AT_name("ui16ReadCount")
    1882                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui16ReadCount")
    1883                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1884                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1886                            .dwattr $C$DW$174, DW_AT_decl_line(0x65)
    1887                            .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    1888                    
    1889                    $C$DW$175       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    1891                            .dwattr $C$DW$175, DW_AT_name("ui16ReadBatchSize")
    1892                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1893                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1894                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1895                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   37

    1896                            .dwattr $C$DW$175, DW_AT_decl_line(0x6a)
    1897                            .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    1898                    
    1899                    $C$DW$176       .dwtag  DW_TAG_member
    1900                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$28)
    1901                            .dwattr $C$DW$176, DW_AT_name("pfnCallback")
    1902                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("pfnCallback")
    1903                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1904                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1905                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1906                            .dwattr $C$DW$176, DW_AT_decl_line(0x6f)
    1907                            .dwattr $C$DW$176, DW_AT_decl_column(0x16)
    1908                    
    1909                    $C$DW$177       .dwtag  DW_TAG_member
    1910                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$3)
    1911                            .dwattr $C$DW$177, DW_AT_name("pvCallbackData")
    1912                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("pvCallbackData")
    1913                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1914                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1915                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1916                            .dwattr $C$DW$177, DW_AT_decl_line(0x74)
    1917                            .dwattr $C$DW$177, DW_AT_decl_column(0x0b)
    1918                    
    1919                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1920                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1921                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1922                            .dwendtag $C$DW$T$29
    1923                    
    1924                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1925                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1926                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1927                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1928                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1929                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1930                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1931                    
    1932                    
    1933                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1934                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1935                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1936                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1937                    $C$DW$178       .dwtag  DW_TAG_subrange_type
    1938                            .dwattr $C$DW$178, DW_AT_upper_bound(0x09)
    1939                    
    1940                            .dwendtag $C$DW$T$31
    1941                    
    1942                    
    1943                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1944                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1945                    $C$DW$179       .dwtag  DW_TAG_member
    1946                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$24)
    1947                            .dwattr $C$DW$179, DW_AT_name("ui32Base")
    1948                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("ui32Base")
    1949                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   38

    1951                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1952                            .dwattr $C$DW$179, DW_AT_decl_line(0x82)
    1953                            .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    1954                    
    1955                    $C$DW$180       .dwtag  DW_TAG_member
    1956                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1957                            .dwattr $C$DW$180, DW_AT_name("ui8Int")
    1958                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("ui8Int")
    1959                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1960                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1961                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1962                            .dwattr $C$DW$180, DW_AT_decl_line(0x87)
    1963                            .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    1964                    
    1965                    $C$DW$181       .dwtag  DW_TAG_member
    1966                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1967                            .dwattr $C$DW$181, DW_AT_name("ui8TxDMA")
    1968                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ui8TxDMA")
    1969                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1970                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1971                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1972                            .dwattr $C$DW$181, DW_AT_decl_line(0x8c)
    1973                            .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    1974                    
    1975                    $C$DW$182       .dwtag  DW_TAG_member
    1976                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1977                            .dwattr $C$DW$182, DW_AT_name("ui8RxDMA")
    1978                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui8RxDMA")
    1979                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1980                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1981                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1982                            .dwattr $C$DW$182, DW_AT_decl_line(0x91)
    1983                            .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    1984                    
    1985                    $C$DW$183       .dwtag  DW_TAG_member
    1986                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1987                            .dwattr $C$DW$183, DW_AT_name("ui8State")
    1988                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui8State")
    1989                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1990                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1991                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1992                            .dwattr $C$DW$183, DW_AT_decl_line(0x96)
    1993                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    1994                    
    1995                    $C$DW$184       .dwtag  DW_TAG_member
    1996                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1997                            .dwattr $C$DW$184, DW_AT_name("ui8ReadPtr")
    1998                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ui8ReadPtr")
    1999                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2000                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2001                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2002                            .dwattr $C$DW$184, DW_AT_decl_line(0x9c)
    2003                            .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    2004                    
    2005                    $C$DW$185       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   39

    2006                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2007                            .dwattr $C$DW$185, DW_AT_name("ui8WritePtr")
    2008                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("ui8WritePtr")
    2009                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2010                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2011                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2012                            .dwattr $C$DW$185, DW_AT_decl_line(0xa2)
    2013                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    2014                    
    2015                    $C$DW$186       .dwtag  DW_TAG_member
    2016                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    2017                            .dwattr $C$DW$186, DW_AT_name("ui16Index")
    2018                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("ui16Index")
    2019                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2020                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2021                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2022                            .dwattr $C$DW$186, DW_AT_decl_line(0xa7)
    2023                            .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    2024                    
    2025                    $C$DW$187       .dwtag  DW_TAG_member
    2026                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    2027                            .dwattr $C$DW$187, DW_AT_name("pCommands")
    2028                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("pCommands")
    2029                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2030                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2031                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2032                            .dwattr $C$DW$187, DW_AT_decl_line(0xac)
    2033                            .dwattr $C$DW$187, DW_AT_decl_column(0x12)
    2034                    
    2035                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2036                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    2037                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2038                            .dwendtag $C$DW$T$32
    2039                    
    2040                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    2041                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    2042                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2043                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2044                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2045                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    2046                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2047                    
    2048                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2049                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2050                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2051                    
    2052                    
    2053                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2054                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    2055                    $C$DW$188       .dwtag  DW_TAG_member
    2056                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$34)
    2057                            .dwattr $C$DW$188, DW_AT_name("psI2CInst")
    2058                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("psI2CInst")
    2059                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   40

    2061                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2062                            .dwattr $C$DW$188, DW_AT_decl_line(0xf0)
    2063                            .dwattr $C$DW$188, DW_AT_decl_column(0x14)
    2064                    
    2065                    $C$DW$189       .dwtag  DW_TAG_member
    2066                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$35)
    2067                            .dwattr $C$DW$189, DW_AT_name("pui8Buffer")
    2068                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("pui8Buffer")
    2069                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2070                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2071                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2072                            .dwattr $C$DW$189, DW_AT_decl_line(0xf5)
    2073                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2074                    
    2075                    $C$DW$190       .dwtag  DW_TAG_member
    2076                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2077                            .dwattr $C$DW$190, DW_AT_name("ui8State")
    2078                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ui8State")
    2079                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2080                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2081                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2082                            .dwattr $C$DW$190, DW_AT_decl_line(0xfa)
    2083                            .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    2084                    
    2085                    $C$DW$191       .dwtag  DW_TAG_member
    2086                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2087                            .dwattr $C$DW$191, DW_AT_name("ui8Addr")
    2088                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("ui8Addr")
    2089                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2090                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2091                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2092                            .dwattr $C$DW$191, DW_AT_decl_line(0xff)
    2093                            .dwattr $C$DW$191, DW_AT_decl_column(0x0d)
    2094                    
    2095                    $C$DW$192       .dwtag  DW_TAG_member
    2096                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    2097                            .dwattr $C$DW$192, DW_AT_name("ui16Mask")
    2098                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("ui16Mask")
    2099                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2100                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2102                            .dwattr $C$DW$192, DW_AT_decl_line(0x104)
    2103                            .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    2104                    
    2105                    $C$DW$193       .dwtag  DW_TAG_member
    2106                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2107                            .dwattr $C$DW$193, DW_AT_name("ui16Value")
    2108                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("ui16Value")
    2109                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2110                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2111                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2112                            .dwattr $C$DW$193, DW_AT_decl_line(0x109)
    2113                            .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    2114                    
    2115                    $C$DW$194       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   41

    2116                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$28)
    2117                            .dwattr $C$DW$194, DW_AT_name("pfnCallback")
    2118                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("pfnCallback")
    2119                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2120                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2121                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2122                            .dwattr $C$DW$194, DW_AT_decl_line(0x10f)
    2123                            .dwattr $C$DW$194, DW_AT_decl_column(0x16)
    2124                    
    2125                    $C$DW$195       .dwtag  DW_TAG_member
    2126                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$3)
    2127                            .dwattr $C$DW$195, DW_AT_name("pvCallbackData")
    2128                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("pvCallbackData")
    2129                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2130                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2131                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2132                            .dwattr $C$DW$195, DW_AT_decl_line(0x114)
    2133                            .dwattr $C$DW$195, DW_AT_decl_column(0x0b)
    2134                    
    2135                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2136                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    2137                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2138                            .dwendtag $C$DW$T$36
    2139                    
    2140                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    2141                            .dwattr $C$DW$T$94, DW_AT_name("tI2CMReadModifyWrite16")
    2142                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$36)
    2143                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2144                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2145                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x116)
    2146                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    2147                    
    2148                    $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    2149                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    2150                            .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
    2151                    
    2152                    
    2153                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2154                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    2155                    $C$DW$196       .dwtag  DW_TAG_member
    2156                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$34)
    2157                            .dwattr $C$DW$196, DW_AT_name("psI2CInst")
    2158                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("psI2CInst")
    2159                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2161                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2162                            .dwattr $C$DW$196, DW_AT_decl_line(0x123)
    2163                            .dwattr $C$DW$196, DW_AT_decl_column(0x14)
    2164                    
    2165                    $C$DW$197       .dwtag  DW_TAG_member
    2166                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$37)
    2167                            .dwattr $C$DW$197, DW_AT_name("pui8Buffer")
    2168                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("pui8Buffer")
    2169                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2170                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   42

    2171                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2172                            .dwattr $C$DW$197, DW_AT_decl_line(0x128)
    2173                            .dwattr $C$DW$197, DW_AT_decl_column(0x0d)
    2174                    
    2175                    $C$DW$198       .dwtag  DW_TAG_member
    2176                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2177                            .dwattr $C$DW$198, DW_AT_name("ui16Count")
    2178                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("ui16Count")
    2179                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2180                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2181                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2182                            .dwattr $C$DW$198, DW_AT_decl_line(0x12d)
    2183                            .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    2184                    
    2185                    $C$DW$199       .dwtag  DW_TAG_member
    2186                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    2187                            .dwattr $C$DW$199, DW_AT_name("pui8Data")
    2188                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("pui8Data")
    2189                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2190                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2191                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2192                            .dwattr $C$DW$199, DW_AT_decl_line(0x132)
    2193                            .dwattr $C$DW$199, DW_AT_decl_column(0x14)
    2194                    
    2195                    $C$DW$200       .dwtag  DW_TAG_member
    2196                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$28)
    2197                            .dwattr $C$DW$200, DW_AT_name("pfnCallback")
    2198                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("pfnCallback")
    2199                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2200                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2201                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2202                            .dwattr $C$DW$200, DW_AT_decl_line(0x137)
    2203                            .dwattr $C$DW$200, DW_AT_decl_column(0x16)
    2204                    
    2205                    $C$DW$201       .dwtag  DW_TAG_member
    2206                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$3)
    2207                            .dwattr $C$DW$201, DW_AT_name("pvCallbackData")
    2208                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("pvCallbackData")
    2209                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2210                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2211                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2212                            .dwattr $C$DW$201, DW_AT_decl_line(0x13c)
    2213                            .dwattr $C$DW$201, DW_AT_decl_column(0x0b)
    2214                    
    2215                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2216                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x11e)
    2217                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2218                            .dwendtag $C$DW$T$38
    2219                    
    2220                    $C$DW$T$52      .dwtag  DW_TAG_typedef
    2221                            .dwattr $C$DW$T$52, DW_AT_name("tI2CMWrite8")
    2222                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$38)
    2223                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2224                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2225                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x13e)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   43

    2226                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    2227                    
    2228                    
    2229                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2230                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    2231                    $C$DW$202       .dwtag  DW_TAG_member
    2232                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$34)
    2233                            .dwattr $C$DW$202, DW_AT_name("psI2CInst")
    2234                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("psI2CInst")
    2235                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2237                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2238                            .dwattr $C$DW$202, DW_AT_decl_line(0xbc)
    2239                            .dwattr $C$DW$202, DW_AT_decl_column(0x14)
    2240                    
    2241                    $C$DW$203       .dwtag  DW_TAG_member
    2242                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$35)
    2243                            .dwattr $C$DW$203, DW_AT_name("pui8Buffer")
    2244                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("pui8Buffer")
    2245                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2246                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2247                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2248                            .dwattr $C$DW$203, DW_AT_decl_line(0xc1)
    2249                            .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    2250                    
    2251                    $C$DW$204       .dwtag  DW_TAG_member
    2252                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2253                            .dwattr $C$DW$204, DW_AT_name("ui8State")
    2254                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("ui8State")
    2255                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2256                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2257                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2258                            .dwattr $C$DW$204, DW_AT_decl_line(0xc6)
    2259                            .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2260                    
    2261                    $C$DW$205       .dwtag  DW_TAG_member
    2262                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2263                            .dwattr $C$DW$205, DW_AT_name("ui8Addr")
    2264                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("ui8Addr")
    2265                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2266                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2267                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2268                            .dwattr $C$DW$205, DW_AT_decl_line(0xcb)
    2269                            .dwattr $C$DW$205, DW_AT_decl_column(0x0d)
    2270                    
    2271                    $C$DW$206       .dwtag  DW_TAG_member
    2272                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2273                            .dwattr $C$DW$206, DW_AT_name("ui8Mask")
    2274                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("ui8Mask")
    2275                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2276                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2277                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2278                            .dwattr $C$DW$206, DW_AT_decl_line(0xd0)
    2279                            .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    2280                    
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   44

    2281                    $C$DW$207       .dwtag  DW_TAG_member
    2282                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2283                            .dwattr $C$DW$207, DW_AT_name("ui8Value")
    2284                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("ui8Value")
    2285                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2286                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2287                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2288                            .dwattr $C$DW$207, DW_AT_decl_line(0xd5)
    2289                            .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    2290                    
    2291                    $C$DW$208       .dwtag  DW_TAG_member
    2292                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$28)
    2293                            .dwattr $C$DW$208, DW_AT_name("pfnCallback")
    2294                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("pfnCallback")
    2295                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2296                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2297                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2298                            .dwattr $C$DW$208, DW_AT_decl_line(0xdb)
    2299                            .dwattr $C$DW$208, DW_AT_decl_column(0x16)
    2300                    
    2301                    $C$DW$209       .dwtag  DW_TAG_member
    2302                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$3)
    2303                            .dwattr $C$DW$209, DW_AT_name("pvCallbackData")
    2304                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("pvCallbackData")
    2305                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2306                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2307                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2308                            .dwattr $C$DW$209, DW_AT_decl_line(0xe0)
    2309                            .dwattr $C$DW$209, DW_AT_decl_column(0x0b)
    2310                    
    2311                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2312                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xb7)
    2313                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2314                            .dwendtag $C$DW$T$39
    2315                    
    2316                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    2317                            .dwattr $C$DW$T$53, DW_AT_name("tI2CMReadModifyWrite8")
    2318                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$39)
    2319                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2320                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2321                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xe2)
    2322                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    2323                    
    2324                    
    2325                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2326                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x2c)
    2327                    $C$DW$210       .dwtag  DW_TAG_member
    2328                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$34)
    2329                            .dwattr $C$DW$210, DW_AT_name("psI2CInst")
    2330                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("psI2CInst")
    2331                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2333                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2334                            .dwattr $C$DW$210, DW_AT_decl_line(0x32)
    2335                            .dwattr $C$DW$210, DW_AT_decl_column(0x14)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   45

    2336                    
    2337                    $C$DW$211       .dwtag  DW_TAG_member
    2338                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2339                            .dwattr $C$DW$211, DW_AT_name("ui8Addr")
    2340                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("ui8Addr")
    2341                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2342                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2343                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2344                            .dwattr $C$DW$211, DW_AT_decl_line(0x37)
    2345                            .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    2346                    
    2347                    $C$DW$212       .dwtag  DW_TAG_member
    2348                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2349                            .dwattr $C$DW$212, DW_AT_name("ui8State")
    2350                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("ui8State")
    2351                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2352                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2353                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2354                            .dwattr $C$DW$212, DW_AT_decl_line(0x3c)
    2355                            .dwattr $C$DW$212, DW_AT_decl_column(0x0d)
    2356                    
    2357                    $C$DW$213       .dwtag  DW_TAG_member
    2358                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$40)
    2359                            .dwattr $C$DW$213, DW_AT_name("pui8Data")
    2360                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("pui8Data")
    2361                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2362                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2363                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2364                            .dwattr $C$DW$213, DW_AT_decl_line(0x41)
    2365                            .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    2366                    
    2367                    $C$DW$214       .dwtag  DW_TAG_member
    2368                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$28)
    2369                            .dwattr $C$DW$214, DW_AT_name("pfnCallback")
    2370                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("pfnCallback")
    2371                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2372                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2373                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2374                            .dwattr $C$DW$214, DW_AT_decl_line(0x47)
    2375                            .dwattr $C$DW$214, DW_AT_decl_column(0x16)
    2376                    
    2377                    $C$DW$215       .dwtag  DW_TAG_member
    2378                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$3)
    2379                            .dwattr $C$DW$215, DW_AT_name("pvCallbackData")
    2380                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("pvCallbackData")
    2381                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2382                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2383                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2384                            .dwattr $C$DW$215, DW_AT_decl_line(0x4c)
    2385                            .dwattr $C$DW$215, DW_AT_decl_column(0x0b)
    2386                    
    2387                    $C$DW$216       .dwtag  DW_TAG_member
    2388                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$54)
    2389                            .dwattr $C$DW$216, DW_AT_name("uCommand")
    2390                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("uCommand")
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   46

    2391                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2392                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2393                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2394                            .dwattr $C$DW$216, DW_AT_decl_line(0x64)
    2395                            .dwattr $C$DW$216, DW_AT_decl_column(0x05)
    2396                    
    2397                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2398                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2d)
    2399                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2400                            .dwendtag $C$DW$T$41
    2401                    
    2402                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    2403                            .dwattr $C$DW$T$42, DW_AT_name("tAK8975")
    2404                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2405                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2406                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2407                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x66)
    2408                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2409                    
    2410                    
    2411                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2412                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x6c)
    2413                    $C$DW$217       .dwtag  DW_TAG_member
    2414                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$34)
    2415                            .dwattr $C$DW$217, DW_AT_name("psI2CInst")
    2416                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("psI2CInst")
    2417                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2418                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2419                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2420                            .dwattr $C$DW$217, DW_AT_decl_line(0x33)
    2421                            .dwattr $C$DW$217, DW_AT_decl_column(0x14)
    2422                    
    2423                    $C$DW$218       .dwtag  DW_TAG_member
    2424                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$42)
    2425                            .dwattr $C$DW$218, DW_AT_name("sAK8975Inst")
    2426                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("sAK8975Inst")
    2427                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2428                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2429                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2430                            .dwattr $C$DW$218, DW_AT_decl_line(0x38)
    2431                            .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    2432                    
    2433                    $C$DW$219       .dwtag  DW_TAG_member
    2434                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2435                            .dwattr $C$DW$219, DW_AT_name("ui8Addr")
    2436                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("ui8Addr")
    2437                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2438                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2439                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2440                            .dwattr $C$DW$219, DW_AT_decl_line(0x3d)
    2441                            .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    2442                    
    2443                    $C$DW$220       .dwtag  DW_TAG_member
    2444                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2445                            .dwattr $C$DW$220, DW_AT_name("ui8State")
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   47

    2446                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("ui8State")
    2447                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2448                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2449                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2450                            .dwattr $C$DW$220, DW_AT_decl_line(0x42)
    2451                            .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    2452                    
    2453                    $C$DW$221       .dwtag  DW_TAG_member
    2454                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2455                            .dwattr $C$DW$221, DW_AT_name("ui8AccelAfsSel")
    2456                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2457                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2458                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2460                            .dwattr $C$DW$221, DW_AT_decl_line(0x47)
    2461                            .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    2462                    
    2463                    $C$DW$222       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2465                            .dwattr $C$DW$222, DW_AT_name("ui8NewAccelAfsSel")
    2466                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2467                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2468                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2469                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2470                            .dwattr $C$DW$222, DW_AT_decl_line(0x4d)
    2471                            .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    2472                    
    2473                    $C$DW$223       .dwtag  DW_TAG_member
    2474                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2475                            .dwattr $C$DW$223, DW_AT_name("ui8GyroFsSel")
    2476                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2477                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2478                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2479                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2480                            .dwattr $C$DW$223, DW_AT_decl_line(0x52)
    2481                            .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    2482                    
    2483                    $C$DW$224       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2485                            .dwattr $C$DW$224, DW_AT_name("ui8NewGyroFsSel")
    2486                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2487                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2488                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2489                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2490                            .dwattr $C$DW$224, DW_AT_decl_line(0x58)
    2491                            .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    2492                    
    2493                    $C$DW$225       .dwtag  DW_TAG_member
    2494                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$43)
    2495                            .dwattr $C$DW$225, DW_AT_name("pui8Data")
    2496                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("pui8Data")
    2497                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2498                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2499                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2500                            .dwattr $C$DW$225, DW_AT_decl_line(0x5d)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   48

    2501                            .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    2502                    
    2503                    $C$DW$226       .dwtag  DW_TAG_member
    2504                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$28)
    2505                            .dwattr $C$DW$226, DW_AT_name("pfnCallback")
    2506                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("pfnCallback")
    2507                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2508                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2509                            .dwattr $C$DW$226, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2510                            .dwattr $C$DW$226, DW_AT_decl_line(0x63)
    2511                            .dwattr $C$DW$226, DW_AT_decl_column(0x16)
    2512                    
    2513                    $C$DW$227       .dwtag  DW_TAG_member
    2514                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$3)
    2515                            .dwattr $C$DW$227, DW_AT_name("pvCallbackData")
    2516                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("pvCallbackData")
    2517                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2518                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2519                            .dwattr $C$DW$227, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2520                            .dwattr $C$DW$227, DW_AT_decl_line(0x68)
    2521                            .dwattr $C$DW$227, DW_AT_decl_column(0x0b)
    2522                    
    2523                    $C$DW$228       .dwtag  DW_TAG_member
    2524                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$56)
    2525                            .dwattr $C$DW$228, DW_AT_name("uCommand")
    2526                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("uCommand")
    2527                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2528                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2529                            .dwattr $C$DW$228, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2530                            .dwattr $C$DW$228, DW_AT_decl_line(0x80)
    2531                            .dwattr $C$DW$228, DW_AT_decl_column(0x05)
    2532                    
    2533                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2534                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
    2535                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2536                            .dwendtag $C$DW$T$44
    2537                    
    2538                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2539                            .dwattr $C$DW$T$96, DW_AT_name("tMPU9150")
    2540                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$44)
    2541                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2542                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2543                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x82)
    2544                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    2545                    
    2546                    $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    2547                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    2548                            .dwattr $C$DW$T$97, DW_AT_address_class(0x20)
    2549                    
    2550                    
    2551                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2552                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
    2553                    $C$DW$229       .dwtag  DW_TAG_member
    2554                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$34)
    2555                            .dwattr $C$DW$229, DW_AT_name("psI2CInst")
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   49

    2556                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("psI2CInst")
    2557                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2558                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2559                            .dwattr $C$DW$229, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2560                            .dwattr $C$DW$229, DW_AT_decl_line(0x14c)
    2561                            .dwattr $C$DW$229, DW_AT_decl_column(0x14)
    2562                    
    2563                    $C$DW$230       .dwtag  DW_TAG_member
    2564                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$23)
    2565                            .dwattr $C$DW$230, DW_AT_name("pui8Data")
    2566                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("pui8Data")
    2567                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2568                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2569                            .dwattr $C$DW$230, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2570                            .dwattr $C$DW$230, DW_AT_decl_line(0x151)
    2571                            .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    2572                    
    2573                    $C$DW$231       .dwtag  DW_TAG_member
    2574                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$22)
    2575                            .dwattr $C$DW$231, DW_AT_name("ui16Count")
    2576                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("ui16Count")
    2577                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2578                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2579                            .dwattr $C$DW$231, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2580                            .dwattr $C$DW$231, DW_AT_decl_line(0x156)
    2581                            .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    2582                    
    2583                    $C$DW$232       .dwtag  DW_TAG_member
    2584                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$28)
    2585                            .dwattr $C$DW$232, DW_AT_name("pfnCallback")
    2586                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("pfnCallback")
    2587                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2588                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2589                            .dwattr $C$DW$232, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2590                            .dwattr $C$DW$232, DW_AT_decl_line(0x15b)
    2591                            .dwattr $C$DW$232, DW_AT_decl_column(0x16)
    2592                    
    2593                    $C$DW$233       .dwtag  DW_TAG_member
    2594                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$3)
    2595                            .dwattr $C$DW$233, DW_AT_name("pvCallbackData")
    2596                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("pvCallbackData")
    2597                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2598                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2599                            .dwattr $C$DW$233, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2600                            .dwattr $C$DW$233, DW_AT_decl_line(0x160)
    2601                            .dwattr $C$DW$233, DW_AT_decl_column(0x0b)
    2602                    
    2603                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2604                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x147)
    2605                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    2606                            .dwendtag $C$DW$T$45
    2607                    
    2608                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2609                            .dwattr $C$DW$T$98, DW_AT_name("tI2CMRead16BE")
    2610                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$45)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   50

    2611                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2612                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2613                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x162)
    2614                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x01)
    2615                    
    2616                    
    2617                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2618                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
    2619                    $C$DW$234       .dwtag  DW_TAG_member
    2620                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$34)
    2621                            .dwattr $C$DW$234, DW_AT_name("psI2CInst")
    2622                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("psI2CInst")
    2623                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2625                            .dwattr $C$DW$234, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2626                            .dwattr $C$DW$234, DW_AT_decl_line(0x170)
    2627                            .dwattr $C$DW$234, DW_AT_decl_column(0x14)
    2628                    
    2629                    $C$DW$235       .dwtag  DW_TAG_member
    2630                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$37)
    2631                            .dwattr $C$DW$235, DW_AT_name("pui8Buffer")
    2632                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("pui8Buffer")
    2633                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2634                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2635                            .dwattr $C$DW$235, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2636                            .dwattr $C$DW$235, DW_AT_decl_line(0x175)
    2637                            .dwattr $C$DW$235, DW_AT_decl_column(0x0d)
    2638                    
    2639                    $C$DW$236       .dwtag  DW_TAG_member
    2640                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$22)
    2641                            .dwattr $C$DW$236, DW_AT_name("ui16Count")
    2642                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("ui16Count")
    2643                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2644                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2645                            .dwattr $C$DW$236, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2646                            .dwattr $C$DW$236, DW_AT_decl_line(0x17a)
    2647                            .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    2648                    
    2649                    $C$DW$237       .dwtag  DW_TAG_member
    2650                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$21)
    2651                            .dwattr $C$DW$237, DW_AT_name("pui8Data")
    2652                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("pui8Data")
    2653                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2654                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2655                            .dwattr $C$DW$237, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2656                            .dwattr $C$DW$237, DW_AT_decl_line(0x17f)
    2657                            .dwattr $C$DW$237, DW_AT_decl_column(0x14)
    2658                    
    2659                    $C$DW$238       .dwtag  DW_TAG_member
    2660                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$28)
    2661                            .dwattr $C$DW$238, DW_AT_name("pfnCallback")
    2662                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("pfnCallback")
    2663                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2664                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2665                            .dwattr $C$DW$238, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   51

    2666                            .dwattr $C$DW$238, DW_AT_decl_line(0x184)
    2667                            .dwattr $C$DW$238, DW_AT_decl_column(0x16)
    2668                    
    2669                    $C$DW$239       .dwtag  DW_TAG_member
    2670                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$3)
    2671                            .dwattr $C$DW$239, DW_AT_name("pvCallbackData")
    2672                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("pvCallbackData")
    2673                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2674                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2675                            .dwattr $C$DW$239, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2676                            .dwattr $C$DW$239, DW_AT_decl_line(0x189)
    2677                            .dwattr $C$DW$239, DW_AT_decl_column(0x0b)
    2678                    
    2679                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2680                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x16b)
    2681                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    2682                            .dwendtag $C$DW$T$46
    2683                    
    2684                    $C$DW$T$99      .dwtag  DW_TAG_typedef
    2685                            .dwattr $C$DW$T$99, DW_AT_name("tI2CMWrite16BE")
    2686                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$46)
    2687                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    2688                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2689                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x18b)
    2690                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x01)
    2691                    
    2692                    
    2693                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2694                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x58)
    2695                    $C$DW$240       .dwtag  DW_TAG_member
    2696                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$48)
    2697                            .dwattr $C$DW$240, DW_AT_name("ppfDCM")
    2698                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("ppfDCM")
    2699                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$240, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2702                            .dwattr $C$DW$240, DW_AT_decl_line(0x33)
    2703                            .dwattr $C$DW$240, DW_AT_decl_column(0x0b)
    2704                    
    2705                    $C$DW$241       .dwtag  DW_TAG_member
    2706                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$16)
    2707                            .dwattr $C$DW$241, DW_AT_name("fDeltaT")
    2708                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("fDeltaT")
    2709                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2710                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2711                            .dwattr $C$DW$241, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2712                            .dwattr $C$DW$241, DW_AT_decl_line(0x38)
    2713                            .dwattr $C$DW$241, DW_AT_decl_column(0x0b)
    2714                    
    2715                    $C$DW$242       .dwtag  DW_TAG_member
    2716                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$16)
    2717                            .dwattr $C$DW$242, DW_AT_name("fScaleA")
    2718                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("fScaleA")
    2719                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2720                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   52

    2721                            .dwattr $C$DW$242, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2722                            .dwattr $C$DW$242, DW_AT_decl_line(0x3e)
    2723                            .dwattr $C$DW$242, DW_AT_decl_column(0x0b)
    2724                    
    2725                    $C$DW$243       .dwtag  DW_TAG_member
    2726                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$16)
    2727                            .dwattr $C$DW$243, DW_AT_name("fScaleG")
    2728                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("fScaleG")
    2729                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2730                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2731                            .dwattr $C$DW$243, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2732                            .dwattr $C$DW$243, DW_AT_decl_line(0x43)
    2733                            .dwattr $C$DW$243, DW_AT_decl_column(0x0b)
    2734                    
    2735                    $C$DW$244       .dwtag  DW_TAG_member
    2736                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$16)
    2737                            .dwattr $C$DW$244, DW_AT_name("fScaleM")
    2738                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("fScaleM")
    2739                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2740                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2741                            .dwattr $C$DW$244, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2742                            .dwattr $C$DW$244, DW_AT_decl_line(0x48)
    2743                            .dwattr $C$DW$244, DW_AT_decl_column(0x0b)
    2744                    
    2745                    $C$DW$245       .dwtag  DW_TAG_member
    2746                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$47)
    2747                            .dwattr $C$DW$245, DW_AT_name("pfAccel")
    2748                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("pfAccel")
    2749                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2750                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2751                            .dwattr $C$DW$245, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2752                            .dwattr $C$DW$245, DW_AT_decl_line(0x4d)
    2753                            .dwattr $C$DW$245, DW_AT_decl_column(0x0b)
    2754                    
    2755                    $C$DW$246       .dwtag  DW_TAG_member
    2756                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$47)
    2757                            .dwattr $C$DW$246, DW_AT_name("pfGyro")
    2758                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("pfGyro")
    2759                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2760                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2761                            .dwattr $C$DW$246, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2762                            .dwattr $C$DW$246, DW_AT_decl_line(0x52)
    2763                            .dwattr $C$DW$246, DW_AT_decl_column(0x0b)
    2764                    
    2765                    $C$DW$247       .dwtag  DW_TAG_member
    2766                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$47)
    2767                            .dwattr $C$DW$247, DW_AT_name("pfMagneto")
    2768                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("pfMagneto")
    2769                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2770                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2771                            .dwattr $C$DW$247, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2772                            .dwattr $C$DW$247, DW_AT_decl_line(0x57)
    2773                            .dwattr $C$DW$247, DW_AT_decl_column(0x0b)
    2774                    
    2775                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   53

    2776                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    2777                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    2778                            .dwendtag $C$DW$T$49
    2779                    
    2780                    $C$DW$T$100     .dwtag  DW_TAG_typedef
    2781                            .dwattr $C$DW$T$100, DW_AT_name("tCompDCM")
    2782                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$49)
    2783                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    2784                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/comp_dcm.h")
    2785                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x59)
    2786                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x01)
    2787                    
    2788                    
    2789                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    2790                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x18)
    2791                    $C$DW$248       .dwtag  DW_TAG_member
    2792                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$10)
    2793                            .dwattr $C$DW$248, DW_AT_name("fd")
    2794                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("fd")
    2795                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2797                            .dwattr $C$DW$248, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2798                            .dwattr $C$DW$248, DW_AT_decl_line(0x5c)
    2799                            .dwattr $C$DW$248, DW_AT_decl_column(0x0b)
    2800                    
    2801                    $C$DW$249       .dwtag  DW_TAG_member
    2802                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$50)
    2803                            .dwattr $C$DW$249, DW_AT_name("buf")
    2804                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("buf")
    2805                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2806                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2807                            .dwattr $C$DW$249, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2808                            .dwattr $C$DW$249, DW_AT_decl_line(0x5d)
    2809                            .dwattr $C$DW$249, DW_AT_decl_column(0x16)
    2810                    
    2811                    $C$DW$250       .dwtag  DW_TAG_member
    2812                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$50)
    2813                            .dwattr $C$DW$250, DW_AT_name("pos")
    2814                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("pos")
    2815                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2816                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2817                            .dwattr $C$DW$250, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2818                            .dwattr $C$DW$250, DW_AT_decl_line(0x5e)
    2819                            .dwattr $C$DW$250, DW_AT_decl_column(0x16)
    2820                    
    2821                    $C$DW$251       .dwtag  DW_TAG_member
    2822                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$50)
    2823                            .dwattr $C$DW$251, DW_AT_name("bufend")
    2824                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("bufend")
    2825                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2826                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2827                            .dwattr $C$DW$251, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2828                            .dwattr $C$DW$251, DW_AT_decl_line(0x5f)
    2829                            .dwattr $C$DW$251, DW_AT_decl_column(0x16)
    2830                    
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   54

    2831                    $C$DW$252       .dwtag  DW_TAG_member
    2832                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$50)
    2833                            .dwattr $C$DW$252, DW_AT_name("buff_stop")
    2834                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("buff_stop")
    2835                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2836                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2837                            .dwattr $C$DW$252, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2838                            .dwattr $C$DW$252, DW_AT_decl_line(0x60)
    2839                            .dwattr $C$DW$252, DW_AT_decl_column(0x16)
    2840                    
    2841                    $C$DW$253       .dwtag  DW_TAG_member
    2842                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$11)
    2843                            .dwattr $C$DW$253, DW_AT_name("flags")
    2844                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("flags")
    2845                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2846                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2847                            .dwattr $C$DW$253, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2848                            .dwattr $C$DW$253, DW_AT_decl_line(0x61)
    2849                            .dwattr $C$DW$253, DW_AT_decl_column(0x16)
    2850                    
    2851                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2852                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x5b)
    2853                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    2854                            .dwendtag $C$DW$T$51
    2855                    
    2856                    $C$DW$T$101     .dwtag  DW_TAG_typedef
    2857                            .dwattr $C$DW$T$101, DW_AT_name("FILE")
    2858                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$51)
    2859                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    2860                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2861                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x62)
    2862                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    2863                    
    2864                    
    2865                    $C$DW$T$54      .dwtag  DW_TAG_union_type
    2866                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x14)
    2867                    $C$DW$254       .dwtag  DW_TAG_member
    2868                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$37)
    2869                            .dwattr $C$DW$254, DW_AT_name("pui8Buffer")
    2870                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("pui8Buffer")
    2871                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2872                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2873                            .dwattr $C$DW$254, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2874                            .dwattr $C$DW$254, DW_AT_decl_line(0x58)
    2875                            .dwattr $C$DW$254, DW_AT_decl_column(0x11)
    2876                    
    2877                    $C$DW$255       .dwtag  DW_TAG_member
    2878                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$52)
    2879                            .dwattr $C$DW$255, DW_AT_name("sWriteState")
    2880                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("sWriteState")
    2881                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2882                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2883                            .dwattr $C$DW$255, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2884                            .dwattr $C$DW$255, DW_AT_decl_line(0x5d)
    2885                            .dwattr $C$DW$255, DW_AT_decl_column(0x15)
TI ARM Assembler PC v15.12.1 Thu Nov 03 13:01:19 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MPU9150AccelerometerManager_Task.asm                                 PAGE   55

    2886                    
    2887                    $C$DW$256       .dwtag  DW_TAG_member
    2888                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$53)
    2889                            .dwattr $C$DW$256, DW_AT_name("sReadModifyWriteState")
    2890                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2891                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2892                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2893                            .dwattr $C$DW$256, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2894                            .dwattr $C$DW$256, DW_AT_decl_line(0x62)
    2895                            .dwattr $C$DW$256, DW_AT_decl_column(0x1f)
    2896                    
    2897                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2898                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x54)
    2899                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x05)
    2900                            .dwendtag $C$DW$T$54
    2901                    
    2902                    
    2903                    $C$DW$T$56      .dwtag  DW_TAG_union_type
    2904                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x14)
    2905                    $C$DW$257       .dwtag  DW_TAG_member
    2906                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$55)
    2907                            .dwattr $C$DW$257, DW_AT_name("pui8Buffer")
    2908                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("pui8Buffer")
    2909                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2910                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2911                            .dwattr $C$DW$257, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2912                            .dwattr $C$DW$257, DW_AT_decl_line(0x74)
    2913                            .dwattr $C$DW$257, DW_AT_decl_column(0x11)
    2914                    
    2915                    $C$DW$258       .dwtag  DW_TAG_member
    2916                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$52)
    2917                            .dwattr $C$DW$258, DW_AT_name("sWriteState")
    2918                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("sWriteState")
    2919                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2920                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2921                            .dwattr $C$DW$258, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2922                            .dwattr $C$DW$258, DW_AT_decl_line(0x79)
    2923                            .dwattr $C$DW$258, DW_AT_decl_column(0x15)
    2924                    
    2925                    $C$DW$259       .dwtag  DW_TAG_member
    2926                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$53)
    2927                            .dwattr $C$DW$259, DW_AT_name("sReadModifyWriteState")
    2928                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2929                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2930                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2931                            .dwattr $C$DW$259, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2932                            .dwattr $C$DW$259, DW_AT_decl_line(0x7e)
    2933                            .dwattr $C$DW$259, DW_AT_decl_column(0x1f)
    2934                    
    2935                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
