TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Thu Oct 27 13:57:51 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/Task_gyro.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("I2CMCommand")

    1755                            .dwattr $C$DW$166, DW_AT_name("eIncrement")
    1756                            .dwattr $C$DW$166, DW_AT_const_value(0x02)
    1757                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1758                            .dwattr $C$DW$166, DW_AT_decl_line(0x7e)
    1759                            .dwattr $C$DW$166, DW_AT_decl_column(0x02)
    1760                    
    1761                    $C$DW$167       .dwtag  DW_TAG_enumerator
    1762                            .dwattr $C$DW$167, DW_AT_name("eSetValueWithOverwrite")
    1763                            .dwattr $C$DW$167, DW_AT_const_value(0x03)
    1764                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1765                            .dwattr $C$DW$167, DW_AT_decl_line(0x7f)
    1766                            .dwattr $C$DW$167, DW_AT_decl_column(0x02)
    1767                    
    1768                    $C$DW$168       .dwtag  DW_TAG_enumerator
    1769                            .dwattr $C$DW$168, DW_AT_name("eSetValueWithoutOverwrite")
    1770                            .dwattr $C$DW$168, DW_AT_const_value(0x04)
    1771                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1772                            .dwattr $C$DW$168, DW_AT_decl_line(0x80)
    1773                            .dwattr $C$DW$168, DW_AT_decl_column(0x02)
    1774                    
    1775                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1776                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x7b)
    1777                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    1778                            .dwendtag $C$DW$T$87
    1779                    
    1780                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    1781                            .dwattr $C$DW$T$88, DW_AT_name("eNotifyAction")
    1782                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1783                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1784                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1785                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x81)
    1786                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1787                    
    1788                    
    1789                    $C$DW$T$89      .dwtag  DW_TAG_enumeration_type
    1790                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
    1791                    $C$DW$169       .dwtag  DW_TAG_enumerator
    1792                            .dwattr $C$DW$169, DW_AT_name("eAbortSleep")
    1793                            .dwattr $C$DW$169, DW_AT_const_value(0x00)
    1794                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1795                            .dwattr $C$DW$169, DW_AT_decl_line(0xb5)
    1796                            .dwattr $C$DW$169, DW_AT_decl_column(0x02)
    1797                    
    1798                    $C$DW$170       .dwtag  DW_TAG_enumerator
    1799                            .dwattr $C$DW$170, DW_AT_name("eStandardSleep")
    1800                            .dwattr $C$DW$170, DW_AT_const_value(0x01)
    1801                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1802                            .dwattr $C$DW$170, DW_AT_decl_line(0xb6)
    1803                            .dwattr $C$DW$170, DW_AT_decl_column(0x02)
    1804                    
    1805                    $C$DW$171       .dwtag  DW_TAG_enumerator
    1806                            .dwattr $C$DW$171, DW_AT_name("eNoTasksWaitingTimeout")
    1807                            .dwattr $C$DW$171, DW_AT_const_value(0x02)
    1808                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   34

    1809                            .dwattr $C$DW$171, DW_AT_decl_line(0xb7)
    1810                            .dwattr $C$DW$171, DW_AT_decl_column(0x02)
    1811                    
    1812                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1813                            .dwattr $C$DW$T$89, DW_AT_decl_line(0xb4)
    1814                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x01)
    1815                            .dwendtag $C$DW$T$89
    1816                    
    1817                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    1818                            .dwattr $C$DW$T$90, DW_AT_name("eSleepModeStatus")
    1819                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1820                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1821                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1822                            .dwattr $C$DW$T$90, DW_AT_decl_line(0xb8)
    1823                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1824                    
    1825                    
    1826                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1827                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1828                    $C$DW$172       .dwtag  DW_TAG_member
    1829                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1830                            .dwattr $C$DW$172, DW_AT_name("ui8Addr")
    1831                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui8Addr")
    1832                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1833                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1834                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1835                            .dwattr $C$DW$172, DW_AT_decl_line(0x4c)
    1836                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    1837                    
    1838                    $C$DW$173       .dwtag  DW_TAG_member
    1839                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    1840                            .dwattr $C$DW$173, DW_AT_name("pui8WriteData")
    1841                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("pui8WriteData")
    1842                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1843                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1844                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1845                            .dwattr $C$DW$173, DW_AT_decl_line(0x51)
    1846                            .dwattr $C$DW$173, DW_AT_decl_column(0x14)
    1847                    
    1848                    $C$DW$174       .dwtag  DW_TAG_member
    1849                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    1850                            .dwattr $C$DW$174, DW_AT_name("ui16WriteCount")
    1851                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui16WriteCount")
    1852                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1853                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1854                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1855                            .dwattr $C$DW$174, DW_AT_decl_line(0x56)
    1856                            .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    1857                    
    1858                    $C$DW$175       .dwtag  DW_TAG_member
    1859                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    1860                            .dwattr $C$DW$175, DW_AT_name("ui16WriteBatchSize")
    1861                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1862                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1863                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   35

    1864                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1865                            .dwattr $C$DW$175, DW_AT_decl_line(0x5b)
    1866                            .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    1867                    
    1868                    $C$DW$176       .dwtag  DW_TAG_member
    1869                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
    1870                            .dwattr $C$DW$176, DW_AT_name("pui8ReadData")
    1871                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("pui8ReadData")
    1872                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1873                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1874                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1875                            .dwattr $C$DW$176, DW_AT_decl_line(0x60)
    1876                            .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    1877                    
    1878                    $C$DW$177       .dwtag  DW_TAG_member
    1879                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    1880                            .dwattr $C$DW$177, DW_AT_name("ui16ReadCount")
    1881                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("ui16ReadCount")
    1882                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1883                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1884                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1885                            .dwattr $C$DW$177, DW_AT_decl_line(0x65)
    1886                            .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    1887                    
    1888                    $C$DW$178       .dwtag  DW_TAG_member
    1889                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    1890                            .dwattr $C$DW$178, DW_AT_name("ui16ReadBatchSize")
    1891                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1892                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1893                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1894                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1895                            .dwattr $C$DW$178, DW_AT_decl_line(0x6a)
    1896                            .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    1897                    
    1898                    $C$DW$179       .dwtag  DW_TAG_member
    1899                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$28)
    1900                            .dwattr $C$DW$179, DW_AT_name("pfnCallback")
    1901                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("pfnCallback")
    1902                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1903                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1904                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1905                            .dwattr $C$DW$179, DW_AT_decl_line(0x6f)
    1906                            .dwattr $C$DW$179, DW_AT_decl_column(0x16)
    1907                    
    1908                    $C$DW$180       .dwtag  DW_TAG_member
    1909                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$3)
    1910                            .dwattr $C$DW$180, DW_AT_name("pvCallbackData")
    1911                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("pvCallbackData")
    1912                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1913                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1914                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1915                            .dwattr $C$DW$180, DW_AT_decl_line(0x74)
    1916                            .dwattr $C$DW$180, DW_AT_decl_column(0x0b)
    1917                    
    1918                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   36

    1919                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1920                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1921                            .dwendtag $C$DW$T$29
    1922                    
    1923                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1924                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1925                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1926                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1927                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1928                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1929                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1930                    
    1931                    
    1932                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1933                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1934                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1935                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1936                    $C$DW$181       .dwtag  DW_TAG_subrange_type
    1937                            .dwattr $C$DW$181, DW_AT_upper_bound(0x09)
    1938                    
    1939                            .dwendtag $C$DW$T$31
    1940                    
    1941                    
    1942                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1943                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1944                    $C$DW$182       .dwtag  DW_TAG_member
    1945                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$24)
    1946                            .dwattr $C$DW$182, DW_AT_name("ui32Base")
    1947                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui32Base")
    1948                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1949                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1950                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1951                            .dwattr $C$DW$182, DW_AT_decl_line(0x82)
    1952                            .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    1953                    
    1954                    $C$DW$183       .dwtag  DW_TAG_member
    1955                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1956                            .dwattr $C$DW$183, DW_AT_name("ui8Int")
    1957                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui8Int")
    1958                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1959                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1960                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1961                            .dwattr $C$DW$183, DW_AT_decl_line(0x87)
    1962                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    1963                    
    1964                    $C$DW$184       .dwtag  DW_TAG_member
    1965                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1966                            .dwattr $C$DW$184, DW_AT_name("ui8TxDMA")
    1967                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ui8TxDMA")
    1968                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1969                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1970                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1971                            .dwattr $C$DW$184, DW_AT_decl_line(0x8c)
    1972                            .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    1973                    
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   37

    1974                    $C$DW$185       .dwtag  DW_TAG_member
    1975                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1976                            .dwattr $C$DW$185, DW_AT_name("ui8RxDMA")
    1977                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("ui8RxDMA")
    1978                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1979                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1980                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1981                            .dwattr $C$DW$185, DW_AT_decl_line(0x91)
    1982                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    1983                    
    1984                    $C$DW$186       .dwtag  DW_TAG_member
    1985                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1986                            .dwattr $C$DW$186, DW_AT_name("ui8State")
    1987                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("ui8State")
    1988                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1989                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1990                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1991                            .dwattr $C$DW$186, DW_AT_decl_line(0x96)
    1992                            .dwattr $C$DW$186, DW_AT_decl_column(0x0d)
    1993                    
    1994                    $C$DW$187       .dwtag  DW_TAG_member
    1995                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1996                            .dwattr $C$DW$187, DW_AT_name("ui8ReadPtr")
    1997                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("ui8ReadPtr")
    1998                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1999                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2000                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2001                            .dwattr $C$DW$187, DW_AT_decl_line(0x9c)
    2002                            .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    2003                    
    2004                    $C$DW$188       .dwtag  DW_TAG_member
    2005                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2006                            .dwattr $C$DW$188, DW_AT_name("ui8WritePtr")
    2007                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ui8WritePtr")
    2008                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2009                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2010                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2011                            .dwattr $C$DW$188, DW_AT_decl_line(0xa2)
    2012                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    2013                    
    2014                    $C$DW$189       .dwtag  DW_TAG_member
    2015                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2016                            .dwattr $C$DW$189, DW_AT_name("ui16Index")
    2017                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ui16Index")
    2018                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2019                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2020                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2021                            .dwattr $C$DW$189, DW_AT_decl_line(0xa7)
    2022                            .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2023                    
    2024                    $C$DW$190       .dwtag  DW_TAG_member
    2025                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    2026                            .dwattr $C$DW$190, DW_AT_name("pCommands")
    2027                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("pCommands")
    2028                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   38

    2029                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2030                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2031                            .dwattr $C$DW$190, DW_AT_decl_line(0xac)
    2032                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    2033                    
    2034                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2035                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    2036                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2037                            .dwendtag $C$DW$T$32
    2038                    
    2039                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    2040                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    2041                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2042                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2043                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2044                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    2045                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2046                    
    2047                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2048                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2049                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2050                    
    2051                    
    2052                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2053                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    2054                    $C$DW$191       .dwtag  DW_TAG_member
    2055                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$34)
    2056                            .dwattr $C$DW$191, DW_AT_name("psI2CInst")
    2057                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("psI2CInst")
    2058                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2060                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2061                            .dwattr $C$DW$191, DW_AT_decl_line(0xf0)
    2062                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2063                    
    2064                    $C$DW$192       .dwtag  DW_TAG_member
    2065                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$35)
    2066                            .dwattr $C$DW$192, DW_AT_name("pui8Buffer")
    2067                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pui8Buffer")
    2068                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2069                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2070                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2071                            .dwattr $C$DW$192, DW_AT_decl_line(0xf5)
    2072                            .dwattr $C$DW$192, DW_AT_decl_column(0x0d)
    2073                    
    2074                    $C$DW$193       .dwtag  DW_TAG_member
    2075                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2076                            .dwattr $C$DW$193, DW_AT_name("ui8State")
    2077                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("ui8State")
    2078                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2079                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2080                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2081                            .dwattr $C$DW$193, DW_AT_decl_line(0xfa)
    2082                            .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    2083                    
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   39

    2084                    $C$DW$194       .dwtag  DW_TAG_member
    2085                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2086                            .dwattr $C$DW$194, DW_AT_name("ui8Addr")
    2087                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("ui8Addr")
    2088                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2089                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2090                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2091                            .dwattr $C$DW$194, DW_AT_decl_line(0xff)
    2092                            .dwattr $C$DW$194, DW_AT_decl_column(0x0d)
    2093                    
    2094                    $C$DW$195       .dwtag  DW_TAG_member
    2095                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2096                            .dwattr $C$DW$195, DW_AT_name("ui16Mask")
    2097                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ui16Mask")
    2098                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2099                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2100                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2101                            .dwattr $C$DW$195, DW_AT_decl_line(0x104)
    2102                            .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    2103                    
    2104                    $C$DW$196       .dwtag  DW_TAG_member
    2105                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2106                            .dwattr $C$DW$196, DW_AT_name("ui16Value")
    2107                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("ui16Value")
    2108                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2109                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2110                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2111                            .dwattr $C$DW$196, DW_AT_decl_line(0x109)
    2112                            .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    2113                    
    2114                    $C$DW$197       .dwtag  DW_TAG_member
    2115                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$28)
    2116                            .dwattr $C$DW$197, DW_AT_name("pfnCallback")
    2117                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("pfnCallback")
    2118                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2119                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2120                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2121                            .dwattr $C$DW$197, DW_AT_decl_line(0x10f)
    2122                            .dwattr $C$DW$197, DW_AT_decl_column(0x16)
    2123                    
    2124                    $C$DW$198       .dwtag  DW_TAG_member
    2125                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$3)
    2126                            .dwattr $C$DW$198, DW_AT_name("pvCallbackData")
    2127                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("pvCallbackData")
    2128                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2129                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2130                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2131                            .dwattr $C$DW$198, DW_AT_decl_line(0x114)
    2132                            .dwattr $C$DW$198, DW_AT_decl_column(0x0b)
    2133                    
    2134                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2135                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    2136                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2137                            .dwendtag $C$DW$T$36
    2138                    
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   40

    2139                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    2140                            .dwattr $C$DW$T$91, DW_AT_name("tI2CMReadModifyWrite16")
    2141                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$36)
    2142                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2143                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2144                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x116)
    2145                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    2146                    
    2147                    $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    2148                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    2149                            .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    2150                    
    2151                    
    2152                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2153                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    2154                    $C$DW$199       .dwtag  DW_TAG_member
    2155                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$34)
    2156                            .dwattr $C$DW$199, DW_AT_name("psI2CInst")
    2157                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("psI2CInst")
    2158                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2160                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2161                            .dwattr $C$DW$199, DW_AT_decl_line(0x123)
    2162                            .dwattr $C$DW$199, DW_AT_decl_column(0x14)
    2163                    
    2164                    $C$DW$200       .dwtag  DW_TAG_member
    2165                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$37)
    2166                            .dwattr $C$DW$200, DW_AT_name("pui8Buffer")
    2167                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("pui8Buffer")
    2168                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2169                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2170                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2171                            .dwattr $C$DW$200, DW_AT_decl_line(0x128)
    2172                            .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    2173                    
    2174                    $C$DW$201       .dwtag  DW_TAG_member
    2175                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2176                            .dwattr $C$DW$201, DW_AT_name("ui16Count")
    2177                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("ui16Count")
    2178                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2179                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2180                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2181                            .dwattr $C$DW$201, DW_AT_decl_line(0x12d)
    2182                            .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    2183                    
    2184                    $C$DW$202       .dwtag  DW_TAG_member
    2185                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2186                            .dwattr $C$DW$202, DW_AT_name("pui8Data")
    2187                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("pui8Data")
    2188                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2189                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2190                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2191                            .dwattr $C$DW$202, DW_AT_decl_line(0x132)
    2192                            .dwattr $C$DW$202, DW_AT_decl_column(0x14)
    2193                    
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   41

    2194                    $C$DW$203       .dwtag  DW_TAG_member
    2195                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$28)
    2196                            .dwattr $C$DW$203, DW_AT_name("pfnCallback")
    2197                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("pfnCallback")
    2198                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2199                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2200                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2201                            .dwattr $C$DW$203, DW_AT_decl_line(0x137)
    2202                            .dwattr $C$DW$203, DW_AT_decl_column(0x16)
    2203                    
    2204                    $C$DW$204       .dwtag  DW_TAG_member
    2205                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$3)
    2206                            .dwattr $C$DW$204, DW_AT_name("pvCallbackData")
    2207                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("pvCallbackData")
    2208                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2209                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2210                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2211                            .dwattr $C$DW$204, DW_AT_decl_line(0x13c)
    2212                            .dwattr $C$DW$204, DW_AT_decl_column(0x0b)
    2213                    
    2214                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2215                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x11e)
    2216                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2217                            .dwendtag $C$DW$T$38
    2218                    
    2219                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    2220                            .dwattr $C$DW$T$49, DW_AT_name("tI2CMWrite8")
    2221                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    2222                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2223                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2224                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x13e)
    2225                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    2226                    
    2227                    
    2228                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2229                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    2230                    $C$DW$205       .dwtag  DW_TAG_member
    2231                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$34)
    2232                            .dwattr $C$DW$205, DW_AT_name("psI2CInst")
    2233                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("psI2CInst")
    2234                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2235                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2236                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2237                            .dwattr $C$DW$205, DW_AT_decl_line(0xbc)
    2238                            .dwattr $C$DW$205, DW_AT_decl_column(0x14)
    2239                    
    2240                    $C$DW$206       .dwtag  DW_TAG_member
    2241                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$35)
    2242                            .dwattr $C$DW$206, DW_AT_name("pui8Buffer")
    2243                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pui8Buffer")
    2244                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2245                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2246                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2247                            .dwattr $C$DW$206, DW_AT_decl_line(0xc1)
    2248                            .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   42

    2249                    
    2250                    $C$DW$207       .dwtag  DW_TAG_member
    2251                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2252                            .dwattr $C$DW$207, DW_AT_name("ui8State")
    2253                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("ui8State")
    2254                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2255                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2256                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2257                            .dwattr $C$DW$207, DW_AT_decl_line(0xc6)
    2258                            .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    2259                    
    2260                    $C$DW$208       .dwtag  DW_TAG_member
    2261                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2262                            .dwattr $C$DW$208, DW_AT_name("ui8Addr")
    2263                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("ui8Addr")
    2264                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2265                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2266                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2267                            .dwattr $C$DW$208, DW_AT_decl_line(0xcb)
    2268                            .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    2269                    
    2270                    $C$DW$209       .dwtag  DW_TAG_member
    2271                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2272                            .dwattr $C$DW$209, DW_AT_name("ui8Mask")
    2273                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("ui8Mask")
    2274                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2275                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2276                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2277                            .dwattr $C$DW$209, DW_AT_decl_line(0xd0)
    2278                            .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    2279                    
    2280                    $C$DW$210       .dwtag  DW_TAG_member
    2281                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2282                            .dwattr $C$DW$210, DW_AT_name("ui8Value")
    2283                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("ui8Value")
    2284                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2285                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2286                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2287                            .dwattr $C$DW$210, DW_AT_decl_line(0xd5)
    2288                            .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    2289                    
    2290                    $C$DW$211       .dwtag  DW_TAG_member
    2291                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$28)
    2292                            .dwattr $C$DW$211, DW_AT_name("pfnCallback")
    2293                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("pfnCallback")
    2294                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2295                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2296                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2297                            .dwattr $C$DW$211, DW_AT_decl_line(0xdb)
    2298                            .dwattr $C$DW$211, DW_AT_decl_column(0x16)
    2299                    
    2300                    $C$DW$212       .dwtag  DW_TAG_member
    2301                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$3)
    2302                            .dwattr $C$DW$212, DW_AT_name("pvCallbackData")
    2303                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("pvCallbackData")
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   43

    2304                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2305                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2306                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2307                            .dwattr $C$DW$212, DW_AT_decl_line(0xe0)
    2308                            .dwattr $C$DW$212, DW_AT_decl_column(0x0b)
    2309                    
    2310                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2311                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xb7)
    2312                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2313                            .dwendtag $C$DW$T$39
    2314                    
    2315                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    2316                            .dwattr $C$DW$T$50, DW_AT_name("tI2CMReadModifyWrite8")
    2317                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    2318                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2319                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2320                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe2)
    2321                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2322                    
    2323                    
    2324                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2325                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x2c)
    2326                    $C$DW$213       .dwtag  DW_TAG_member
    2327                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$34)
    2328                            .dwattr $C$DW$213, DW_AT_name("psI2CInst")
    2329                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("psI2CInst")
    2330                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2331                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2332                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2333                            .dwattr $C$DW$213, DW_AT_decl_line(0x32)
    2334                            .dwattr $C$DW$213, DW_AT_decl_column(0x14)
    2335                    
    2336                    $C$DW$214       .dwtag  DW_TAG_member
    2337                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2338                            .dwattr $C$DW$214, DW_AT_name("ui8Addr")
    2339                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("ui8Addr")
    2340                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2341                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2342                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2343                            .dwattr $C$DW$214, DW_AT_decl_line(0x37)
    2344                            .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    2345                    
    2346                    $C$DW$215       .dwtag  DW_TAG_member
    2347                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2348                            .dwattr $C$DW$215, DW_AT_name("ui8State")
    2349                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("ui8State")
    2350                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2351                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2352                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2353                            .dwattr $C$DW$215, DW_AT_decl_line(0x3c)
    2354                            .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    2355                    
    2356                    $C$DW$216       .dwtag  DW_TAG_member
    2357                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$40)
    2358                            .dwattr $C$DW$216, DW_AT_name("pui8Data")
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   44

    2359                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("pui8Data")
    2360                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2361                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2362                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2363                            .dwattr $C$DW$216, DW_AT_decl_line(0x41)
    2364                            .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    2365                    
    2366                    $C$DW$217       .dwtag  DW_TAG_member
    2367                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$28)
    2368                            .dwattr $C$DW$217, DW_AT_name("pfnCallback")
    2369                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("pfnCallback")
    2370                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2371                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2372                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2373                            .dwattr $C$DW$217, DW_AT_decl_line(0x47)
    2374                            .dwattr $C$DW$217, DW_AT_decl_column(0x16)
    2375                    
    2376                    $C$DW$218       .dwtag  DW_TAG_member
    2377                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$3)
    2378                            .dwattr $C$DW$218, DW_AT_name("pvCallbackData")
    2379                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("pvCallbackData")
    2380                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2381                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2382                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2383                            .dwattr $C$DW$218, DW_AT_decl_line(0x4c)
    2384                            .dwattr $C$DW$218, DW_AT_decl_column(0x0b)
    2385                    
    2386                    $C$DW$219       .dwtag  DW_TAG_member
    2387                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$51)
    2388                            .dwattr $C$DW$219, DW_AT_name("uCommand")
    2389                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("uCommand")
    2390                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2391                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2392                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2393                            .dwattr $C$DW$219, DW_AT_decl_line(0x64)
    2394                            .dwattr $C$DW$219, DW_AT_decl_column(0x05)
    2395                    
    2396                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2397                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2d)
    2398                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2399                            .dwendtag $C$DW$T$41
    2400                    
    2401                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    2402                            .dwattr $C$DW$T$42, DW_AT_name("tAK8975")
    2403                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2404                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2405                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2406                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x66)
    2407                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2408                    
    2409                    
    2410                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2411                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x6c)
    2412                    $C$DW$220       .dwtag  DW_TAG_member
    2413                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$34)
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   45

    2414                            .dwattr $C$DW$220, DW_AT_name("psI2CInst")
    2415                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("psI2CInst")
    2416                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2418                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2419                            .dwattr $C$DW$220, DW_AT_decl_line(0x33)
    2420                            .dwattr $C$DW$220, DW_AT_decl_column(0x14)
    2421                    
    2422                    $C$DW$221       .dwtag  DW_TAG_member
    2423                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$42)
    2424                            .dwattr $C$DW$221, DW_AT_name("sAK8975Inst")
    2425                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("sAK8975Inst")
    2426                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2427                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2428                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2429                            .dwattr $C$DW$221, DW_AT_decl_line(0x38)
    2430                            .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    2431                    
    2432                    $C$DW$222       .dwtag  DW_TAG_member
    2433                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2434                            .dwattr $C$DW$222, DW_AT_name("ui8Addr")
    2435                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("ui8Addr")
    2436                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2437                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2438                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2439                            .dwattr $C$DW$222, DW_AT_decl_line(0x3d)
    2440                            .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    2441                    
    2442                    $C$DW$223       .dwtag  DW_TAG_member
    2443                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2444                            .dwattr $C$DW$223, DW_AT_name("ui8State")
    2445                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("ui8State")
    2446                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2447                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2448                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2449                            .dwattr $C$DW$223, DW_AT_decl_line(0x42)
    2450                            .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    2451                    
    2452                    $C$DW$224       .dwtag  DW_TAG_member
    2453                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2454                            .dwattr $C$DW$224, DW_AT_name("ui8AccelAfsSel")
    2455                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2456                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2457                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2458                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2459                            .dwattr $C$DW$224, DW_AT_decl_line(0x47)
    2460                            .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    2461                    
    2462                    $C$DW$225       .dwtag  DW_TAG_member
    2463                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2464                            .dwattr $C$DW$225, DW_AT_name("ui8NewAccelAfsSel")
    2465                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2466                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2467                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2468                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   46

    2469                            .dwattr $C$DW$225, DW_AT_decl_line(0x4d)
    2470                            .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    2471                    
    2472                    $C$DW$226       .dwtag  DW_TAG_member
    2473                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2474                            .dwattr $C$DW$226, DW_AT_name("ui8GyroFsSel")
    2475                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2476                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2477                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2478                            .dwattr $C$DW$226, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2479                            .dwattr $C$DW$226, DW_AT_decl_line(0x52)
    2480                            .dwattr $C$DW$226, DW_AT_decl_column(0x0d)
    2481                    
    2482                    $C$DW$227       .dwtag  DW_TAG_member
    2483                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2484                            .dwattr $C$DW$227, DW_AT_name("ui8NewGyroFsSel")
    2485                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2486                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2487                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2488                            .dwattr $C$DW$227, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2489                            .dwattr $C$DW$227, DW_AT_decl_line(0x58)
    2490                            .dwattr $C$DW$227, DW_AT_decl_column(0x0d)
    2491                    
    2492                    $C$DW$228       .dwtag  DW_TAG_member
    2493                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$43)
    2494                            .dwattr $C$DW$228, DW_AT_name("pui8Data")
    2495                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("pui8Data")
    2496                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2497                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2498                            .dwattr $C$DW$228, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2499                            .dwattr $C$DW$228, DW_AT_decl_line(0x5d)
    2500                            .dwattr $C$DW$228, DW_AT_decl_column(0x0d)
    2501                    
    2502                    $C$DW$229       .dwtag  DW_TAG_member
    2503                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$28)
    2504                            .dwattr $C$DW$229, DW_AT_name("pfnCallback")
    2505                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("pfnCallback")
    2506                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2507                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2508                            .dwattr $C$DW$229, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2509                            .dwattr $C$DW$229, DW_AT_decl_line(0x63)
    2510                            .dwattr $C$DW$229, DW_AT_decl_column(0x16)
    2511                    
    2512                    $C$DW$230       .dwtag  DW_TAG_member
    2513                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$3)
    2514                            .dwattr $C$DW$230, DW_AT_name("pvCallbackData")
    2515                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("pvCallbackData")
    2516                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2517                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2518                            .dwattr $C$DW$230, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2519                            .dwattr $C$DW$230, DW_AT_decl_line(0x68)
    2520                            .dwattr $C$DW$230, DW_AT_decl_column(0x0b)
    2521                    
    2522                    $C$DW$231       .dwtag  DW_TAG_member
    2523                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$53)
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   47

    2524                            .dwattr $C$DW$231, DW_AT_name("uCommand")
    2525                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("uCommand")
    2526                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2527                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2528                            .dwattr $C$DW$231, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2529                            .dwattr $C$DW$231, DW_AT_decl_line(0x80)
    2530                            .dwattr $C$DW$231, DW_AT_decl_column(0x05)
    2531                    
    2532                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2533                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
    2534                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2535                            .dwendtag $C$DW$T$44
    2536                    
    2537                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    2538                            .dwattr $C$DW$T$93, DW_AT_name("tMPU9150")
    2539                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$44)
    2540                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2541                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2542                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x82)
    2543                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2544                    
    2545                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    2546                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2547                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    2548                    
    2549                    
    2550                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2551                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    2552                    $C$DW$232       .dwtag  DW_TAG_member
    2553                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$10)
    2554                            .dwattr $C$DW$232, DW_AT_name("fd")
    2555                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("fd")
    2556                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2558                            .dwattr $C$DW$232, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2559                            .dwattr $C$DW$232, DW_AT_decl_line(0x5c)
    2560                            .dwattr $C$DW$232, DW_AT_decl_column(0x0b)
    2561                    
    2562                    $C$DW$233       .dwtag  DW_TAG_member
    2563                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$45)
    2564                            .dwattr $C$DW$233, DW_AT_name("buf")
    2565                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("buf")
    2566                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2567                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2568                            .dwattr $C$DW$233, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2569                            .dwattr $C$DW$233, DW_AT_decl_line(0x5d)
    2570                            .dwattr $C$DW$233, DW_AT_decl_column(0x16)
    2571                    
    2572                    $C$DW$234       .dwtag  DW_TAG_member
    2573                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$45)
    2574                            .dwattr $C$DW$234, DW_AT_name("pos")
    2575                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("pos")
    2576                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2577                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2578                            .dwattr $C$DW$234, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   48

    2579                            .dwattr $C$DW$234, DW_AT_decl_line(0x5e)
    2580                            .dwattr $C$DW$234, DW_AT_decl_column(0x16)
    2581                    
    2582                    $C$DW$235       .dwtag  DW_TAG_member
    2583                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$45)
    2584                            .dwattr $C$DW$235, DW_AT_name("bufend")
    2585                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("bufend")
    2586                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2587                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2588                            .dwattr $C$DW$235, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2589                            .dwattr $C$DW$235, DW_AT_decl_line(0x5f)
    2590                            .dwattr $C$DW$235, DW_AT_decl_column(0x16)
    2591                    
    2592                    $C$DW$236       .dwtag  DW_TAG_member
    2593                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$45)
    2594                            .dwattr $C$DW$236, DW_AT_name("buff_stop")
    2595                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("buff_stop")
    2596                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2597                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2598                            .dwattr $C$DW$236, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2599                            .dwattr $C$DW$236, DW_AT_decl_line(0x60)
    2600                            .dwattr $C$DW$236, DW_AT_decl_column(0x16)
    2601                    
    2602                    $C$DW$237       .dwtag  DW_TAG_member
    2603                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$11)
    2604                            .dwattr $C$DW$237, DW_AT_name("flags")
    2605                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("flags")
    2606                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2607                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2608                            .dwattr $C$DW$237, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2609                            .dwattr $C$DW$237, DW_AT_decl_line(0x61)
    2610                            .dwattr $C$DW$237, DW_AT_decl_column(0x16)
    2611                    
    2612                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2613                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x5b)
    2614                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2615                            .dwendtag $C$DW$T$46
    2616                    
    2617                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    2618                            .dwattr $C$DW$T$95, DW_AT_name("FILE")
    2619                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$46)
    2620                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2621                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2622                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x62)
    2623                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2624                    
    2625                    
    2626                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2627                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x14)
    2628                    $C$DW$238       .dwtag  DW_TAG_member
    2629                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$34)
    2630                            .dwattr $C$DW$238, DW_AT_name("psI2CInst")
    2631                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("psI2CInst")
    2632                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   49

    2634                            .dwattr $C$DW$238, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2635                            .dwattr $C$DW$238, DW_AT_decl_line(0x14c)
    2636                            .dwattr $C$DW$238, DW_AT_decl_column(0x14)
    2637                    
    2638                    $C$DW$239       .dwtag  DW_TAG_member
    2639                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$23)
    2640                            .dwattr $C$DW$239, DW_AT_name("pui8Data")
    2641                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("pui8Data")
    2642                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2643                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2644                            .dwattr $C$DW$239, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2645                            .dwattr $C$DW$239, DW_AT_decl_line(0x151)
    2646                            .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    2647                    
    2648                    $C$DW$240       .dwtag  DW_TAG_member
    2649                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
    2650                            .dwattr $C$DW$240, DW_AT_name("ui16Count")
    2651                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("ui16Count")
    2652                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2653                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2654                            .dwattr $C$DW$240, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2655                            .dwattr $C$DW$240, DW_AT_decl_line(0x156)
    2656                            .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    2657                    
    2658                    $C$DW$241       .dwtag  DW_TAG_member
    2659                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$28)
    2660                            .dwattr $C$DW$241, DW_AT_name("pfnCallback")
    2661                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("pfnCallback")
    2662                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2663                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2664                            .dwattr $C$DW$241, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2665                            .dwattr $C$DW$241, DW_AT_decl_line(0x15b)
    2666                            .dwattr $C$DW$241, DW_AT_decl_column(0x16)
    2667                    
    2668                    $C$DW$242       .dwtag  DW_TAG_member
    2669                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$3)
    2670                            .dwattr $C$DW$242, DW_AT_name("pvCallbackData")
    2671                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("pvCallbackData")
    2672                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2673                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2674                            .dwattr $C$DW$242, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2675                            .dwattr $C$DW$242, DW_AT_decl_line(0x160)
    2676                            .dwattr $C$DW$242, DW_AT_decl_column(0x0b)
    2677                    
    2678                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2679                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x147)
    2680                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2681                            .dwendtag $C$DW$T$47
    2682                    
    2683                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2684                            .dwattr $C$DW$T$96, DW_AT_name("tI2CMRead16BE")
    2685                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$47)
    2686                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2687                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2688                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x162)
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   50

    2689                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    2690                    
    2691                    
    2692                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2693                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x14)
    2694                    $C$DW$243       .dwtag  DW_TAG_member
    2695                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$34)
    2696                            .dwattr $C$DW$243, DW_AT_name("psI2CInst")
    2697                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("psI2CInst")
    2698                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2700                            .dwattr $C$DW$243, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2701                            .dwattr $C$DW$243, DW_AT_decl_line(0x170)
    2702                            .dwattr $C$DW$243, DW_AT_decl_column(0x14)
    2703                    
    2704                    $C$DW$244       .dwtag  DW_TAG_member
    2705                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$37)
    2706                            .dwattr $C$DW$244, DW_AT_name("pui8Buffer")
    2707                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("pui8Buffer")
    2708                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2709                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2710                            .dwattr $C$DW$244, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2711                            .dwattr $C$DW$244, DW_AT_decl_line(0x175)
    2712                            .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    2713                    
    2714                    $C$DW$245       .dwtag  DW_TAG_member
    2715                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$22)
    2716                            .dwattr $C$DW$245, DW_AT_name("ui16Count")
    2717                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("ui16Count")
    2718                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2719                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2720                            .dwattr $C$DW$245, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2721                            .dwattr $C$DW$245, DW_AT_decl_line(0x17a)
    2722                            .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    2723                    
    2724                    $C$DW$246       .dwtag  DW_TAG_member
    2725                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    2726                            .dwattr $C$DW$246, DW_AT_name("pui8Data")
    2727                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("pui8Data")
    2728                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2729                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2730                            .dwattr $C$DW$246, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2731                            .dwattr $C$DW$246, DW_AT_decl_line(0x17f)
    2732                            .dwattr $C$DW$246, DW_AT_decl_column(0x14)
    2733                    
    2734                    $C$DW$247       .dwtag  DW_TAG_member
    2735                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$28)
    2736                            .dwattr $C$DW$247, DW_AT_name("pfnCallback")
    2737                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("pfnCallback")
    2738                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2739                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2740                            .dwattr $C$DW$247, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2741                            .dwattr $C$DW$247, DW_AT_decl_line(0x184)
    2742                            .dwattr $C$DW$247, DW_AT_decl_column(0x16)
    2743                    
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   51

    2744                    $C$DW$248       .dwtag  DW_TAG_member
    2745                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$3)
    2746                            .dwattr $C$DW$248, DW_AT_name("pvCallbackData")
    2747                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("pvCallbackData")
    2748                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2749                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2750                            .dwattr $C$DW$248, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2751                            .dwattr $C$DW$248, DW_AT_decl_line(0x189)
    2752                            .dwattr $C$DW$248, DW_AT_decl_column(0x0b)
    2753                    
    2754                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2755                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x16b)
    2756                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2757                            .dwendtag $C$DW$T$48
    2758                    
    2759                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    2760                            .dwattr $C$DW$T$97, DW_AT_name("tI2CMWrite16BE")
    2761                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$48)
    2762                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2763                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2764                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x18b)
    2765                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    2766                    
    2767                    
    2768                    $C$DW$T$51      .dwtag  DW_TAG_union_type
    2769                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x14)
    2770                    $C$DW$249       .dwtag  DW_TAG_member
    2771                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$37)
    2772                            .dwattr $C$DW$249, DW_AT_name("pui8Buffer")
    2773                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("pui8Buffer")
    2774                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2776                            .dwattr $C$DW$249, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2777                            .dwattr $C$DW$249, DW_AT_decl_line(0x58)
    2778                            .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    2779                    
    2780                    $C$DW$250       .dwtag  DW_TAG_member
    2781                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$49)
    2782                            .dwattr $C$DW$250, DW_AT_name("sWriteState")
    2783                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("sWriteState")
    2784                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2785                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2786                            .dwattr $C$DW$250, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2787                            .dwattr $C$DW$250, DW_AT_decl_line(0x5d)
    2788                            .dwattr $C$DW$250, DW_AT_decl_column(0x15)
    2789                    
    2790                    $C$DW$251       .dwtag  DW_TAG_member
    2791                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$50)
    2792                            .dwattr $C$DW$251, DW_AT_name("sReadModifyWriteState")
    2793                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2794                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2795                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2796                            .dwattr $C$DW$251, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2797                            .dwattr $C$DW$251, DW_AT_decl_line(0x62)
    2798                            .dwattr $C$DW$251, DW_AT_decl_column(0x1f)
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   52

    2799                    
    2800                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2801                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x54)
    2802                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
    2803                            .dwendtag $C$DW$T$51
    2804                    
    2805                    
    2806                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    2807                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    2808                    $C$DW$252       .dwtag  DW_TAG_member
    2809                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$52)
    2810                            .dwattr $C$DW$252, DW_AT_name("pui8Buffer")
    2811                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("pui8Buffer")
    2812                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2814                            .dwattr $C$DW$252, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2815                            .dwattr $C$DW$252, DW_AT_decl_line(0x74)
    2816                            .dwattr $C$DW$252, DW_AT_decl_column(0x11)
    2817                    
    2818                    $C$DW$253       .dwtag  DW_TAG_member
    2819                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$49)
    2820                            .dwattr $C$DW$253, DW_AT_name("sWriteState")
    2821                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("sWriteState")
    2822                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2823                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2824                            .dwattr $C$DW$253, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2825                            .dwattr $C$DW$253, DW_AT_decl_line(0x79)
    2826                            .dwattr $C$DW$253, DW_AT_decl_column(0x15)
    2827                    
    2828                    $C$DW$254       .dwtag  DW_TAG_member
    2829                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$50)
    2830                            .dwattr $C$DW$254, DW_AT_name("sReadModifyWriteState")
    2831                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2832                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2834                            .dwattr $C$DW$254, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2835                            .dwattr $C$DW$254, DW_AT_decl_line(0x7e)
    2836                            .dwattr $C$DW$254, DW_AT_decl_column(0x1f)
    2837                    
    2838                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2839                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x70)
    2840                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    2841                            .dwendtag $C$DW$T$53
    2842                    
    2843                    
    2844                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2845                            .dwattr $C$DW$T$55, DW_AT_name("HeapRegion")
    2846                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    2847                    $C$DW$255       .dwtag  DW_TAG_member
    2848                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$23)
    2849                            .dwattr $C$DW$255, DW_AT_name("pucStartAddress")
    2850                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("pucStartAddress")
    2851                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2852                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2853                            .dwattr $C$DW$255, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   53

    2854                            .dwattr $C$DW$255, DW_AT_decl_line(0x96)
    2855                            .dwattr $C$DW$255, DW_AT_decl_column(0x0b)
    2856                    
    2857                    $C$DW$256       .dwtag  DW_TAG_member
    2858                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$54)
    2859                            .dwattr $C$DW$256, DW_AT_name("xSizeInBytes")
    2860                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("xSizeInBytes")
    2861                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2862                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2863                            .dwattr $C$DW$256, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2864                            .dwattr $C$DW$256, DW_AT_decl_line(0x97)
    2865                            .dwattr $C$DW$256, DW_AT_decl_column(0x09)
    2866                    
    2867                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2868                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x94)
    2869                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    2870                            .dwendtag $C$DW$T$55
    2871                    
    2872                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2873                            .dwattr $C$DW$T$98, DW_AT_name("HeapRegion_t")
    2874                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$55)
    2875                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2876                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2877                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x98)
    2878                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    2879                    
    2880                    
    2881                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2882                            .dwattr $C$DW$T$56, DW_AT_name("ReportData_Item")
    2883                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x18)
    2884                    $C$DW$257       .dwtag  DW_TAG_member
    2885                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$24)
    2886                            .dwattr $C$DW$257, DW_AT_name("TimeStamp")
    2887                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("TimeStamp")
    2888                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2889                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2890                            .dwattr $C$DW$257, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2891                            .dwattr $C$DW$257, DW_AT_decl_line(0x20)
    2892                            .dwattr $C$DW$257, DW_AT_decl_column(0x2b)
    2893                    
    2894                    $C$DW$258       .dwtag  DW_TAG_member
    2895                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$24)
    2896                            .dwattr $C$DW$258, DW_AT_name("ReportName")
    2897                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("ReportName")
    2898                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2899                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2900                            .dwattr $C$DW$258, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2901                            .dwattr $C$DW$258, DW_AT_decl_line(0x21)
    2902                            .dwattr $C$DW$258, DW_AT_decl_column(0x13)
    2903                    
    2904                    $C$DW$259       .dwtag  DW_TAG_member
    2905                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$24)
    2906                            .dwattr $C$DW$259, DW_AT_name("ReportValue_0")
    2907                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("ReportValue_0")
    2908                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v15.12.1 Thu Oct 27 13:57:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   54

    2909                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2910                            .dwattr $C$DW$259, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2911                            .dwattr $C$DW$259, DW_AT_decl_line(0x22)
    2912                            .dwattr $C$DW$259, DW_AT_decl_column(0x13)
    2913                    
    2914                    $C$DW$260       .dwtag  DW_TAG_member
    2915                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$24)
    2916                            .dwattr $C$DW$260, DW_AT_name("ReportValue_1")
    2917                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("ReportValue_1")
    2918                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2919                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2920                            .dwattr $C$DW$260, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2921                            .dwattr $C$DW$260, DW_AT_decl_line(0x23)
    2922                            .dwattr $C$DW$260, DW_AT_decl_column(0x13)
    2923                    
    2924                    $C$DW$261       .dwtag  DW_TAG_member
    2925                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$24)
    2926                            .dwattr $C$DW$261, DW_AT_name("ReportValue_2")
    2927                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("ReportValue_2")
    2928                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2929                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2930                            .dwattr $C$DW$261, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2931                            .dwattr $C$DW$261, DW_AT_decl_line(0x24)
    2932                            .dwattr $C$DW$261, DW_AT_decl_column(0x13)
    2933                    
    2934                    $C$DW$262       .dwtag  DW_TAG_member
