TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Thu Nov 03 12:53:12 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/Task_gyro.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("I2CMCommand")

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   33

    1761                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1762                            .dwattr $C$DW$166, DW_AT_decl_line(0x7e)
    1763                            .dwattr $C$DW$166, DW_AT_decl_column(0x02)
    1764                    
    1765                    $C$DW$167       .dwtag  DW_TAG_enumerator
    1766                            .dwattr $C$DW$167, DW_AT_name("eSetValueWithOverwrite")
    1767                            .dwattr $C$DW$167, DW_AT_const_value(0x03)
    1768                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1769                            .dwattr $C$DW$167, DW_AT_decl_line(0x7f)
    1770                            .dwattr $C$DW$167, DW_AT_decl_column(0x02)
    1771                    
    1772                    $C$DW$168       .dwtag  DW_TAG_enumerator
    1773                            .dwattr $C$DW$168, DW_AT_name("eSetValueWithoutOverwrite")
    1774                            .dwattr $C$DW$168, DW_AT_const_value(0x04)
    1775                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1776                            .dwattr $C$DW$168, DW_AT_decl_line(0x80)
    1777                            .dwattr $C$DW$168, DW_AT_decl_column(0x02)
    1778                    
    1779                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1780                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x7b)
    1781                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    1782                            .dwendtag $C$DW$T$87
    1783                    
    1784                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    1785                            .dwattr $C$DW$T$88, DW_AT_name("eNotifyAction")
    1786                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1787                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1788                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1789                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x81)
    1790                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1791                    
    1792                    
    1793                    $C$DW$T$89      .dwtag  DW_TAG_enumeration_type
    1794                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
    1795                    $C$DW$169       .dwtag  DW_TAG_enumerator
    1796                            .dwattr $C$DW$169, DW_AT_name("eAbortSleep")
    1797                            .dwattr $C$DW$169, DW_AT_const_value(0x00)
    1798                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1799                            .dwattr $C$DW$169, DW_AT_decl_line(0xb5)
    1800                            .dwattr $C$DW$169, DW_AT_decl_column(0x02)
    1801                    
    1802                    $C$DW$170       .dwtag  DW_TAG_enumerator
    1803                            .dwattr $C$DW$170, DW_AT_name("eStandardSleep")
    1804                            .dwattr $C$DW$170, DW_AT_const_value(0x01)
    1805                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1806                            .dwattr $C$DW$170, DW_AT_decl_line(0xb6)
    1807                            .dwattr $C$DW$170, DW_AT_decl_column(0x02)
    1808                    
    1809                    $C$DW$171       .dwtag  DW_TAG_enumerator
    1810                            .dwattr $C$DW$171, DW_AT_name("eNoTasksWaitingTimeout")
    1811                            .dwattr $C$DW$171, DW_AT_const_value(0x02)
    1812                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1813                            .dwattr $C$DW$171, DW_AT_decl_line(0xb7)
    1814                            .dwattr $C$DW$171, DW_AT_decl_column(0x02)
    1815                    
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   34

    1816                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1817                            .dwattr $C$DW$T$89, DW_AT_decl_line(0xb4)
    1818                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x01)
    1819                            .dwendtag $C$DW$T$89
    1820                    
    1821                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    1822                            .dwattr $C$DW$T$90, DW_AT_name("eSleepModeStatus")
    1823                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1824                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1825                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1826                            .dwattr $C$DW$T$90, DW_AT_decl_line(0xb8)
    1827                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1828                    
    1829                    
    1830                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1831                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1832                    $C$DW$172       .dwtag  DW_TAG_member
    1833                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1834                            .dwattr $C$DW$172, DW_AT_name("ui8Addr")
    1835                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui8Addr")
    1836                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1837                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1838                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1839                            .dwattr $C$DW$172, DW_AT_decl_line(0x4c)
    1840                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    1841                    
    1842                    $C$DW$173       .dwtag  DW_TAG_member
    1843                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    1844                            .dwattr $C$DW$173, DW_AT_name("pui8WriteData")
    1845                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("pui8WriteData")
    1846                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1847                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1848                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1849                            .dwattr $C$DW$173, DW_AT_decl_line(0x51)
    1850                            .dwattr $C$DW$173, DW_AT_decl_column(0x14)
    1851                    
    1852                    $C$DW$174       .dwtag  DW_TAG_member
    1853                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    1854                            .dwattr $C$DW$174, DW_AT_name("ui16WriteCount")
    1855                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui16WriteCount")
    1856                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1857                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1858                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1859                            .dwattr $C$DW$174, DW_AT_decl_line(0x56)
    1860                            .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    1861                    
    1862                    $C$DW$175       .dwtag  DW_TAG_member
    1863                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    1864                            .dwattr $C$DW$175, DW_AT_name("ui16WriteBatchSize")
    1865                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1866                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1867                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1868                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1869                            .dwattr $C$DW$175, DW_AT_decl_line(0x5b)
    1870                            .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   35

    1871                    
    1872                    $C$DW$176       .dwtag  DW_TAG_member
    1873                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
    1874                            .dwattr $C$DW$176, DW_AT_name("pui8ReadData")
    1875                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("pui8ReadData")
    1876                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1877                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1878                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1879                            .dwattr $C$DW$176, DW_AT_decl_line(0x60)
    1880                            .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    1881                    
    1882                    $C$DW$177       .dwtag  DW_TAG_member
    1883                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    1884                            .dwattr $C$DW$177, DW_AT_name("ui16ReadCount")
    1885                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("ui16ReadCount")
    1886                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1887                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1888                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1889                            .dwattr $C$DW$177, DW_AT_decl_line(0x65)
    1890                            .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    1891                    
    1892                    $C$DW$178       .dwtag  DW_TAG_member
    1893                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    1894                            .dwattr $C$DW$178, DW_AT_name("ui16ReadBatchSize")
    1895                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1896                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1897                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1898                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1899                            .dwattr $C$DW$178, DW_AT_decl_line(0x6a)
    1900                            .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    1901                    
    1902                    $C$DW$179       .dwtag  DW_TAG_member
    1903                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$28)
    1904                            .dwattr $C$DW$179, DW_AT_name("pfnCallback")
    1905                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("pfnCallback")
    1906                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1907                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1908                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1909                            .dwattr $C$DW$179, DW_AT_decl_line(0x6f)
    1910                            .dwattr $C$DW$179, DW_AT_decl_column(0x16)
    1911                    
    1912                    $C$DW$180       .dwtag  DW_TAG_member
    1913                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$3)
    1914                            .dwattr $C$DW$180, DW_AT_name("pvCallbackData")
    1915                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("pvCallbackData")
    1916                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1917                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1918                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1919                            .dwattr $C$DW$180, DW_AT_decl_line(0x74)
    1920                            .dwattr $C$DW$180, DW_AT_decl_column(0x0b)
    1921                    
    1922                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1923                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1924                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1925                            .dwendtag $C$DW$T$29
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   36

    1926                    
    1927                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1928                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1929                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1930                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1931                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1932                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1933                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1934                    
    1935                    
    1936                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1937                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1938                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1939                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1940                    $C$DW$181       .dwtag  DW_TAG_subrange_type
    1941                            .dwattr $C$DW$181, DW_AT_upper_bound(0x09)
    1942                    
    1943                            .dwendtag $C$DW$T$31
    1944                    
    1945                    
    1946                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1947                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1948                    $C$DW$182       .dwtag  DW_TAG_member
    1949                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$24)
    1950                            .dwattr $C$DW$182, DW_AT_name("ui32Base")
    1951                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui32Base")
    1952                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1954                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1955                            .dwattr $C$DW$182, DW_AT_decl_line(0x82)
    1956                            .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    1957                    
    1958                    $C$DW$183       .dwtag  DW_TAG_member
    1959                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1960                            .dwattr $C$DW$183, DW_AT_name("ui8Int")
    1961                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui8Int")
    1962                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1963                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1964                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1965                            .dwattr $C$DW$183, DW_AT_decl_line(0x87)
    1966                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    1967                    
    1968                    $C$DW$184       .dwtag  DW_TAG_member
    1969                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1970                            .dwattr $C$DW$184, DW_AT_name("ui8TxDMA")
    1971                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ui8TxDMA")
    1972                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1973                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1974                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1975                            .dwattr $C$DW$184, DW_AT_decl_line(0x8c)
    1976                            .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    1977                    
    1978                    $C$DW$185       .dwtag  DW_TAG_member
    1979                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1980                            .dwattr $C$DW$185, DW_AT_name("ui8RxDMA")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   37

    1981                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("ui8RxDMA")
    1982                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1983                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1984                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1985                            .dwattr $C$DW$185, DW_AT_decl_line(0x91)
    1986                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    1987                    
    1988                    $C$DW$186       .dwtag  DW_TAG_member
    1989                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1990                            .dwattr $C$DW$186, DW_AT_name("ui8State")
    1991                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("ui8State")
    1992                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1993                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1994                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1995                            .dwattr $C$DW$186, DW_AT_decl_line(0x96)
    1996                            .dwattr $C$DW$186, DW_AT_decl_column(0x0d)
    1997                    
    1998                    $C$DW$187       .dwtag  DW_TAG_member
    1999                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2000                            .dwattr $C$DW$187, DW_AT_name("ui8ReadPtr")
    2001                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("ui8ReadPtr")
    2002                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2003                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2004                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2005                            .dwattr $C$DW$187, DW_AT_decl_line(0x9c)
    2006                            .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    2007                    
    2008                    $C$DW$188       .dwtag  DW_TAG_member
    2009                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2010                            .dwattr $C$DW$188, DW_AT_name("ui8WritePtr")
    2011                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ui8WritePtr")
    2012                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2013                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2014                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2015                            .dwattr $C$DW$188, DW_AT_decl_line(0xa2)
    2016                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    2017                    
    2018                    $C$DW$189       .dwtag  DW_TAG_member
    2019                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2020                            .dwattr $C$DW$189, DW_AT_name("ui16Index")
    2021                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ui16Index")
    2022                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2023                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2024                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2025                            .dwattr $C$DW$189, DW_AT_decl_line(0xa7)
    2026                            .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2027                    
    2028                    $C$DW$190       .dwtag  DW_TAG_member
    2029                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    2030                            .dwattr $C$DW$190, DW_AT_name("pCommands")
    2031                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("pCommands")
    2032                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2033                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2034                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2035                            .dwattr $C$DW$190, DW_AT_decl_line(0xac)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   38

    2036                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    2037                    
    2038                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2039                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    2040                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2041                            .dwendtag $C$DW$T$32
    2042                    
    2043                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    2044                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    2045                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2046                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2047                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2048                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    2049                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2050                    
    2051                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2052                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2053                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2054                    
    2055                    
    2056                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2057                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    2058                    $C$DW$191       .dwtag  DW_TAG_member
    2059                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$34)
    2060                            .dwattr $C$DW$191, DW_AT_name("psI2CInst")
    2061                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("psI2CInst")
    2062                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2063                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2064                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2065                            .dwattr $C$DW$191, DW_AT_decl_line(0xf0)
    2066                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2067                    
    2068                    $C$DW$192       .dwtag  DW_TAG_member
    2069                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$35)
    2070                            .dwattr $C$DW$192, DW_AT_name("pui8Buffer")
    2071                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pui8Buffer")
    2072                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2073                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2074                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2075                            .dwattr $C$DW$192, DW_AT_decl_line(0xf5)
    2076                            .dwattr $C$DW$192, DW_AT_decl_column(0x0d)
    2077                    
    2078                    $C$DW$193       .dwtag  DW_TAG_member
    2079                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2080                            .dwattr $C$DW$193, DW_AT_name("ui8State")
    2081                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("ui8State")
    2082                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2083                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2084                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2085                            .dwattr $C$DW$193, DW_AT_decl_line(0xfa)
    2086                            .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    2087                    
    2088                    $C$DW$194       .dwtag  DW_TAG_member
    2089                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2090                            .dwattr $C$DW$194, DW_AT_name("ui8Addr")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   39

    2091                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("ui8Addr")
    2092                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2093                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2094                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2095                            .dwattr $C$DW$194, DW_AT_decl_line(0xff)
    2096                            .dwattr $C$DW$194, DW_AT_decl_column(0x0d)
    2097                    
    2098                    $C$DW$195       .dwtag  DW_TAG_member
    2099                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2100                            .dwattr $C$DW$195, DW_AT_name("ui16Mask")
    2101                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ui16Mask")
    2102                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2103                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2104                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2105                            .dwattr $C$DW$195, DW_AT_decl_line(0x104)
    2106                            .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    2107                    
    2108                    $C$DW$196       .dwtag  DW_TAG_member
    2109                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2110                            .dwattr $C$DW$196, DW_AT_name("ui16Value")
    2111                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("ui16Value")
    2112                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2113                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2114                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2115                            .dwattr $C$DW$196, DW_AT_decl_line(0x109)
    2116                            .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    2117                    
    2118                    $C$DW$197       .dwtag  DW_TAG_member
    2119                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$28)
    2120                            .dwattr $C$DW$197, DW_AT_name("pfnCallback")
    2121                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("pfnCallback")
    2122                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2123                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2124                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2125                            .dwattr $C$DW$197, DW_AT_decl_line(0x10f)
    2126                            .dwattr $C$DW$197, DW_AT_decl_column(0x16)
    2127                    
    2128                    $C$DW$198       .dwtag  DW_TAG_member
    2129                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$3)
    2130                            .dwattr $C$DW$198, DW_AT_name("pvCallbackData")
    2131                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("pvCallbackData")
    2132                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2133                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2134                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2135                            .dwattr $C$DW$198, DW_AT_decl_line(0x114)
    2136                            .dwattr $C$DW$198, DW_AT_decl_column(0x0b)
    2137                    
    2138                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2139                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    2140                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2141                            .dwendtag $C$DW$T$36
    2142                    
    2143                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    2144                            .dwattr $C$DW$T$91, DW_AT_name("tI2CMReadModifyWrite16")
    2145                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$36)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   40

    2146                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2147                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2148                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x116)
    2149                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    2150                    
    2151                    $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    2152                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    2153                            .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    2154                    
    2155                    
    2156                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2157                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    2158                    $C$DW$199       .dwtag  DW_TAG_member
    2159                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$34)
    2160                            .dwattr $C$DW$199, DW_AT_name("psI2CInst")
    2161                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("psI2CInst")
    2162                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2163                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2164                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2165                            .dwattr $C$DW$199, DW_AT_decl_line(0x123)
    2166                            .dwattr $C$DW$199, DW_AT_decl_column(0x14)
    2167                    
    2168                    $C$DW$200       .dwtag  DW_TAG_member
    2169                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$37)
    2170                            .dwattr $C$DW$200, DW_AT_name("pui8Buffer")
    2171                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("pui8Buffer")
    2172                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2173                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2174                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2175                            .dwattr $C$DW$200, DW_AT_decl_line(0x128)
    2176                            .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    2177                    
    2178                    $C$DW$201       .dwtag  DW_TAG_member
    2179                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2180                            .dwattr $C$DW$201, DW_AT_name("ui16Count")
    2181                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("ui16Count")
    2182                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2183                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2184                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2185                            .dwattr $C$DW$201, DW_AT_decl_line(0x12d)
    2186                            .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    2187                    
    2188                    $C$DW$202       .dwtag  DW_TAG_member
    2189                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2190                            .dwattr $C$DW$202, DW_AT_name("pui8Data")
    2191                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("pui8Data")
    2192                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2193                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2194                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2195                            .dwattr $C$DW$202, DW_AT_decl_line(0x132)
    2196                            .dwattr $C$DW$202, DW_AT_decl_column(0x14)
    2197                    
    2198                    $C$DW$203       .dwtag  DW_TAG_member
    2199                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$28)
    2200                            .dwattr $C$DW$203, DW_AT_name("pfnCallback")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   41

    2201                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("pfnCallback")
    2202                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2203                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2204                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2205                            .dwattr $C$DW$203, DW_AT_decl_line(0x137)
    2206                            .dwattr $C$DW$203, DW_AT_decl_column(0x16)
    2207                    
    2208                    $C$DW$204       .dwtag  DW_TAG_member
    2209                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$3)
    2210                            .dwattr $C$DW$204, DW_AT_name("pvCallbackData")
    2211                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("pvCallbackData")
    2212                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2213                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2214                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2215                            .dwattr $C$DW$204, DW_AT_decl_line(0x13c)
    2216                            .dwattr $C$DW$204, DW_AT_decl_column(0x0b)
    2217                    
    2218                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2219                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x11e)
    2220                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2221                            .dwendtag $C$DW$T$38
    2222                    
    2223                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    2224                            .dwattr $C$DW$T$49, DW_AT_name("tI2CMWrite8")
    2225                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    2226                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2227                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2228                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x13e)
    2229                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    2230                    
    2231                    
    2232                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2233                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    2234                    $C$DW$205       .dwtag  DW_TAG_member
    2235                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$34)
    2236                            .dwattr $C$DW$205, DW_AT_name("psI2CInst")
    2237                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("psI2CInst")
    2238                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2240                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2241                            .dwattr $C$DW$205, DW_AT_decl_line(0xbc)
    2242                            .dwattr $C$DW$205, DW_AT_decl_column(0x14)
    2243                    
    2244                    $C$DW$206       .dwtag  DW_TAG_member
    2245                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$35)
    2246                            .dwattr $C$DW$206, DW_AT_name("pui8Buffer")
    2247                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pui8Buffer")
    2248                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2249                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2250                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2251                            .dwattr $C$DW$206, DW_AT_decl_line(0xc1)
    2252                            .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    2253                    
    2254                    $C$DW$207       .dwtag  DW_TAG_member
    2255                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   42

    2256                            .dwattr $C$DW$207, DW_AT_name("ui8State")
    2257                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("ui8State")
    2258                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2259                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2260                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2261                            .dwattr $C$DW$207, DW_AT_decl_line(0xc6)
    2262                            .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    2263                    
    2264                    $C$DW$208       .dwtag  DW_TAG_member
    2265                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2266                            .dwattr $C$DW$208, DW_AT_name("ui8Addr")
    2267                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("ui8Addr")
    2268                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2269                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2270                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2271                            .dwattr $C$DW$208, DW_AT_decl_line(0xcb)
    2272                            .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    2273                    
    2274                    $C$DW$209       .dwtag  DW_TAG_member
    2275                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2276                            .dwattr $C$DW$209, DW_AT_name("ui8Mask")
    2277                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("ui8Mask")
    2278                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2279                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2280                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2281                            .dwattr $C$DW$209, DW_AT_decl_line(0xd0)
    2282                            .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    2283                    
    2284                    $C$DW$210       .dwtag  DW_TAG_member
    2285                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2286                            .dwattr $C$DW$210, DW_AT_name("ui8Value")
    2287                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("ui8Value")
    2288                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2289                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2290                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2291                            .dwattr $C$DW$210, DW_AT_decl_line(0xd5)
    2292                            .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    2293                    
    2294                    $C$DW$211       .dwtag  DW_TAG_member
    2295                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$28)
    2296                            .dwattr $C$DW$211, DW_AT_name("pfnCallback")
    2297                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("pfnCallback")
    2298                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2299                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2300                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2301                            .dwattr $C$DW$211, DW_AT_decl_line(0xdb)
    2302                            .dwattr $C$DW$211, DW_AT_decl_column(0x16)
    2303                    
    2304                    $C$DW$212       .dwtag  DW_TAG_member
    2305                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$3)
    2306                            .dwattr $C$DW$212, DW_AT_name("pvCallbackData")
    2307                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("pvCallbackData")
    2308                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2309                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2310                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   43

    2311                            .dwattr $C$DW$212, DW_AT_decl_line(0xe0)
    2312                            .dwattr $C$DW$212, DW_AT_decl_column(0x0b)
    2313                    
    2314                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2315                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xb7)
    2316                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2317                            .dwendtag $C$DW$T$39
    2318                    
    2319                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    2320                            .dwattr $C$DW$T$50, DW_AT_name("tI2CMReadModifyWrite8")
    2321                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    2322                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2323                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2324                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe2)
    2325                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2326                    
    2327                    
    2328                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2329                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x2c)
    2330                    $C$DW$213       .dwtag  DW_TAG_member
    2331                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$34)
    2332                            .dwattr $C$DW$213, DW_AT_name("psI2CInst")
    2333                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("psI2CInst")
    2334                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2335                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2336                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2337                            .dwattr $C$DW$213, DW_AT_decl_line(0x32)
    2338                            .dwattr $C$DW$213, DW_AT_decl_column(0x14)
    2339                    
    2340                    $C$DW$214       .dwtag  DW_TAG_member
    2341                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2342                            .dwattr $C$DW$214, DW_AT_name("ui8Addr")
    2343                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("ui8Addr")
    2344                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2345                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2346                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2347                            .dwattr $C$DW$214, DW_AT_decl_line(0x37)
    2348                            .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    2349                    
    2350                    $C$DW$215       .dwtag  DW_TAG_member
    2351                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2352                            .dwattr $C$DW$215, DW_AT_name("ui8State")
    2353                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("ui8State")
    2354                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2355                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2356                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2357                            .dwattr $C$DW$215, DW_AT_decl_line(0x3c)
    2358                            .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    2359                    
    2360                    $C$DW$216       .dwtag  DW_TAG_member
    2361                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$40)
    2362                            .dwattr $C$DW$216, DW_AT_name("pui8Data")
    2363                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("pui8Data")
    2364                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2365                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   44

    2366                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2367                            .dwattr $C$DW$216, DW_AT_decl_line(0x41)
    2368                            .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    2369                    
    2370                    $C$DW$217       .dwtag  DW_TAG_member
    2371                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$28)
    2372                            .dwattr $C$DW$217, DW_AT_name("pfnCallback")
    2373                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("pfnCallback")
    2374                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2375                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2376                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2377                            .dwattr $C$DW$217, DW_AT_decl_line(0x47)
    2378                            .dwattr $C$DW$217, DW_AT_decl_column(0x16)
    2379                    
    2380                    $C$DW$218       .dwtag  DW_TAG_member
    2381                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$3)
    2382                            .dwattr $C$DW$218, DW_AT_name("pvCallbackData")
    2383                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("pvCallbackData")
    2384                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2385                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2386                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2387                            .dwattr $C$DW$218, DW_AT_decl_line(0x4c)
    2388                            .dwattr $C$DW$218, DW_AT_decl_column(0x0b)
    2389                    
    2390                    $C$DW$219       .dwtag  DW_TAG_member
    2391                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$51)
    2392                            .dwattr $C$DW$219, DW_AT_name("uCommand")
    2393                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("uCommand")
    2394                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2395                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2396                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2397                            .dwattr $C$DW$219, DW_AT_decl_line(0x64)
    2398                            .dwattr $C$DW$219, DW_AT_decl_column(0x05)
    2399                    
    2400                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2401                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2d)
    2402                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2403                            .dwendtag $C$DW$T$41
    2404                    
    2405                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    2406                            .dwattr $C$DW$T$42, DW_AT_name("tAK8975")
    2407                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2408                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2409                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2410                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x66)
    2411                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2412                    
    2413                    
    2414                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2415                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x6c)
    2416                    $C$DW$220       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$34)
    2418                            .dwattr $C$DW$220, DW_AT_name("psI2CInst")
    2419                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("psI2CInst")
    2420                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   45

    2421                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2422                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2423                            .dwattr $C$DW$220, DW_AT_decl_line(0x33)
    2424                            .dwattr $C$DW$220, DW_AT_decl_column(0x14)
    2425                    
    2426                    $C$DW$221       .dwtag  DW_TAG_member
    2427                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$42)
    2428                            .dwattr $C$DW$221, DW_AT_name("sAK8975Inst")
    2429                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("sAK8975Inst")
    2430                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2431                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2432                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2433                            .dwattr $C$DW$221, DW_AT_decl_line(0x38)
    2434                            .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    2435                    
    2436                    $C$DW$222       .dwtag  DW_TAG_member
    2437                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2438                            .dwattr $C$DW$222, DW_AT_name("ui8Addr")
    2439                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("ui8Addr")
    2440                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2441                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2442                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2443                            .dwattr $C$DW$222, DW_AT_decl_line(0x3d)
    2444                            .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    2445                    
    2446                    $C$DW$223       .dwtag  DW_TAG_member
    2447                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2448                            .dwattr $C$DW$223, DW_AT_name("ui8State")
    2449                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("ui8State")
    2450                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2451                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2452                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2453                            .dwattr $C$DW$223, DW_AT_decl_line(0x42)
    2454                            .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    2455                    
    2456                    $C$DW$224       .dwtag  DW_TAG_member
    2457                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2458                            .dwattr $C$DW$224, DW_AT_name("ui8AccelAfsSel")
    2459                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2460                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2461                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2462                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2463                            .dwattr $C$DW$224, DW_AT_decl_line(0x47)
    2464                            .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    2465                    
    2466                    $C$DW$225       .dwtag  DW_TAG_member
    2467                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2468                            .dwattr $C$DW$225, DW_AT_name("ui8NewAccelAfsSel")
    2469                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2470                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2471                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2472                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2473                            .dwattr $C$DW$225, DW_AT_decl_line(0x4d)
    2474                            .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    2475                    
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   46

    2476                    $C$DW$226       .dwtag  DW_TAG_member
    2477                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2478                            .dwattr $C$DW$226, DW_AT_name("ui8GyroFsSel")
    2479                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2480                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2481                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2482                            .dwattr $C$DW$226, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2483                            .dwattr $C$DW$226, DW_AT_decl_line(0x52)
    2484                            .dwattr $C$DW$226, DW_AT_decl_column(0x0d)
    2485                    
    2486                    $C$DW$227       .dwtag  DW_TAG_member
    2487                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2488                            .dwattr $C$DW$227, DW_AT_name("ui8NewGyroFsSel")
    2489                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2490                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2491                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2492                            .dwattr $C$DW$227, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2493                            .dwattr $C$DW$227, DW_AT_decl_line(0x58)
    2494                            .dwattr $C$DW$227, DW_AT_decl_column(0x0d)
    2495                    
    2496                    $C$DW$228       .dwtag  DW_TAG_member
    2497                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$43)
    2498                            .dwattr $C$DW$228, DW_AT_name("pui8Data")
    2499                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("pui8Data")
    2500                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2501                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2502                            .dwattr $C$DW$228, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2503                            .dwattr $C$DW$228, DW_AT_decl_line(0x5d)
    2504                            .dwattr $C$DW$228, DW_AT_decl_column(0x0d)
    2505                    
    2506                    $C$DW$229       .dwtag  DW_TAG_member
    2507                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$28)
    2508                            .dwattr $C$DW$229, DW_AT_name("pfnCallback")
    2509                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("pfnCallback")
    2510                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2511                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2512                            .dwattr $C$DW$229, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2513                            .dwattr $C$DW$229, DW_AT_decl_line(0x63)
    2514                            .dwattr $C$DW$229, DW_AT_decl_column(0x16)
    2515                    
    2516                    $C$DW$230       .dwtag  DW_TAG_member
    2517                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$3)
    2518                            .dwattr $C$DW$230, DW_AT_name("pvCallbackData")
    2519                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("pvCallbackData")
    2520                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2521                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2522                            .dwattr $C$DW$230, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2523                            .dwattr $C$DW$230, DW_AT_decl_line(0x68)
    2524                            .dwattr $C$DW$230, DW_AT_decl_column(0x0b)
    2525                    
    2526                    $C$DW$231       .dwtag  DW_TAG_member
    2527                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$53)
    2528                            .dwattr $C$DW$231, DW_AT_name("uCommand")
    2529                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("uCommand")
    2530                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   47

    2531                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2532                            .dwattr $C$DW$231, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2533                            .dwattr $C$DW$231, DW_AT_decl_line(0x80)
    2534                            .dwattr $C$DW$231, DW_AT_decl_column(0x05)
    2535                    
    2536                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2537                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
    2538                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2539                            .dwendtag $C$DW$T$44
    2540                    
    2541                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    2542                            .dwattr $C$DW$T$93, DW_AT_name("tMPU9150")
    2543                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$44)
    2544                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2545                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2546                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x82)
    2547                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2548                    
    2549                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    2550                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2551                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    2552                    
    2553                    
    2554                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2555                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    2556                    $C$DW$232       .dwtag  DW_TAG_member
    2557                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$10)
    2558                            .dwattr $C$DW$232, DW_AT_name("fd")
    2559                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("fd")
    2560                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2561                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2562                            .dwattr $C$DW$232, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2563                            .dwattr $C$DW$232, DW_AT_decl_line(0x5c)
    2564                            .dwattr $C$DW$232, DW_AT_decl_column(0x0b)
    2565                    
    2566                    $C$DW$233       .dwtag  DW_TAG_member
    2567                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$45)
    2568                            .dwattr $C$DW$233, DW_AT_name("buf")
    2569                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("buf")
    2570                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2571                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2572                            .dwattr $C$DW$233, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2573                            .dwattr $C$DW$233, DW_AT_decl_line(0x5d)
    2574                            .dwattr $C$DW$233, DW_AT_decl_column(0x16)
    2575                    
    2576                    $C$DW$234       .dwtag  DW_TAG_member
    2577                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$45)
    2578                            .dwattr $C$DW$234, DW_AT_name("pos")
    2579                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("pos")
    2580                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2581                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2582                            .dwattr $C$DW$234, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2583                            .dwattr $C$DW$234, DW_AT_decl_line(0x5e)
    2584                            .dwattr $C$DW$234, DW_AT_decl_column(0x16)
    2585                    
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   48

    2586                    $C$DW$235       .dwtag  DW_TAG_member
    2587                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$45)
    2588                            .dwattr $C$DW$235, DW_AT_name("bufend")
    2589                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("bufend")
    2590                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2591                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2592                            .dwattr $C$DW$235, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2593                            .dwattr $C$DW$235, DW_AT_decl_line(0x5f)
    2594                            .dwattr $C$DW$235, DW_AT_decl_column(0x16)
    2595                    
    2596                    $C$DW$236       .dwtag  DW_TAG_member
    2597                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$45)
    2598                            .dwattr $C$DW$236, DW_AT_name("buff_stop")
    2599                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("buff_stop")
    2600                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2601                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2602                            .dwattr $C$DW$236, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2603                            .dwattr $C$DW$236, DW_AT_decl_line(0x60)
    2604                            .dwattr $C$DW$236, DW_AT_decl_column(0x16)
    2605                    
    2606                    $C$DW$237       .dwtag  DW_TAG_member
    2607                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$11)
    2608                            .dwattr $C$DW$237, DW_AT_name("flags")
    2609                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("flags")
    2610                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2611                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2612                            .dwattr $C$DW$237, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2613                            .dwattr $C$DW$237, DW_AT_decl_line(0x61)
    2614                            .dwattr $C$DW$237, DW_AT_decl_column(0x16)
    2615                    
    2616                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2617                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x5b)
    2618                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2619                            .dwendtag $C$DW$T$46
    2620                    
    2621                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    2622                            .dwattr $C$DW$T$95, DW_AT_name("FILE")
    2623                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$46)
    2624                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2625                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2626                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x62)
    2627                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2628                    
    2629                    
    2630                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2631                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x14)
    2632                    $C$DW$238       .dwtag  DW_TAG_member
    2633                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$34)
    2634                            .dwattr $C$DW$238, DW_AT_name("psI2CInst")
    2635                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("psI2CInst")
    2636                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2637                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2638                            .dwattr $C$DW$238, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2639                            .dwattr $C$DW$238, DW_AT_decl_line(0x14c)
    2640                            .dwattr $C$DW$238, DW_AT_decl_column(0x14)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   49

    2641                    
    2642                    $C$DW$239       .dwtag  DW_TAG_member
    2643                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$23)
    2644                            .dwattr $C$DW$239, DW_AT_name("pui8Data")
    2645                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("pui8Data")
    2646                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2647                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2648                            .dwattr $C$DW$239, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2649                            .dwattr $C$DW$239, DW_AT_decl_line(0x151)
    2650                            .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    2651                    
    2652                    $C$DW$240       .dwtag  DW_TAG_member
    2653                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
    2654                            .dwattr $C$DW$240, DW_AT_name("ui16Count")
    2655                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("ui16Count")
    2656                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2657                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2658                            .dwattr $C$DW$240, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2659                            .dwattr $C$DW$240, DW_AT_decl_line(0x156)
    2660                            .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    2661                    
    2662                    $C$DW$241       .dwtag  DW_TAG_member
    2663                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$28)
    2664                            .dwattr $C$DW$241, DW_AT_name("pfnCallback")
    2665                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("pfnCallback")
    2666                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2667                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2668                            .dwattr $C$DW$241, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2669                            .dwattr $C$DW$241, DW_AT_decl_line(0x15b)
    2670                            .dwattr $C$DW$241, DW_AT_decl_column(0x16)
    2671                    
    2672                    $C$DW$242       .dwtag  DW_TAG_member
    2673                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$3)
    2674                            .dwattr $C$DW$242, DW_AT_name("pvCallbackData")
    2675                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("pvCallbackData")
    2676                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2677                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2678                            .dwattr $C$DW$242, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2679                            .dwattr $C$DW$242, DW_AT_decl_line(0x160)
    2680                            .dwattr $C$DW$242, DW_AT_decl_column(0x0b)
    2681                    
    2682                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2683                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x147)
    2684                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2685                            .dwendtag $C$DW$T$47
    2686                    
    2687                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2688                            .dwattr $C$DW$T$96, DW_AT_name("tI2CMRead16BE")
    2689                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$47)
    2690                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2691                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2692                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x162)
    2693                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    2694                    
    2695                    
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   50

    2696                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2697                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x14)
    2698                    $C$DW$243       .dwtag  DW_TAG_member
    2699                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$34)
    2700                            .dwattr $C$DW$243, DW_AT_name("psI2CInst")
    2701                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("psI2CInst")
    2702                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2703                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2704                            .dwattr $C$DW$243, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2705                            .dwattr $C$DW$243, DW_AT_decl_line(0x170)
    2706                            .dwattr $C$DW$243, DW_AT_decl_column(0x14)
    2707                    
    2708                    $C$DW$244       .dwtag  DW_TAG_member
    2709                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$37)
    2710                            .dwattr $C$DW$244, DW_AT_name("pui8Buffer")
    2711                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("pui8Buffer")
    2712                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2713                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2714                            .dwattr $C$DW$244, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2715                            .dwattr $C$DW$244, DW_AT_decl_line(0x175)
    2716                            .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    2717                    
    2718                    $C$DW$245       .dwtag  DW_TAG_member
    2719                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$22)
    2720                            .dwattr $C$DW$245, DW_AT_name("ui16Count")
    2721                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("ui16Count")
    2722                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2723                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2724                            .dwattr $C$DW$245, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2725                            .dwattr $C$DW$245, DW_AT_decl_line(0x17a)
    2726                            .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    2727                    
    2728                    $C$DW$246       .dwtag  DW_TAG_member
    2729                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    2730                            .dwattr $C$DW$246, DW_AT_name("pui8Data")
    2731                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("pui8Data")
    2732                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2733                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2734                            .dwattr $C$DW$246, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2735                            .dwattr $C$DW$246, DW_AT_decl_line(0x17f)
    2736                            .dwattr $C$DW$246, DW_AT_decl_column(0x14)
    2737                    
    2738                    $C$DW$247       .dwtag  DW_TAG_member
    2739                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$28)
    2740                            .dwattr $C$DW$247, DW_AT_name("pfnCallback")
    2741                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("pfnCallback")
    2742                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2743                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2744                            .dwattr $C$DW$247, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2745                            .dwattr $C$DW$247, DW_AT_decl_line(0x184)
    2746                            .dwattr $C$DW$247, DW_AT_decl_column(0x16)
    2747                    
    2748                    $C$DW$248       .dwtag  DW_TAG_member
    2749                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$3)
    2750                            .dwattr $C$DW$248, DW_AT_name("pvCallbackData")
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   51

    2751                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("pvCallbackData")
    2752                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2753                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2754                            .dwattr $C$DW$248, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2755                            .dwattr $C$DW$248, DW_AT_decl_line(0x189)
    2756                            .dwattr $C$DW$248, DW_AT_decl_column(0x0b)
    2757                    
    2758                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2759                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x16b)
    2760                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2761                            .dwendtag $C$DW$T$48
    2762                    
    2763                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    2764                            .dwattr $C$DW$T$97, DW_AT_name("tI2CMWrite16BE")
    2765                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$48)
    2766                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2767                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2768                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x18b)
    2769                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    2770                    
    2771                    
    2772                    $C$DW$T$51      .dwtag  DW_TAG_union_type
    2773                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x14)
    2774                    $C$DW$249       .dwtag  DW_TAG_member
    2775                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$37)
    2776                            .dwattr $C$DW$249, DW_AT_name("pui8Buffer")
    2777                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("pui8Buffer")
    2778                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2779                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2780                            .dwattr $C$DW$249, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2781                            .dwattr $C$DW$249, DW_AT_decl_line(0x58)
    2782                            .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    2783                    
    2784                    $C$DW$250       .dwtag  DW_TAG_member
    2785                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$49)
    2786                            .dwattr $C$DW$250, DW_AT_name("sWriteState")
    2787                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("sWriteState")
    2788                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2789                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2790                            .dwattr $C$DW$250, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2791                            .dwattr $C$DW$250, DW_AT_decl_line(0x5d)
    2792                            .dwattr $C$DW$250, DW_AT_decl_column(0x15)
    2793                    
    2794                    $C$DW$251       .dwtag  DW_TAG_member
    2795                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$50)
    2796                            .dwattr $C$DW$251, DW_AT_name("sReadModifyWriteState")
    2797                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2798                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2799                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2800                            .dwattr $C$DW$251, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2801                            .dwattr $C$DW$251, DW_AT_decl_line(0x62)
    2802                            .dwattr $C$DW$251, DW_AT_decl_column(0x1f)
    2803                    
    2804                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2805                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x54)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   52

    2806                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
    2807                            .dwendtag $C$DW$T$51
    2808                    
    2809                    
    2810                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    2811                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    2812                    $C$DW$252       .dwtag  DW_TAG_member
    2813                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$52)
    2814                            .dwattr $C$DW$252, DW_AT_name("pui8Buffer")
    2815                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("pui8Buffer")
    2816                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2817                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2818                            .dwattr $C$DW$252, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2819                            .dwattr $C$DW$252, DW_AT_decl_line(0x74)
    2820                            .dwattr $C$DW$252, DW_AT_decl_column(0x11)
    2821                    
    2822                    $C$DW$253       .dwtag  DW_TAG_member
    2823                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$49)
    2824                            .dwattr $C$DW$253, DW_AT_name("sWriteState")
    2825                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("sWriteState")
    2826                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2827                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2828                            .dwattr $C$DW$253, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2829                            .dwattr $C$DW$253, DW_AT_decl_line(0x79)
    2830                            .dwattr $C$DW$253, DW_AT_decl_column(0x15)
    2831                    
    2832                    $C$DW$254       .dwtag  DW_TAG_member
    2833                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$50)
    2834                            .dwattr $C$DW$254, DW_AT_name("sReadModifyWriteState")
    2835                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2836                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2837                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2838                            .dwattr $C$DW$254, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2839                            .dwattr $C$DW$254, DW_AT_decl_line(0x7e)
    2840                            .dwattr $C$DW$254, DW_AT_decl_column(0x1f)
    2841                    
    2842                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2843                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x70)
    2844                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    2845                            .dwendtag $C$DW$T$53
    2846                    
    2847                    
    2848                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2849                            .dwattr $C$DW$T$55, DW_AT_name("HeapRegion")
    2850                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    2851                    $C$DW$255       .dwtag  DW_TAG_member
    2852                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$23)
    2853                            .dwattr $C$DW$255, DW_AT_name("pucStartAddress")
    2854                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("pucStartAddress")
    2855                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2856                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2857                            .dwattr $C$DW$255, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2858                            .dwattr $C$DW$255, DW_AT_decl_line(0x96)
    2859                            .dwattr $C$DW$255, DW_AT_decl_column(0x0b)
    2860                    
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   53

    2861                    $C$DW$256       .dwtag  DW_TAG_member
    2862                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$54)
    2863                            .dwattr $C$DW$256, DW_AT_name("xSizeInBytes")
    2864                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("xSizeInBytes")
    2865                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2866                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2867                            .dwattr $C$DW$256, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2868                            .dwattr $C$DW$256, DW_AT_decl_line(0x97)
    2869                            .dwattr $C$DW$256, DW_AT_decl_column(0x09)
    2870                    
    2871                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2872                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x94)
    2873                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    2874                            .dwendtag $C$DW$T$55
    2875                    
    2876                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2877                            .dwattr $C$DW$T$98, DW_AT_name("HeapRegion_t")
    2878                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$55)
    2879                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2880                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2881                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x98)
    2882                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    2883                    
    2884                    
    2885                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2886                            .dwattr $C$DW$T$56, DW_AT_name("ReportData_Item")
    2887                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x18)
    2888                    $C$DW$257       .dwtag  DW_TAG_member
    2889                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$24)
    2890                            .dwattr $C$DW$257, DW_AT_name("TimeStamp")
    2891                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("TimeStamp")
    2892                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2893                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2894                            .dwattr $C$DW$257, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2895                            .dwattr $C$DW$257, DW_AT_decl_line(0x20)
    2896                            .dwattr $C$DW$257, DW_AT_decl_column(0x2b)
    2897                    
    2898                    $C$DW$258       .dwtag  DW_TAG_member
    2899                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$24)
    2900                            .dwattr $C$DW$258, DW_AT_name("ReportName")
    2901                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("ReportName")
    2902                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2903                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2904                            .dwattr $C$DW$258, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2905                            .dwattr $C$DW$258, DW_AT_decl_line(0x21)
    2906                            .dwattr $C$DW$258, DW_AT_decl_column(0x13)
    2907                    
    2908                    $C$DW$259       .dwtag  DW_TAG_member
    2909                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$24)
    2910                            .dwattr $C$DW$259, DW_AT_name("ReportValue_0")
    2911                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("ReportValue_0")
    2912                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2913                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2914                            .dwattr $C$DW$259, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2915                            .dwattr $C$DW$259, DW_AT_decl_line(0x22)
TI ARM Assembler PC v15.12.1 Thu Nov 03 12:53:12 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_gyro.asm                                                        PAGE   54

    2916                            .dwattr $C$DW$259, DW_AT_decl_column(0x13)
    2917                    
    2918                    $C$DW$260       .dwtag  DW_TAG_member
    2919                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$24)
    2920                            .dwattr $C$DW$260, DW_AT_name("ReportValue_1")
    2921                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("ReportValue_1")
    2922                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2923                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2924                            .dwattr $C$DW$260, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2925                            .dwattr $C$DW$260, DW_AT_decl_line(0x23)
    2926                            .dwattr $C$DW$260, DW_AT_decl_column(0x13)
    2927                    
    2928                    $C$DW$261       .dwtag  DW_TAG_member
    2929                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$24)
    2930                            .dwattr $C$DW$261, DW_AT_name("ReportValue_2")
    2931                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("ReportValue_2")
    2932                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2933                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2934                            .dwattr $C$DW$261, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2935                            .dwattr $C$DW$261, DW_AT_decl_line(0x24)
    2936                            .dwattr $C$DW$261, DW_AT_decl_column(0x13)
    2937                    
    2938                    $C$DW$262       .dwtag  DW_TAG_member
