TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Tue Oct 18 13:16:16 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/Magnetometer.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("vTaskDelay")

    1751                            .dwattr $C$DW$161, DW_AT_name("eIncrement")
    1752                            .dwattr $C$DW$161, DW_AT_const_value(0x02)
    1753                            .dwattr $C$DW$161, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1754                            .dwattr $C$DW$161, DW_AT_decl_line(0x7e)
    1755                            .dwattr $C$DW$161, DW_AT_decl_column(0x02)
    1756                    
    1757                    $C$DW$162       .dwtag  DW_TAG_enumerator
    1758                            .dwattr $C$DW$162, DW_AT_name("eSetValueWithOverwrite")
    1759                            .dwattr $C$DW$162, DW_AT_const_value(0x03)
    1760                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1761                            .dwattr $C$DW$162, DW_AT_decl_line(0x7f)
    1762                            .dwattr $C$DW$162, DW_AT_decl_column(0x02)
    1763                    
    1764                    $C$DW$163       .dwtag  DW_TAG_enumerator
    1765                            .dwattr $C$DW$163, DW_AT_name("eSetValueWithoutOverwrite")
    1766                            .dwattr $C$DW$163, DW_AT_const_value(0x04)
    1767                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1768                            .dwattr $C$DW$163, DW_AT_decl_line(0x80)
    1769                            .dwattr $C$DW$163, DW_AT_decl_column(0x02)
    1770                    
    1771                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1772                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x7b)
    1773                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    1774                            .dwendtag $C$DW$T$87
    1775                    
    1776                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    1777                            .dwattr $C$DW$T$88, DW_AT_name("eNotifyAction")
    1778                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1779                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1780                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1781                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x81)
    1782                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1783                    
    1784                    
    1785                    $C$DW$T$89      .dwtag  DW_TAG_enumeration_type
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   35

    1786                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
    1787                    $C$DW$164       .dwtag  DW_TAG_enumerator
    1788                            .dwattr $C$DW$164, DW_AT_name("eAbortSleep")
    1789                            .dwattr $C$DW$164, DW_AT_const_value(0x00)
    1790                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1791                            .dwattr $C$DW$164, DW_AT_decl_line(0xb5)
    1792                            .dwattr $C$DW$164, DW_AT_decl_column(0x02)
    1793                    
    1794                    $C$DW$165       .dwtag  DW_TAG_enumerator
    1795                            .dwattr $C$DW$165, DW_AT_name("eStandardSleep")
    1796                            .dwattr $C$DW$165, DW_AT_const_value(0x01)
    1797                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1798                            .dwattr $C$DW$165, DW_AT_decl_line(0xb6)
    1799                            .dwattr $C$DW$165, DW_AT_decl_column(0x02)
    1800                    
    1801                    $C$DW$166       .dwtag  DW_TAG_enumerator
    1802                            .dwattr $C$DW$166, DW_AT_name("eNoTasksWaitingTimeout")
    1803                            .dwattr $C$DW$166, DW_AT_const_value(0x02)
    1804                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1805                            .dwattr $C$DW$166, DW_AT_decl_line(0xb7)
    1806                            .dwattr $C$DW$166, DW_AT_decl_column(0x02)
    1807                    
    1808                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1809                            .dwattr $C$DW$T$89, DW_AT_decl_line(0xb4)
    1810                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x01)
    1811                            .dwendtag $C$DW$T$89
    1812                    
    1813                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    1814                            .dwattr $C$DW$T$90, DW_AT_name("eSleepModeStatus")
    1815                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1816                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1817                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1818                            .dwattr $C$DW$T$90, DW_AT_decl_line(0xb8)
    1819                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1820                    
    1821                    
    1822                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1823                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1824                    $C$DW$167       .dwtag  DW_TAG_member
    1825                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1826                            .dwattr $C$DW$167, DW_AT_name("ui8Addr")
    1827                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("ui8Addr")
    1828                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1829                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1830                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1831                            .dwattr $C$DW$167, DW_AT_decl_line(0x4c)
    1832                            .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    1833                    
    1834                    $C$DW$168       .dwtag  DW_TAG_member
    1835                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    1836                            .dwattr $C$DW$168, DW_AT_name("pui8WriteData")
    1837                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("pui8WriteData")
    1838                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1839                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1840                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   36

    1841                            .dwattr $C$DW$168, DW_AT_decl_line(0x51)
    1842                            .dwattr $C$DW$168, DW_AT_decl_column(0x14)
    1843                    
    1844                    $C$DW$169       .dwtag  DW_TAG_member
    1845                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    1846                            .dwattr $C$DW$169, DW_AT_name("ui16WriteCount")
    1847                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("ui16WriteCount")
    1848                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1849                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1850                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1851                            .dwattr $C$DW$169, DW_AT_decl_line(0x56)
    1852                            .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    1853                    
    1854                    $C$DW$170       .dwtag  DW_TAG_member
    1855                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    1856                            .dwattr $C$DW$170, DW_AT_name("ui16WriteBatchSize")
    1857                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1858                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1859                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1860                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1861                            .dwattr $C$DW$170, DW_AT_decl_line(0x5b)
    1862                            .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    1863                    
    1864                    $C$DW$171       .dwtag  DW_TAG_member
    1865                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    1866                            .dwattr $C$DW$171, DW_AT_name("pui8ReadData")
    1867                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("pui8ReadData")
    1868                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1869                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1870                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1871                            .dwattr $C$DW$171, DW_AT_decl_line(0x60)
    1872                            .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    1873                    
    1874                    $C$DW$172       .dwtag  DW_TAG_member
    1875                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    1876                            .dwattr $C$DW$172, DW_AT_name("ui16ReadCount")
    1877                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui16ReadCount")
    1878                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1879                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1880                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1881                            .dwattr $C$DW$172, DW_AT_decl_line(0x65)
    1882                            .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    1883                    
    1884                    $C$DW$173       .dwtag  DW_TAG_member
    1885                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    1886                            .dwattr $C$DW$173, DW_AT_name("ui16ReadBatchSize")
    1887                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1888                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1889                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1890                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1891                            .dwattr $C$DW$173, DW_AT_decl_line(0x6a)
    1892                            .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    1893                    
    1894                    $C$DW$174       .dwtag  DW_TAG_member
    1895                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$28)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   37

    1896                            .dwattr $C$DW$174, DW_AT_name("pfnCallback")
    1897                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("pfnCallback")
    1898                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1899                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1900                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1901                            .dwattr $C$DW$174, DW_AT_decl_line(0x6f)
    1902                            .dwattr $C$DW$174, DW_AT_decl_column(0x16)
    1903                    
    1904                    $C$DW$175       .dwtag  DW_TAG_member
    1905                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$3)
    1906                            .dwattr $C$DW$175, DW_AT_name("pvCallbackData")
    1907                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("pvCallbackData")
    1908                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1909                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1910                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1911                            .dwattr $C$DW$175, DW_AT_decl_line(0x74)
    1912                            .dwattr $C$DW$175, DW_AT_decl_column(0x0b)
    1913                    
    1914                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1915                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1916                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1917                            .dwendtag $C$DW$T$29
    1918                    
    1919                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1920                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1921                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1922                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1923                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1924                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1925                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1926                    
    1927                    
    1928                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1929                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1930                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1931                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1932                    $C$DW$176       .dwtag  DW_TAG_subrange_type
    1933                            .dwattr $C$DW$176, DW_AT_upper_bound(0x09)
    1934                    
    1935                            .dwendtag $C$DW$T$31
    1936                    
    1937                    
    1938                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1939                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1940                    $C$DW$177       .dwtag  DW_TAG_member
    1941                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$24)
    1942                            .dwattr $C$DW$177, DW_AT_name("ui32Base")
    1943                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("ui32Base")
    1944                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1946                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1947                            .dwattr $C$DW$177, DW_AT_decl_line(0x82)
    1948                            .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    1949                    
    1950                    $C$DW$178       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   38

    1951                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1952                            .dwattr $C$DW$178, DW_AT_name("ui8Int")
    1953                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("ui8Int")
    1954                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1955                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1956                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1957                            .dwattr $C$DW$178, DW_AT_decl_line(0x87)
    1958                            .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    1959                    
    1960                    $C$DW$179       .dwtag  DW_TAG_member
    1961                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1962                            .dwattr $C$DW$179, DW_AT_name("ui8TxDMA")
    1963                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("ui8TxDMA")
    1964                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1965                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1966                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1967                            .dwattr $C$DW$179, DW_AT_decl_line(0x8c)
    1968                            .dwattr $C$DW$179, DW_AT_decl_column(0x0d)
    1969                    
    1970                    $C$DW$180       .dwtag  DW_TAG_member
    1971                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1972                            .dwattr $C$DW$180, DW_AT_name("ui8RxDMA")
    1973                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("ui8RxDMA")
    1974                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1975                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1976                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1977                            .dwattr $C$DW$180, DW_AT_decl_line(0x91)
    1978                            .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    1979                    
    1980                    $C$DW$181       .dwtag  DW_TAG_member
    1981                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1982                            .dwattr $C$DW$181, DW_AT_name("ui8State")
    1983                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ui8State")
    1984                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1985                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1986                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1987                            .dwattr $C$DW$181, DW_AT_decl_line(0x96)
    1988                            .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    1989                    
    1990                    $C$DW$182       .dwtag  DW_TAG_member
    1991                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1992                            .dwattr $C$DW$182, DW_AT_name("ui8ReadPtr")
    1993                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui8ReadPtr")
    1994                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1995                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1996                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1997                            .dwattr $C$DW$182, DW_AT_decl_line(0x9c)
    1998                            .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    1999                    
    2000                    $C$DW$183       .dwtag  DW_TAG_member
    2001                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2002                            .dwattr $C$DW$183, DW_AT_name("ui8WritePtr")
    2003                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui8WritePtr")
    2004                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2005                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   39

    2006                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2007                            .dwattr $C$DW$183, DW_AT_decl_line(0xa2)
    2008                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    2009                    
    2010                    $C$DW$184       .dwtag  DW_TAG_member
    2011                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2012                            .dwattr $C$DW$184, DW_AT_name("ui16Index")
    2013                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ui16Index")
    2014                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2015                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2016                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2017                            .dwattr $C$DW$184, DW_AT_decl_line(0xa7)
    2018                            .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    2019                    
    2020                    $C$DW$185       .dwtag  DW_TAG_member
    2021                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
    2022                            .dwattr $C$DW$185, DW_AT_name("pCommands")
    2023                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("pCommands")
    2024                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2025                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2026                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2027                            .dwattr $C$DW$185, DW_AT_decl_line(0xac)
    2028                            .dwattr $C$DW$185, DW_AT_decl_column(0x12)
    2029                    
    2030                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2031                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    2032                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2033                            .dwendtag $C$DW$T$32
    2034                    
    2035                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    2036                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    2037                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2038                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2039                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2040                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    2041                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2042                    
    2043                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2044                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2045                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2046                    
    2047                    
    2048                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2049                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    2050                    $C$DW$186       .dwtag  DW_TAG_member
    2051                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$34)
    2052                            .dwattr $C$DW$186, DW_AT_name("psI2CInst")
    2053                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("psI2CInst")
    2054                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2056                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2057                            .dwattr $C$DW$186, DW_AT_decl_line(0xf0)
    2058                            .dwattr $C$DW$186, DW_AT_decl_column(0x14)
    2059                    
    2060                    $C$DW$187       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   40

    2061                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$35)
    2062                            .dwattr $C$DW$187, DW_AT_name("pui8Buffer")
    2063                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("pui8Buffer")
    2064                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2065                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2066                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2067                            .dwattr $C$DW$187, DW_AT_decl_line(0xf5)
    2068                            .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    2069                    
    2070                    $C$DW$188       .dwtag  DW_TAG_member
    2071                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2072                            .dwattr $C$DW$188, DW_AT_name("ui8State")
    2073                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ui8State")
    2074                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2075                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2076                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2077                            .dwattr $C$DW$188, DW_AT_decl_line(0xfa)
    2078                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    2079                    
    2080                    $C$DW$189       .dwtag  DW_TAG_member
    2081                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2082                            .dwattr $C$DW$189, DW_AT_name("ui8Addr")
    2083                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ui8Addr")
    2084                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2085                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2086                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2087                            .dwattr $C$DW$189, DW_AT_decl_line(0xff)
    2088                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2089                    
    2090                    $C$DW$190       .dwtag  DW_TAG_member
    2091                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2092                            .dwattr $C$DW$190, DW_AT_name("ui16Mask")
    2093                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ui16Mask")
    2094                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2095                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2096                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2097                            .dwattr $C$DW$190, DW_AT_decl_line(0x104)
    2098                            .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    2099                    
    2100                    $C$DW$191       .dwtag  DW_TAG_member
    2101                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    2102                            .dwattr $C$DW$191, DW_AT_name("ui16Value")
    2103                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("ui16Value")
    2104                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2105                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2106                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2107                            .dwattr $C$DW$191, DW_AT_decl_line(0x109)
    2108                            .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    2109                    
    2110                    $C$DW$192       .dwtag  DW_TAG_member
    2111                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$28)
    2112                            .dwattr $C$DW$192, DW_AT_name("pfnCallback")
    2113                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pfnCallback")
    2114                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2115                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   41

    2116                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2117                            .dwattr $C$DW$192, DW_AT_decl_line(0x10f)
    2118                            .dwattr $C$DW$192, DW_AT_decl_column(0x16)
    2119                    
    2120                    $C$DW$193       .dwtag  DW_TAG_member
    2121                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$3)
    2122                            .dwattr $C$DW$193, DW_AT_name("pvCallbackData")
    2123                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("pvCallbackData")
    2124                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2125                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2126                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2127                            .dwattr $C$DW$193, DW_AT_decl_line(0x114)
    2128                            .dwattr $C$DW$193, DW_AT_decl_column(0x0b)
    2129                    
    2130                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2131                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    2132                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2133                            .dwendtag $C$DW$T$36
    2134                    
    2135                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    2136                            .dwattr $C$DW$T$91, DW_AT_name("tI2CMReadModifyWrite16")
    2137                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$36)
    2138                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2139                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2140                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x116)
    2141                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    2142                    
    2143                    $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    2144                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    2145                            .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    2146                    
    2147                    
    2148                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2149                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    2150                    $C$DW$194       .dwtag  DW_TAG_member
    2151                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$34)
    2152                            .dwattr $C$DW$194, DW_AT_name("psI2CInst")
    2153                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("psI2CInst")
    2154                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2156                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2157                            .dwattr $C$DW$194, DW_AT_decl_line(0x123)
    2158                            .dwattr $C$DW$194, DW_AT_decl_column(0x14)
    2159                    
    2160                    $C$DW$195       .dwtag  DW_TAG_member
    2161                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$37)
    2162                            .dwattr $C$DW$195, DW_AT_name("pui8Buffer")
    2163                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("pui8Buffer")
    2164                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2165                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2166                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2167                            .dwattr $C$DW$195, DW_AT_decl_line(0x128)
    2168                            .dwattr $C$DW$195, DW_AT_decl_column(0x0d)
    2169                    
    2170                    $C$DW$196       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   42

    2171                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2172                            .dwattr $C$DW$196, DW_AT_name("ui16Count")
    2173                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("ui16Count")
    2174                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2175                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2176                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2177                            .dwattr $C$DW$196, DW_AT_decl_line(0x12d)
    2178                            .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    2179                    
    2180                    $C$DW$197       .dwtag  DW_TAG_member
    2181                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    2182                            .dwattr $C$DW$197, DW_AT_name("pui8Data")
    2183                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("pui8Data")
    2184                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2185                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2186                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2187                            .dwattr $C$DW$197, DW_AT_decl_line(0x132)
    2188                            .dwattr $C$DW$197, DW_AT_decl_column(0x14)
    2189                    
    2190                    $C$DW$198       .dwtag  DW_TAG_member
    2191                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$28)
    2192                            .dwattr $C$DW$198, DW_AT_name("pfnCallback")
    2193                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("pfnCallback")
    2194                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2195                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2196                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2197                            .dwattr $C$DW$198, DW_AT_decl_line(0x137)
    2198                            .dwattr $C$DW$198, DW_AT_decl_column(0x16)
    2199                    
    2200                    $C$DW$199       .dwtag  DW_TAG_member
    2201                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$3)
    2202                            .dwattr $C$DW$199, DW_AT_name("pvCallbackData")
    2203                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("pvCallbackData")
    2204                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2205                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2206                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2207                            .dwattr $C$DW$199, DW_AT_decl_line(0x13c)
    2208                            .dwattr $C$DW$199, DW_AT_decl_column(0x0b)
    2209                    
    2210                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2211                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x11e)
    2212                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2213                            .dwendtag $C$DW$T$38
    2214                    
    2215                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    2216                            .dwattr $C$DW$T$49, DW_AT_name("tI2CMWrite8")
    2217                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    2218                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2219                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2220                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x13e)
    2221                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    2222                    
    2223                    
    2224                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2225                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   43

    2226                    $C$DW$200       .dwtag  DW_TAG_member
    2227                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$34)
    2228                            .dwattr $C$DW$200, DW_AT_name("psI2CInst")
    2229                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("psI2CInst")
    2230                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2231                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2232                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2233                            .dwattr $C$DW$200, DW_AT_decl_line(0xbc)
    2234                            .dwattr $C$DW$200, DW_AT_decl_column(0x14)
    2235                    
    2236                    $C$DW$201       .dwtag  DW_TAG_member
    2237                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$35)
    2238                            .dwattr $C$DW$201, DW_AT_name("pui8Buffer")
    2239                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("pui8Buffer")
    2240                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2241                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2242                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2243                            .dwattr $C$DW$201, DW_AT_decl_line(0xc1)
    2244                            .dwattr $C$DW$201, DW_AT_decl_column(0x0d)
    2245                    
    2246                    $C$DW$202       .dwtag  DW_TAG_member
    2247                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2248                            .dwattr $C$DW$202, DW_AT_name("ui8State")
    2249                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("ui8State")
    2250                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2251                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2252                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2253                            .dwattr $C$DW$202, DW_AT_decl_line(0xc6)
    2254                            .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    2255                    
    2256                    $C$DW$203       .dwtag  DW_TAG_member
    2257                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2258                            .dwattr $C$DW$203, DW_AT_name("ui8Addr")
    2259                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("ui8Addr")
    2260                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2261                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2262                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2263                            .dwattr $C$DW$203, DW_AT_decl_line(0xcb)
    2264                            .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    2265                    
    2266                    $C$DW$204       .dwtag  DW_TAG_member
    2267                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2268                            .dwattr $C$DW$204, DW_AT_name("ui8Mask")
    2269                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("ui8Mask")
    2270                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2271                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2272                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2273                            .dwattr $C$DW$204, DW_AT_decl_line(0xd0)
    2274                            .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2275                    
    2276                    $C$DW$205       .dwtag  DW_TAG_member
    2277                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2278                            .dwattr $C$DW$205, DW_AT_name("ui8Value")
    2279                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("ui8Value")
    2280                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   44

    2281                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2282                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2283                            .dwattr $C$DW$205, DW_AT_decl_line(0xd5)
    2284                            .dwattr $C$DW$205, DW_AT_decl_column(0x0d)
    2285                    
    2286                    $C$DW$206       .dwtag  DW_TAG_member
    2287                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$28)
    2288                            .dwattr $C$DW$206, DW_AT_name("pfnCallback")
    2289                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pfnCallback")
    2290                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2291                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2292                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2293                            .dwattr $C$DW$206, DW_AT_decl_line(0xdb)
    2294                            .dwattr $C$DW$206, DW_AT_decl_column(0x16)
    2295                    
    2296                    $C$DW$207       .dwtag  DW_TAG_member
    2297                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$3)
    2298                            .dwattr $C$DW$207, DW_AT_name("pvCallbackData")
    2299                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("pvCallbackData")
    2300                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2301                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2302                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2303                            .dwattr $C$DW$207, DW_AT_decl_line(0xe0)
    2304                            .dwattr $C$DW$207, DW_AT_decl_column(0x0b)
    2305                    
    2306                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2307                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xb7)
    2308                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2309                            .dwendtag $C$DW$T$39
    2310                    
    2311                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    2312                            .dwattr $C$DW$T$50, DW_AT_name("tI2CMReadModifyWrite8")
    2313                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    2314                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2315                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2316                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe2)
    2317                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2318                    
    2319                    
    2320                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2321                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x2c)
    2322                    $C$DW$208       .dwtag  DW_TAG_member
    2323                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$34)
    2324                            .dwattr $C$DW$208, DW_AT_name("psI2CInst")
    2325                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("psI2CInst")
    2326                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2328                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2329                            .dwattr $C$DW$208, DW_AT_decl_line(0x32)
    2330                            .dwattr $C$DW$208, DW_AT_decl_column(0x14)
    2331                    
    2332                    $C$DW$209       .dwtag  DW_TAG_member
    2333                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2334                            .dwattr $C$DW$209, DW_AT_name("ui8Addr")
    2335                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("ui8Addr")
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   45

    2336                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2337                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2338                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2339                            .dwattr $C$DW$209, DW_AT_decl_line(0x37)
    2340                            .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    2341                    
    2342                    $C$DW$210       .dwtag  DW_TAG_member
    2343                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2344                            .dwattr $C$DW$210, DW_AT_name("ui8State")
    2345                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("ui8State")
    2346                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2347                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2348                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2349                            .dwattr $C$DW$210, DW_AT_decl_line(0x3c)
    2350                            .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    2351                    
    2352                    $C$DW$211       .dwtag  DW_TAG_member
    2353                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$40)
    2354                            .dwattr $C$DW$211, DW_AT_name("pui8Data")
    2355                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("pui8Data")
    2356                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2357                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2358                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2359                            .dwattr $C$DW$211, DW_AT_decl_line(0x41)
    2360                            .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    2361                    
    2362                    $C$DW$212       .dwtag  DW_TAG_member
    2363                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$28)
    2364                            .dwattr $C$DW$212, DW_AT_name("pfnCallback")
    2365                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("pfnCallback")
    2366                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2367                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2368                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2369                            .dwattr $C$DW$212, DW_AT_decl_line(0x47)
    2370                            .dwattr $C$DW$212, DW_AT_decl_column(0x16)
    2371                    
    2372                    $C$DW$213       .dwtag  DW_TAG_member
    2373                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$3)
    2374                            .dwattr $C$DW$213, DW_AT_name("pvCallbackData")
    2375                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("pvCallbackData")
    2376                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2377                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2378                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2379                            .dwattr $C$DW$213, DW_AT_decl_line(0x4c)
    2380                            .dwattr $C$DW$213, DW_AT_decl_column(0x0b)
    2381                    
    2382                    $C$DW$214       .dwtag  DW_TAG_member
    2383                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$51)
    2384                            .dwattr $C$DW$214, DW_AT_name("uCommand")
    2385                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("uCommand")
    2386                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2387                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2388                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2389                            .dwattr $C$DW$214, DW_AT_decl_line(0x64)
    2390                            .dwattr $C$DW$214, DW_AT_decl_column(0x05)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   46

    2391                    
    2392                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2393                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2d)
    2394                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2395                            .dwendtag $C$DW$T$41
    2396                    
    2397                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    2398                            .dwattr $C$DW$T$42, DW_AT_name("tAK8975")
    2399                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2400                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2401                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2402                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x66)
    2403                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2404                    
    2405                    
    2406                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2407                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x6c)
    2408                    $C$DW$215       .dwtag  DW_TAG_member
    2409                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$34)
    2410                            .dwattr $C$DW$215, DW_AT_name("psI2CInst")
    2411                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("psI2CInst")
    2412                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2413                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2414                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2415                            .dwattr $C$DW$215, DW_AT_decl_line(0x33)
    2416                            .dwattr $C$DW$215, DW_AT_decl_column(0x14)
    2417                    
    2418                    $C$DW$216       .dwtag  DW_TAG_member
    2419                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$42)
    2420                            .dwattr $C$DW$216, DW_AT_name("sAK8975Inst")
    2421                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("sAK8975Inst")
    2422                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2423                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2424                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2425                            .dwattr $C$DW$216, DW_AT_decl_line(0x38)
    2426                            .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    2427                    
    2428                    $C$DW$217       .dwtag  DW_TAG_member
    2429                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2430                            .dwattr $C$DW$217, DW_AT_name("ui8Addr")
    2431                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("ui8Addr")
    2432                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2433                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2434                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2435                            .dwattr $C$DW$217, DW_AT_decl_line(0x3d)
    2436                            .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    2437                    
    2438                    $C$DW$218       .dwtag  DW_TAG_member
    2439                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2440                            .dwattr $C$DW$218, DW_AT_name("ui8State")
    2441                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("ui8State")
    2442                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2443                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2444                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2445                            .dwattr $C$DW$218, DW_AT_decl_line(0x42)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   47

    2446                            .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    2447                    
    2448                    $C$DW$219       .dwtag  DW_TAG_member
    2449                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2450                            .dwattr $C$DW$219, DW_AT_name("ui8AccelAfsSel")
    2451                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2452                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2453                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2454                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2455                            .dwattr $C$DW$219, DW_AT_decl_line(0x47)
    2456                            .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    2457                    
    2458                    $C$DW$220       .dwtag  DW_TAG_member
    2459                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2460                            .dwattr $C$DW$220, DW_AT_name("ui8NewAccelAfsSel")
    2461                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2462                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2463                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2464                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2465                            .dwattr $C$DW$220, DW_AT_decl_line(0x4d)
    2466                            .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    2467                    
    2468                    $C$DW$221       .dwtag  DW_TAG_member
    2469                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2470                            .dwattr $C$DW$221, DW_AT_name("ui8GyroFsSel")
    2471                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2472                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2473                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2474                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2475                            .dwattr $C$DW$221, DW_AT_decl_line(0x52)
    2476                            .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    2477                    
    2478                    $C$DW$222       .dwtag  DW_TAG_member
    2479                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2480                            .dwattr $C$DW$222, DW_AT_name("ui8NewGyroFsSel")
    2481                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2482                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2483                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2484                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2485                            .dwattr $C$DW$222, DW_AT_decl_line(0x58)
    2486                            .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    2487                    
    2488                    $C$DW$223       .dwtag  DW_TAG_member
    2489                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$43)
    2490                            .dwattr $C$DW$223, DW_AT_name("pui8Data")
    2491                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("pui8Data")
    2492                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2493                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2494                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2495                            .dwattr $C$DW$223, DW_AT_decl_line(0x5d)
    2496                            .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    2497                    
    2498                    $C$DW$224       .dwtag  DW_TAG_member
    2499                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$28)
    2500                            .dwattr $C$DW$224, DW_AT_name("pfnCallback")
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   48

    2501                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("pfnCallback")
    2502                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2503                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2504                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2505                            .dwattr $C$DW$224, DW_AT_decl_line(0x63)
    2506                            .dwattr $C$DW$224, DW_AT_decl_column(0x16)
    2507                    
    2508                    $C$DW$225       .dwtag  DW_TAG_member
    2509                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$3)
    2510                            .dwattr $C$DW$225, DW_AT_name("pvCallbackData")
    2511                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("pvCallbackData")
    2512                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2513                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2514                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2515                            .dwattr $C$DW$225, DW_AT_decl_line(0x68)
    2516                            .dwattr $C$DW$225, DW_AT_decl_column(0x0b)
    2517                    
    2518                    $C$DW$226       .dwtag  DW_TAG_member
    2519                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$53)
    2520                            .dwattr $C$DW$226, DW_AT_name("uCommand")
    2521                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("uCommand")
    2522                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2523                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2524                            .dwattr $C$DW$226, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2525                            .dwattr $C$DW$226, DW_AT_decl_line(0x80)
    2526                            .dwattr $C$DW$226, DW_AT_decl_column(0x05)
    2527                    
    2528                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2529                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
    2530                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2531                            .dwendtag $C$DW$T$44
    2532                    
    2533                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    2534                            .dwattr $C$DW$T$93, DW_AT_name("tMPU9150")
    2535                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$44)
    2536                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2537                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2538                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x82)
    2539                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2540                    
    2541                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    2542                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2543                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    2544                    
    2545                    
    2546                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2547                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    2548                    $C$DW$227       .dwtag  DW_TAG_member
    2549                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$10)
    2550                            .dwattr $C$DW$227, DW_AT_name("fd")
    2551                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("fd")
    2552                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2554                            .dwattr $C$DW$227, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2555                            .dwattr $C$DW$227, DW_AT_decl_line(0x5c)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   49

    2556                            .dwattr $C$DW$227, DW_AT_decl_column(0x0b)
    2557                    
    2558                    $C$DW$228       .dwtag  DW_TAG_member
    2559                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$45)
    2560                            .dwattr $C$DW$228, DW_AT_name("buf")
    2561                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("buf")
    2562                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2563                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2564                            .dwattr $C$DW$228, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2565                            .dwattr $C$DW$228, DW_AT_decl_line(0x5d)
    2566                            .dwattr $C$DW$228, DW_AT_decl_column(0x16)
    2567                    
    2568                    $C$DW$229       .dwtag  DW_TAG_member
    2569                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$45)
    2570                            .dwattr $C$DW$229, DW_AT_name("pos")
    2571                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("pos")
    2572                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2573                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2574                            .dwattr $C$DW$229, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2575                            .dwattr $C$DW$229, DW_AT_decl_line(0x5e)
    2576                            .dwattr $C$DW$229, DW_AT_decl_column(0x16)
    2577                    
    2578                    $C$DW$230       .dwtag  DW_TAG_member
    2579                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$45)
    2580                            .dwattr $C$DW$230, DW_AT_name("bufend")
    2581                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("bufend")
    2582                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2583                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2584                            .dwattr $C$DW$230, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2585                            .dwattr $C$DW$230, DW_AT_decl_line(0x5f)
    2586                            .dwattr $C$DW$230, DW_AT_decl_column(0x16)
    2587                    
    2588                    $C$DW$231       .dwtag  DW_TAG_member
    2589                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$45)
    2590                            .dwattr $C$DW$231, DW_AT_name("buff_stop")
    2591                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("buff_stop")
    2592                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2593                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2594                            .dwattr $C$DW$231, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2595                            .dwattr $C$DW$231, DW_AT_decl_line(0x60)
    2596                            .dwattr $C$DW$231, DW_AT_decl_column(0x16)
    2597                    
    2598                    $C$DW$232       .dwtag  DW_TAG_member
    2599                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$11)
    2600                            .dwattr $C$DW$232, DW_AT_name("flags")
    2601                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("flags")
    2602                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2603                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2604                            .dwattr $C$DW$232, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2605                            .dwattr $C$DW$232, DW_AT_decl_line(0x61)
    2606                            .dwattr $C$DW$232, DW_AT_decl_column(0x16)
    2607                    
    2608                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2609                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x5b)
    2610                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   50

    2611                            .dwendtag $C$DW$T$46
    2612                    
    2613                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    2614                            .dwattr $C$DW$T$95, DW_AT_name("FILE")
    2615                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$46)
    2616                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2617                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2618                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x62)
    2619                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2620                    
    2621                    
    2622                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2623                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x14)
    2624                    $C$DW$233       .dwtag  DW_TAG_member
    2625                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$34)
    2626                            .dwattr $C$DW$233, DW_AT_name("psI2CInst")
    2627                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("psI2CInst")
    2628                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2630                            .dwattr $C$DW$233, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2631                            .dwattr $C$DW$233, DW_AT_decl_line(0x14c)
    2632                            .dwattr $C$DW$233, DW_AT_decl_column(0x14)
    2633                    
    2634                    $C$DW$234       .dwtag  DW_TAG_member
    2635                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$23)
    2636                            .dwattr $C$DW$234, DW_AT_name("pui8Data")
    2637                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("pui8Data")
    2638                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2639                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2640                            .dwattr $C$DW$234, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2641                            .dwattr $C$DW$234, DW_AT_decl_line(0x151)
    2642                            .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    2643                    
    2644                    $C$DW$235       .dwtag  DW_TAG_member
    2645                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$22)
    2646                            .dwattr $C$DW$235, DW_AT_name("ui16Count")
    2647                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("ui16Count")
    2648                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2649                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2650                            .dwattr $C$DW$235, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2651                            .dwattr $C$DW$235, DW_AT_decl_line(0x156)
    2652                            .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    2653                    
    2654                    $C$DW$236       .dwtag  DW_TAG_member
    2655                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$28)
    2656                            .dwattr $C$DW$236, DW_AT_name("pfnCallback")
    2657                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("pfnCallback")
    2658                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2659                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2660                            .dwattr $C$DW$236, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2661                            .dwattr $C$DW$236, DW_AT_decl_line(0x15b)
    2662                            .dwattr $C$DW$236, DW_AT_decl_column(0x16)
    2663                    
    2664                    $C$DW$237       .dwtag  DW_TAG_member
    2665                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$3)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   51

    2666                            .dwattr $C$DW$237, DW_AT_name("pvCallbackData")
    2667                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("pvCallbackData")
    2668                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2669                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2670                            .dwattr $C$DW$237, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2671                            .dwattr $C$DW$237, DW_AT_decl_line(0x160)
    2672                            .dwattr $C$DW$237, DW_AT_decl_column(0x0b)
    2673                    
    2674                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2675                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x147)
    2676                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2677                            .dwendtag $C$DW$T$47
    2678                    
    2679                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2680                            .dwattr $C$DW$T$96, DW_AT_name("tI2CMRead16BE")
    2681                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$47)
    2682                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2683                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2684                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x162)
    2685                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    2686                    
    2687                    
    2688                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2689                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x14)
    2690                    $C$DW$238       .dwtag  DW_TAG_member
    2691                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$34)
    2692                            .dwattr $C$DW$238, DW_AT_name("psI2CInst")
    2693                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("psI2CInst")
    2694                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2696                            .dwattr $C$DW$238, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2697                            .dwattr $C$DW$238, DW_AT_decl_line(0x170)
    2698                            .dwattr $C$DW$238, DW_AT_decl_column(0x14)
    2699                    
    2700                    $C$DW$239       .dwtag  DW_TAG_member
    2701                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$37)
    2702                            .dwattr $C$DW$239, DW_AT_name("pui8Buffer")
    2703                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("pui8Buffer")
    2704                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2705                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2706                            .dwattr $C$DW$239, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2707                            .dwattr $C$DW$239, DW_AT_decl_line(0x175)
    2708                            .dwattr $C$DW$239, DW_AT_decl_column(0x0d)
    2709                    
    2710                    $C$DW$240       .dwtag  DW_TAG_member
    2711                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
    2712                            .dwattr $C$DW$240, DW_AT_name("ui16Count")
    2713                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("ui16Count")
    2714                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2715                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2716                            .dwattr $C$DW$240, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2717                            .dwattr $C$DW$240, DW_AT_decl_line(0x17a)
    2718                            .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    2719                    
    2720                    $C$DW$241       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   52

    2721                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
    2722                            .dwattr $C$DW$241, DW_AT_name("pui8Data")
    2723                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("pui8Data")
    2724                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2725                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2726                            .dwattr $C$DW$241, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2727                            .dwattr $C$DW$241, DW_AT_decl_line(0x17f)
    2728                            .dwattr $C$DW$241, DW_AT_decl_column(0x14)
    2729                    
    2730                    $C$DW$242       .dwtag  DW_TAG_member
    2731                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$28)
    2732                            .dwattr $C$DW$242, DW_AT_name("pfnCallback")
    2733                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("pfnCallback")
    2734                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2735                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2736                            .dwattr $C$DW$242, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2737                            .dwattr $C$DW$242, DW_AT_decl_line(0x184)
    2738                            .dwattr $C$DW$242, DW_AT_decl_column(0x16)
    2739                    
    2740                    $C$DW$243       .dwtag  DW_TAG_member
    2741                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$3)
    2742                            .dwattr $C$DW$243, DW_AT_name("pvCallbackData")
    2743                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("pvCallbackData")
    2744                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2745                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2746                            .dwattr $C$DW$243, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2747                            .dwattr $C$DW$243, DW_AT_decl_line(0x189)
    2748                            .dwattr $C$DW$243, DW_AT_decl_column(0x0b)
    2749                    
    2750                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2751                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x16b)
    2752                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2753                            .dwendtag $C$DW$T$48
    2754                    
    2755                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    2756                            .dwattr $C$DW$T$97, DW_AT_name("tI2CMWrite16BE")
    2757                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$48)
    2758                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2759                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2760                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x18b)
    2761                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    2762                    
    2763                    
    2764                    $C$DW$T$51      .dwtag  DW_TAG_union_type
    2765                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x14)
    2766                    $C$DW$244       .dwtag  DW_TAG_member
    2767                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$37)
    2768                            .dwattr $C$DW$244, DW_AT_name("pui8Buffer")
    2769                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("pui8Buffer")
    2770                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2771                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2772                            .dwattr $C$DW$244, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2773                            .dwattr $C$DW$244, DW_AT_decl_line(0x58)
    2774                            .dwattr $C$DW$244, DW_AT_decl_column(0x11)
    2775                    
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   53

    2776                    $C$DW$245       .dwtag  DW_TAG_member
    2777                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$49)
    2778                            .dwattr $C$DW$245, DW_AT_name("sWriteState")
    2779                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("sWriteState")
    2780                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2782                            .dwattr $C$DW$245, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2783                            .dwattr $C$DW$245, DW_AT_decl_line(0x5d)
    2784                            .dwattr $C$DW$245, DW_AT_decl_column(0x15)
    2785                    
    2786                    $C$DW$246       .dwtag  DW_TAG_member
    2787                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$50)
    2788                            .dwattr $C$DW$246, DW_AT_name("sReadModifyWriteState")
    2789                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2790                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2791                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2792                            .dwattr $C$DW$246, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2793                            .dwattr $C$DW$246, DW_AT_decl_line(0x62)
    2794                            .dwattr $C$DW$246, DW_AT_decl_column(0x1f)
    2795                    
    2796                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2797                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x54)
    2798                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
    2799                            .dwendtag $C$DW$T$51
    2800                    
    2801                    
    2802                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    2803                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    2804                    $C$DW$247       .dwtag  DW_TAG_member
    2805                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$52)
    2806                            .dwattr $C$DW$247, DW_AT_name("pui8Buffer")
    2807                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("pui8Buffer")
    2808                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2809                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2810                            .dwattr $C$DW$247, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2811                            .dwattr $C$DW$247, DW_AT_decl_line(0x74)
    2812                            .dwattr $C$DW$247, DW_AT_decl_column(0x11)
    2813                    
    2814                    $C$DW$248       .dwtag  DW_TAG_member
    2815                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$49)
    2816                            .dwattr $C$DW$248, DW_AT_name("sWriteState")
    2817                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("sWriteState")
    2818                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2819                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2820                            .dwattr $C$DW$248, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2821                            .dwattr $C$DW$248, DW_AT_decl_line(0x79)
    2822                            .dwattr $C$DW$248, DW_AT_decl_column(0x15)
    2823                    
    2824                    $C$DW$249       .dwtag  DW_TAG_member
    2825                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$50)
    2826                            .dwattr $C$DW$249, DW_AT_name("sReadModifyWriteState")
    2827                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2828                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2829                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2830                            .dwattr $C$DW$249, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   54

    2831                            .dwattr $C$DW$249, DW_AT_decl_line(0x7e)
    2832                            .dwattr $C$DW$249, DW_AT_decl_column(0x1f)
    2833                    
    2834                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2835                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x70)
    2836                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    2837                            .dwendtag $C$DW$T$53
    2838                    
    2839                    
    2840                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2841                            .dwattr $C$DW$T$55, DW_AT_name("HeapRegion")
    2842                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    2843                    $C$DW$250       .dwtag  DW_TAG_member
    2844                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$23)
    2845                            .dwattr $C$DW$250, DW_AT_name("pucStartAddress")
    2846                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("pucStartAddress")
    2847                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2848                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2849                            .dwattr $C$DW$250, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2850                            .dwattr $C$DW$250, DW_AT_decl_line(0x96)
    2851                            .dwattr $C$DW$250, DW_AT_decl_column(0x0b)
    2852                    
    2853                    $C$DW$251       .dwtag  DW_TAG_member
    2854                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$54)
    2855                            .dwattr $C$DW$251, DW_AT_name("xSizeInBytes")
    2856                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("xSizeInBytes")
    2857                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2858                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2859                            .dwattr $C$DW$251, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2860                            .dwattr $C$DW$251, DW_AT_decl_line(0x97)
    2861                            .dwattr $C$DW$251, DW_AT_decl_column(0x09)
    2862                    
    2863                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2864                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x94)
    2865                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    2866                            .dwendtag $C$DW$T$55
    2867                    
    2868                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2869                            .dwattr $C$DW$T$98, DW_AT_name("HeapRegion_t")
    2870                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$55)
    2871                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2872                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2873                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x98)
    2874                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    2875                    
    2876                    
    2877                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2878                            .dwattr $C$DW$T$56, DW_AT_name("ReportData_Item")
    2879                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x18)
    2880                    $C$DW$252       .dwtag  DW_TAG_member
    2881                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    2882                            .dwattr $C$DW$252, DW_AT_name("TimeStamp")
    2883                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("TimeStamp")
    2884                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2885                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 18 13:16:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   55

    2886                            .dwattr $C$DW$252, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2887                            .dwattr $C$DW$252, DW_AT_decl_line(0x20)
    2888                            .dwattr $C$DW$252, DW_AT_decl_column(0x2b)
    2889                    
    2890                    $C$DW$253       .dwtag  DW_TAG_member
    2891                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    2892                            .dwattr $C$DW$253, DW_AT_name("ReportName")
    2893                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("ReportName")
    2894                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2895                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2896                            .dwattr $C$DW$253, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2897                            .dwattr $C$DW$253, DW_AT_decl_line(0x21)
    2898                            .dwattr $C$DW$253, DW_AT_decl_column(0x13)
    2899                    
    2900                    $C$DW$254       .dwtag  DW_TAG_member
    2901                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$24)
    2902                            .dwattr $C$DW$254, DW_AT_name("ReportValue_0")
    2903                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("ReportValue_0")
    2904                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2905                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2906                            .dwattr $C$DW$254, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2907                            .dwattr $C$DW$254, DW_AT_decl_line(0x22)
    2908                            .dwattr $C$DW$254, DW_AT_decl_column(0x13)
    2909                    
    2910                    $C$DW$255       .dwtag  DW_TAG_member
    2911                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$24)
    2912                            .dwattr $C$DW$255, DW_AT_name("ReportValue_1")
    2913                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("ReportValue_1")
    2914                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2915                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2916                            .dwattr $C$DW$255, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2917                            .dwattr $C$DW$255, DW_AT_decl_line(0x23)
    2918                            .dwattr $C$DW$255, DW_AT_decl_column(0x13)
    2919                    
    2920                    $C$DW$256       .dwtag  DW_TAG_member
    2921                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$24)
    2922                            .dwattr $C$DW$256, DW_AT_name("ReportValue_2")
    2923                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("ReportValue_2")
    2924                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2925                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2926                            .dwattr $C$DW$256, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2927                            .dwattr $C$DW$256, DW_AT_decl_line(0x24)
    2928                            .dwattr $C$DW$256, DW_AT_decl_column(0x13)
    2929                    
    2930                    $C$DW$257       .dwtag  DW_TAG_member
